#![no_std]
#![allow(
    dead_code,
    unused_imports,
    improper_ctypes,
    non_snake_case,
    non_camel_case_types,
    non_upper_case_globals,
    unsafe_op_in_unsafe_fn,
    clippy::missing_safety_doc
)]

/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::core::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::core::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::core::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
#[repr(C)]
pub struct __BindgenUnionField<T>(::core::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::core::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {

pub const ACPI_MAX_SEMAPHORE_COUNT: u32 = 256;
pub const ACPI_MAX_REFERENCE_COUNT: u32 = 16384;
pub const ACPI_DEFAULT_PAGE_SIZE: u32 = 4096;
pub const ACPI_NUM_OWNERID_MASKS: u32 = 128;
pub const ACPI_ROOT_TABLE_SIZE_INCREMENT: u32 = 4;
pub const ACPI_MAX_SLEEP: u32 = 2000;
pub const ACPI_ADDRESS_RANGE_MAX: u32 = 2;
pub const ACPI_MAX_LOOP_TIMEOUT: u32 = 30;
pub const ACPI_METHOD_NUM_LOCALS: u32 = 8;
pub const ACPI_METHOD_MAX_LOCAL: u32 = 7;
pub const ACPI_METHOD_NUM_ARGS: u32 = 7;
pub const ACPI_METHOD_MAX_ARG: u32 = 6;
pub const ACPI_OBJ_NUM_OPERANDS: u32 = 8;
pub const ACPI_OBJ_MAX_OPERAND: u32 = 7;
pub const ACPI_RESULTS_FRAME_OBJ_NUM: u32 = 8;
pub const ACPI_RESULTS_OBJ_NUM_MAX: u32 = 255;
pub const ACPI_EBDA_PTR_LOCATION: u32 = 1038;
pub const ACPI_EBDA_PTR_LENGTH: u32 = 2;
pub const ACPI_EBDA_WINDOW_SIZE: u32 = 1024;
pub const ACPI_HI_RSDP_WINDOW_BASE: u32 = 917504;
pub const ACPI_HI_RSDP_WINDOW_SIZE: u32 = 131072;
pub const ACPI_RSDP_SCAN_STEP: u32 = 16;
pub const ACPI_USER_REGION_BEGIN: u32 = 128;
pub const ACPI_MAX_ADDRESS_SPACE: u32 = 255;
pub const ACPI_NUM_DEFAULT_SPACES: u32 = 4;
pub const ACPI_MAX_MATCH_OPCODE: u32 = 5;
pub const ACPI_RSDP_CHECKSUM_LENGTH: u32 = 20;
pub const ACPI_RSDP_XCHECKSUM_LENGTH: u32 = 36;
pub const ACPI_SERIAL_HEADER_SIZE: u32 = 2;
pub const ACPI_SMBUS_DATA_SIZE: u32 = 32;
pub const ACPI_SMBUS_BUFFER_SIZE: u32 = 34;
pub const ACPI_IPMI_DATA_SIZE: u32 = 64;
pub const ACPI_IPMI_BUFFER_SIZE: u32 = 66;
pub const ACPI_MAX_GSBUS_DATA_SIZE: u32 = 255;
pub const ACPI_MAX_GSBUS_BUFFER_SIZE: u32 = 257;
pub const ACPI_PRM_INPUT_BUFFER_SIZE: u32 = 26;
pub const ACPI_FFH_INPUT_BUFFER_SIZE: u32 = 256;
pub const ACPI_NUM_SxD_METHODS: u32 = 4;
pub const ACPI_NUM_SxW_METHODS: u32 = 5;
pub const UUID_BUFFER_LENGTH: u32 = 16;
pub const UUID_STRING_LENGTH: u32 = 36;
pub const UUID_HYPHEN1_OFFSET: u32 = 8;
pub const UUID_HYPHEN2_OFFSET: u32 = 13;
pub const UUID_HYPHEN3_OFFSET: u32 = 18;
pub const UUID_HYPHEN4_OFFSET: u32 = 23;
pub const ACPI_DEBUGGER_MAX_ARGS: u32 = 11;
pub const ACPI_DB_LINE_BUFFER_SIZE: u32 = 512;
pub const ACPI_DEBUGGER_COMMAND_PROMPT: u8 = 45u8;
pub const ACPI_DEBUGGER_EXECUTE_PROMPT: u8 = 37u8;
pub const ACPI_PLD_REV1_BUFFER_SIZE: u32 = 16;
pub const ACPI_PLD_REV2_BUFFER_SIZE: u32 = 20;
pub const ACPI_PLD_BUFFER_SIZE: u32 = 20;
pub const ACPI_PLD_PANEL_TOP: u32 = 0;
pub const ACPI_PLD_PANEL_BOTTOM: u32 = 1;
pub const ACPI_PLD_PANEL_LEFT: u32 = 2;
pub const ACPI_PLD_PANEL_RIGHT: u32 = 3;
pub const ACPI_PLD_PANEL_FRONT: u32 = 4;
pub const ACPI_PLD_PANEL_BACK: u32 = 5;
pub const ACPI_PLD_PANEL_UNKNOWN: u32 = 6;
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
pub type wchar_t = ::core::ffi::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::core::ffi::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::core::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::core::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::core::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::core::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub type __u_char = ::core::ffi::c_uchar;
pub type __u_short = ::core::ffi::c_ushort;
pub type __u_int = ::core::ffi::c_uint;
pub type __u_long = ::core::ffi::c_ulong;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_long;
pub type __uint64_t = ::core::ffi::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::core::ffi::c_long;
pub type __u_quad_t = ::core::ffi::c_ulong;
pub type __intmax_t = ::core::ffi::c_long;
pub type __uintmax_t = ::core::ffi::c_ulong;
pub type __dev_t = ::core::ffi::c_ulong;
pub type __uid_t = ::core::ffi::c_uint;
pub type __gid_t = ::core::ffi::c_uint;
pub type __ino_t = ::core::ffi::c_ulong;
pub type __ino64_t = ::core::ffi::c_ulong;
pub type __mode_t = ::core::ffi::c_uint;
pub type __nlink_t = ::core::ffi::c_ulong;
pub type __off_t = ::core::ffi::c_long;
pub type __off64_t = ::core::ffi::c_long;
pub type __pid_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::core::ffi::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::core::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::core::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::core::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::core::ffi::c_long;
pub type __rlim_t = ::core::ffi::c_ulong;
pub type __rlim64_t = ::core::ffi::c_ulong;
pub type __id_t = ::core::ffi::c_uint;
pub type __time_t = ::core::ffi::c_long;
pub type __useconds_t = ::core::ffi::c_uint;
pub type __suseconds_t = ::core::ffi::c_long;
pub type __suseconds64_t = ::core::ffi::c_long;
pub type __daddr_t = ::core::ffi::c_int;
pub type __key_t = ::core::ffi::c_int;
pub type __clockid_t = ::core::ffi::c_int;
pub type __timer_t = *mut ::core::ffi::c_void;
pub type __blksize_t = ::core::ffi::c_long;
pub type __blkcnt_t = ::core::ffi::c_long;
pub type __blkcnt64_t = ::core::ffi::c_long;
pub type __fsblkcnt_t = ::core::ffi::c_ulong;
pub type __fsblkcnt64_t = ::core::ffi::c_ulong;
pub type __fsfilcnt_t = ::core::ffi::c_ulong;
pub type __fsfilcnt64_t = ::core::ffi::c_ulong;
pub type __fsword_t = ::core::ffi::c_long;
pub type __ssize_t = ::core::ffi::c_long;
pub type __syscall_slong_t = ::core::ffi::c_long;
pub type __syscall_ulong_t = ::core::ffi::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::core::ffi::c_char;
pub type __intptr_t = ::core::ffi::c_long;
pub type __socklen_t = ::core::ffi::c_uint;
pub type __sig_atomic_t = ::core::ffi::c_int;
pub type gid_t = __gid_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type useconds_t = __useconds_t;
pub type pid_t = __pid_t;
pub type socklen_t = __socklen_t;
unsafe extern "C" {
    pub fn access(
        __name: *const ::core::ffi::c_char,
        __type: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn faccessat(
        __fd: ::core::ffi::c_int,
        __file: *const ::core::ffi::c_char,
        __type: ::core::ffi::c_int,
        __flag: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn lseek(
        __fd: ::core::ffi::c_int,
        __offset: __off_t,
        __whence: ::core::ffi::c_int,
    ) -> __off_t;
}
unsafe extern "C" {
    pub fn close(__fd: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn closefrom(__lowfd: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn read(
        __fd: ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_void,
        __nbytes: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn write(__fd: ::core::ffi::c_int, __buf: *const ::core::ffi::c_void, __n: usize) -> isize;
}
unsafe extern "C" {
    pub fn pread(
        __fd: ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_void,
        __nbytes: usize,
        __offset: __off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pwrite(
        __fd: ::core::ffi::c_int,
        __buf: *const ::core::ffi::c_void,
        __n: usize,
        __offset: __off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pipe(__pipedes: *mut ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn alarm(__seconds: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn sleep(__seconds: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn ualarm(__value: __useconds_t, __interval: __useconds_t) -> __useconds_t;
}
unsafe extern "C" {
    pub fn usleep(__useconds: __useconds_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pause() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn chown(
        __file: *const ::core::ffi::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fchown(
        __fd: ::core::ffi::c_int,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn lchown(
        __file: *const ::core::ffi::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fchownat(
        __fd: ::core::ffi::c_int,
        __file: *const ::core::ffi::c_char,
        __owner: __uid_t,
        __group: __gid_t,
        __flag: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn chdir(__path: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fchdir(__fd: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getcwd(__buf: *mut ::core::ffi::c_char, __size: usize) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn getwd(__buf: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn dup(__fd: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn dup2(__fd: ::core::ffi::c_int, __fd2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut __environ: *mut *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn execve(
        __path: *const ::core::ffi::c_char,
        __argv: *const *mut ::core::ffi::c_char,
        __envp: *const *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fexecve(
        __fd: ::core::ffi::c_int,
        __argv: *const *mut ::core::ffi::c_char,
        __envp: *const *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn execv(
        __path: *const ::core::ffi::c_char,
        __argv: *const *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn execle(
        __path: *const ::core::ffi::c_char,
        __arg: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn execl(
        __path: *const ::core::ffi::c_char,
        __arg: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn execvp(
        __file: *const ::core::ffi::c_char,
        __argv: *const *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn execlp(
        __file: *const ::core::ffi::c_char,
        __arg: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn nice(__inc: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _exit(__status: ::core::ffi::c_int) -> !;
}
pub const _PC_LINK_MAX: _bindgen_ty_1 = 0;
pub const _PC_MAX_CANON: _bindgen_ty_1 = 1;
pub const _PC_MAX_INPUT: _bindgen_ty_1 = 2;
pub const _PC_NAME_MAX: _bindgen_ty_1 = 3;
pub const _PC_PATH_MAX: _bindgen_ty_1 = 4;
pub const _PC_PIPE_BUF: _bindgen_ty_1 = 5;
pub const _PC_CHOWN_RESTRICTED: _bindgen_ty_1 = 6;
pub const _PC_NO_TRUNC: _bindgen_ty_1 = 7;
pub const _PC_VDISABLE: _bindgen_ty_1 = 8;
pub const _PC_SYNC_IO: _bindgen_ty_1 = 9;
pub const _PC_ASYNC_IO: _bindgen_ty_1 = 10;
pub const _PC_PRIO_IO: _bindgen_ty_1 = 11;
pub const _PC_SOCK_MAXBUF: _bindgen_ty_1 = 12;
pub const _PC_FILESIZEBITS: _bindgen_ty_1 = 13;
pub const _PC_REC_INCR_XFER_SIZE: _bindgen_ty_1 = 14;
pub const _PC_REC_MAX_XFER_SIZE: _bindgen_ty_1 = 15;
pub const _PC_REC_MIN_XFER_SIZE: _bindgen_ty_1 = 16;
pub const _PC_REC_XFER_ALIGN: _bindgen_ty_1 = 17;
pub const _PC_ALLOC_SIZE_MIN: _bindgen_ty_1 = 18;
pub const _PC_SYMLINK_MAX: _bindgen_ty_1 = 19;
pub const _PC_2_SYMLINKS: _bindgen_ty_1 = 20;
pub type _bindgen_ty_1 = ::core::ffi::c_uint;
pub const _SC_ARG_MAX: _bindgen_ty_2 = 0;
pub const _SC_CHILD_MAX: _bindgen_ty_2 = 1;
pub const _SC_CLK_TCK: _bindgen_ty_2 = 2;
pub const _SC_NGROUPS_MAX: _bindgen_ty_2 = 3;
pub const _SC_OPEN_MAX: _bindgen_ty_2 = 4;
pub const _SC_STREAM_MAX: _bindgen_ty_2 = 5;
pub const _SC_TZNAME_MAX: _bindgen_ty_2 = 6;
pub const _SC_JOB_CONTROL: _bindgen_ty_2 = 7;
pub const _SC_SAVED_IDS: _bindgen_ty_2 = 8;
pub const _SC_REALTIME_SIGNALS: _bindgen_ty_2 = 9;
pub const _SC_PRIORITY_SCHEDULING: _bindgen_ty_2 = 10;
pub const _SC_TIMERS: _bindgen_ty_2 = 11;
pub const _SC_ASYNCHRONOUS_IO: _bindgen_ty_2 = 12;
pub const _SC_PRIORITIZED_IO: _bindgen_ty_2 = 13;
pub const _SC_SYNCHRONIZED_IO: _bindgen_ty_2 = 14;
pub const _SC_FSYNC: _bindgen_ty_2 = 15;
pub const _SC_MAPPED_FILES: _bindgen_ty_2 = 16;
pub const _SC_MEMLOCK: _bindgen_ty_2 = 17;
pub const _SC_MEMLOCK_RANGE: _bindgen_ty_2 = 18;
pub const _SC_MEMORY_PROTECTION: _bindgen_ty_2 = 19;
pub const _SC_MESSAGE_PASSING: _bindgen_ty_2 = 20;
pub const _SC_SEMAPHORES: _bindgen_ty_2 = 21;
pub const _SC_SHARED_MEMORY_OBJECTS: _bindgen_ty_2 = 22;
pub const _SC_AIO_LISTIO_MAX: _bindgen_ty_2 = 23;
pub const _SC_AIO_MAX: _bindgen_ty_2 = 24;
pub const _SC_AIO_PRIO_DELTA_MAX: _bindgen_ty_2 = 25;
pub const _SC_DELAYTIMER_MAX: _bindgen_ty_2 = 26;
pub const _SC_MQ_OPEN_MAX: _bindgen_ty_2 = 27;
pub const _SC_MQ_PRIO_MAX: _bindgen_ty_2 = 28;
pub const _SC_VERSION: _bindgen_ty_2 = 29;
pub const _SC_PAGESIZE: _bindgen_ty_2 = 30;
pub const _SC_RTSIG_MAX: _bindgen_ty_2 = 31;
pub const _SC_SEM_NSEMS_MAX: _bindgen_ty_2 = 32;
pub const _SC_SEM_VALUE_MAX: _bindgen_ty_2 = 33;
pub const _SC_SIGQUEUE_MAX: _bindgen_ty_2 = 34;
pub const _SC_TIMER_MAX: _bindgen_ty_2 = 35;
pub const _SC_BC_BASE_MAX: _bindgen_ty_2 = 36;
pub const _SC_BC_DIM_MAX: _bindgen_ty_2 = 37;
pub const _SC_BC_SCALE_MAX: _bindgen_ty_2 = 38;
pub const _SC_BC_STRING_MAX: _bindgen_ty_2 = 39;
pub const _SC_COLL_WEIGHTS_MAX: _bindgen_ty_2 = 40;
pub const _SC_EQUIV_CLASS_MAX: _bindgen_ty_2 = 41;
pub const _SC_EXPR_NEST_MAX: _bindgen_ty_2 = 42;
pub const _SC_LINE_MAX: _bindgen_ty_2 = 43;
pub const _SC_RE_DUP_MAX: _bindgen_ty_2 = 44;
pub const _SC_CHARCLASS_NAME_MAX: _bindgen_ty_2 = 45;
pub const _SC_2_VERSION: _bindgen_ty_2 = 46;
pub const _SC_2_C_BIND: _bindgen_ty_2 = 47;
pub const _SC_2_C_DEV: _bindgen_ty_2 = 48;
pub const _SC_2_FORT_DEV: _bindgen_ty_2 = 49;
pub const _SC_2_FORT_RUN: _bindgen_ty_2 = 50;
pub const _SC_2_SW_DEV: _bindgen_ty_2 = 51;
pub const _SC_2_LOCALEDEF: _bindgen_ty_2 = 52;
pub const _SC_PII: _bindgen_ty_2 = 53;
pub const _SC_PII_XTI: _bindgen_ty_2 = 54;
pub const _SC_PII_SOCKET: _bindgen_ty_2 = 55;
pub const _SC_PII_INTERNET: _bindgen_ty_2 = 56;
pub const _SC_PII_OSI: _bindgen_ty_2 = 57;
pub const _SC_POLL: _bindgen_ty_2 = 58;
pub const _SC_SELECT: _bindgen_ty_2 = 59;
pub const _SC_UIO_MAXIOV: _bindgen_ty_2 = 60;
pub const _SC_IOV_MAX: _bindgen_ty_2 = 60;
pub const _SC_PII_INTERNET_STREAM: _bindgen_ty_2 = 61;
pub const _SC_PII_INTERNET_DGRAM: _bindgen_ty_2 = 62;
pub const _SC_PII_OSI_COTS: _bindgen_ty_2 = 63;
pub const _SC_PII_OSI_CLTS: _bindgen_ty_2 = 64;
pub const _SC_PII_OSI_M: _bindgen_ty_2 = 65;
pub const _SC_T_IOV_MAX: _bindgen_ty_2 = 66;
pub const _SC_THREADS: _bindgen_ty_2 = 67;
pub const _SC_THREAD_SAFE_FUNCTIONS: _bindgen_ty_2 = 68;
pub const _SC_GETGR_R_SIZE_MAX: _bindgen_ty_2 = 69;
pub const _SC_GETPW_R_SIZE_MAX: _bindgen_ty_2 = 70;
pub const _SC_LOGIN_NAME_MAX: _bindgen_ty_2 = 71;
pub const _SC_TTY_NAME_MAX: _bindgen_ty_2 = 72;
pub const _SC_THREAD_DESTRUCTOR_ITERATIONS: _bindgen_ty_2 = 73;
pub const _SC_THREAD_KEYS_MAX: _bindgen_ty_2 = 74;
pub const _SC_THREAD_STACK_MIN: _bindgen_ty_2 = 75;
pub const _SC_THREAD_THREADS_MAX: _bindgen_ty_2 = 76;
pub const _SC_THREAD_ATTR_STACKADDR: _bindgen_ty_2 = 77;
pub const _SC_THREAD_ATTR_STACKSIZE: _bindgen_ty_2 = 78;
pub const _SC_THREAD_PRIORITY_SCHEDULING: _bindgen_ty_2 = 79;
pub const _SC_THREAD_PRIO_INHERIT: _bindgen_ty_2 = 80;
pub const _SC_THREAD_PRIO_PROTECT: _bindgen_ty_2 = 81;
pub const _SC_THREAD_PROCESS_SHARED: _bindgen_ty_2 = 82;
pub const _SC_NPROCESSORS_CONF: _bindgen_ty_2 = 83;
pub const _SC_NPROCESSORS_ONLN: _bindgen_ty_2 = 84;
pub const _SC_PHYS_PAGES: _bindgen_ty_2 = 85;
pub const _SC_AVPHYS_PAGES: _bindgen_ty_2 = 86;
pub const _SC_ATEXIT_MAX: _bindgen_ty_2 = 87;
pub const _SC_PASS_MAX: _bindgen_ty_2 = 88;
pub const _SC_XOPEN_VERSION: _bindgen_ty_2 = 89;
pub const _SC_XOPEN_XCU_VERSION: _bindgen_ty_2 = 90;
pub const _SC_XOPEN_UNIX: _bindgen_ty_2 = 91;
pub const _SC_XOPEN_CRYPT: _bindgen_ty_2 = 92;
pub const _SC_XOPEN_ENH_I18N: _bindgen_ty_2 = 93;
pub const _SC_XOPEN_SHM: _bindgen_ty_2 = 94;
pub const _SC_2_CHAR_TERM: _bindgen_ty_2 = 95;
pub const _SC_2_C_VERSION: _bindgen_ty_2 = 96;
pub const _SC_2_UPE: _bindgen_ty_2 = 97;
pub const _SC_XOPEN_XPG2: _bindgen_ty_2 = 98;
pub const _SC_XOPEN_XPG3: _bindgen_ty_2 = 99;
pub const _SC_XOPEN_XPG4: _bindgen_ty_2 = 100;
pub const _SC_CHAR_BIT: _bindgen_ty_2 = 101;
pub const _SC_CHAR_MAX: _bindgen_ty_2 = 102;
pub const _SC_CHAR_MIN: _bindgen_ty_2 = 103;
pub const _SC_INT_MAX: _bindgen_ty_2 = 104;
pub const _SC_INT_MIN: _bindgen_ty_2 = 105;
pub const _SC_LONG_BIT: _bindgen_ty_2 = 106;
pub const _SC_WORD_BIT: _bindgen_ty_2 = 107;
pub const _SC_MB_LEN_MAX: _bindgen_ty_2 = 108;
pub const _SC_NZERO: _bindgen_ty_2 = 109;
pub const _SC_SSIZE_MAX: _bindgen_ty_2 = 110;
pub const _SC_SCHAR_MAX: _bindgen_ty_2 = 111;
pub const _SC_SCHAR_MIN: _bindgen_ty_2 = 112;
pub const _SC_SHRT_MAX: _bindgen_ty_2 = 113;
pub const _SC_SHRT_MIN: _bindgen_ty_2 = 114;
pub const _SC_UCHAR_MAX: _bindgen_ty_2 = 115;
pub const _SC_UINT_MAX: _bindgen_ty_2 = 116;
pub const _SC_ULONG_MAX: _bindgen_ty_2 = 117;
pub const _SC_USHRT_MAX: _bindgen_ty_2 = 118;
pub const _SC_NL_ARGMAX: _bindgen_ty_2 = 119;
pub const _SC_NL_LANGMAX: _bindgen_ty_2 = 120;
pub const _SC_NL_MSGMAX: _bindgen_ty_2 = 121;
pub const _SC_NL_NMAX: _bindgen_ty_2 = 122;
pub const _SC_NL_SETMAX: _bindgen_ty_2 = 123;
pub const _SC_NL_TEXTMAX: _bindgen_ty_2 = 124;
pub const _SC_XBS5_ILP32_OFF32: _bindgen_ty_2 = 125;
pub const _SC_XBS5_ILP32_OFFBIG: _bindgen_ty_2 = 126;
pub const _SC_XBS5_LP64_OFF64: _bindgen_ty_2 = 127;
pub const _SC_XBS5_LPBIG_OFFBIG: _bindgen_ty_2 = 128;
pub const _SC_XOPEN_LEGACY: _bindgen_ty_2 = 129;
pub const _SC_XOPEN_REALTIME: _bindgen_ty_2 = 130;
pub const _SC_XOPEN_REALTIME_THREADS: _bindgen_ty_2 = 131;
pub const _SC_ADVISORY_INFO: _bindgen_ty_2 = 132;
pub const _SC_BARRIERS: _bindgen_ty_2 = 133;
pub const _SC_BASE: _bindgen_ty_2 = 134;
pub const _SC_C_LANG_SUPPORT: _bindgen_ty_2 = 135;
pub const _SC_C_LANG_SUPPORT_R: _bindgen_ty_2 = 136;
pub const _SC_CLOCK_SELECTION: _bindgen_ty_2 = 137;
pub const _SC_CPUTIME: _bindgen_ty_2 = 138;
pub const _SC_THREAD_CPUTIME: _bindgen_ty_2 = 139;
pub const _SC_DEVICE_IO: _bindgen_ty_2 = 140;
pub const _SC_DEVICE_SPECIFIC: _bindgen_ty_2 = 141;
pub const _SC_DEVICE_SPECIFIC_R: _bindgen_ty_2 = 142;
pub const _SC_FD_MGMT: _bindgen_ty_2 = 143;
pub const _SC_FIFO: _bindgen_ty_2 = 144;
pub const _SC_PIPE: _bindgen_ty_2 = 145;
pub const _SC_FILE_ATTRIBUTES: _bindgen_ty_2 = 146;
pub const _SC_FILE_LOCKING: _bindgen_ty_2 = 147;
pub const _SC_FILE_SYSTEM: _bindgen_ty_2 = 148;
pub const _SC_MONOTONIC_CLOCK: _bindgen_ty_2 = 149;
pub const _SC_MULTI_PROCESS: _bindgen_ty_2 = 150;
pub const _SC_SINGLE_PROCESS: _bindgen_ty_2 = 151;
pub const _SC_NETWORKING: _bindgen_ty_2 = 152;
pub const _SC_READER_WRITER_LOCKS: _bindgen_ty_2 = 153;
pub const _SC_SPIN_LOCKS: _bindgen_ty_2 = 154;
pub const _SC_REGEXP: _bindgen_ty_2 = 155;
pub const _SC_REGEX_VERSION: _bindgen_ty_2 = 156;
pub const _SC_SHELL: _bindgen_ty_2 = 157;
pub const _SC_SIGNALS: _bindgen_ty_2 = 158;
pub const _SC_SPAWN: _bindgen_ty_2 = 159;
pub const _SC_SPORADIC_SERVER: _bindgen_ty_2 = 160;
pub const _SC_THREAD_SPORADIC_SERVER: _bindgen_ty_2 = 161;
pub const _SC_SYSTEM_DATABASE: _bindgen_ty_2 = 162;
pub const _SC_SYSTEM_DATABASE_R: _bindgen_ty_2 = 163;
pub const _SC_TIMEOUTS: _bindgen_ty_2 = 164;
pub const _SC_TYPED_MEMORY_OBJECTS: _bindgen_ty_2 = 165;
pub const _SC_USER_GROUPS: _bindgen_ty_2 = 166;
pub const _SC_USER_GROUPS_R: _bindgen_ty_2 = 167;
pub const _SC_2_PBS: _bindgen_ty_2 = 168;
pub const _SC_2_PBS_ACCOUNTING: _bindgen_ty_2 = 169;
pub const _SC_2_PBS_LOCATE: _bindgen_ty_2 = 170;
pub const _SC_2_PBS_MESSAGE: _bindgen_ty_2 = 171;
pub const _SC_2_PBS_TRACK: _bindgen_ty_2 = 172;
pub const _SC_SYMLOOP_MAX: _bindgen_ty_2 = 173;
pub const _SC_STREAMS: _bindgen_ty_2 = 174;
pub const _SC_2_PBS_CHECKPOINT: _bindgen_ty_2 = 175;
pub const _SC_V6_ILP32_OFF32: _bindgen_ty_2 = 176;
pub const _SC_V6_ILP32_OFFBIG: _bindgen_ty_2 = 177;
pub const _SC_V6_LP64_OFF64: _bindgen_ty_2 = 178;
pub const _SC_V6_LPBIG_OFFBIG: _bindgen_ty_2 = 179;
pub const _SC_HOST_NAME_MAX: _bindgen_ty_2 = 180;
pub const _SC_TRACE: _bindgen_ty_2 = 181;
pub const _SC_TRACE_EVENT_FILTER: _bindgen_ty_2 = 182;
pub const _SC_TRACE_INHERIT: _bindgen_ty_2 = 183;
pub const _SC_TRACE_LOG: _bindgen_ty_2 = 184;
pub const _SC_LEVEL1_ICACHE_SIZE: _bindgen_ty_2 = 185;
pub const _SC_LEVEL1_ICACHE_ASSOC: _bindgen_ty_2 = 186;
pub const _SC_LEVEL1_ICACHE_LINESIZE: _bindgen_ty_2 = 187;
pub const _SC_LEVEL1_DCACHE_SIZE: _bindgen_ty_2 = 188;
pub const _SC_LEVEL1_DCACHE_ASSOC: _bindgen_ty_2 = 189;
pub const _SC_LEVEL1_DCACHE_LINESIZE: _bindgen_ty_2 = 190;
pub const _SC_LEVEL2_CACHE_SIZE: _bindgen_ty_2 = 191;
pub const _SC_LEVEL2_CACHE_ASSOC: _bindgen_ty_2 = 192;
pub const _SC_LEVEL2_CACHE_LINESIZE: _bindgen_ty_2 = 193;
pub const _SC_LEVEL3_CACHE_SIZE: _bindgen_ty_2 = 194;
pub const _SC_LEVEL3_CACHE_ASSOC: _bindgen_ty_2 = 195;
pub const _SC_LEVEL3_CACHE_LINESIZE: _bindgen_ty_2 = 196;
pub const _SC_LEVEL4_CACHE_SIZE: _bindgen_ty_2 = 197;
pub const _SC_LEVEL4_CACHE_ASSOC: _bindgen_ty_2 = 198;
pub const _SC_LEVEL4_CACHE_LINESIZE: _bindgen_ty_2 = 199;
pub const _SC_IPV6: _bindgen_ty_2 = 235;
pub const _SC_RAW_SOCKETS: _bindgen_ty_2 = 236;
pub const _SC_V7_ILP32_OFF32: _bindgen_ty_2 = 237;
pub const _SC_V7_ILP32_OFFBIG: _bindgen_ty_2 = 238;
pub const _SC_V7_LP64_OFF64: _bindgen_ty_2 = 239;
pub const _SC_V7_LPBIG_OFFBIG: _bindgen_ty_2 = 240;
pub const _SC_SS_REPL_MAX: _bindgen_ty_2 = 241;
pub const _SC_TRACE_EVENT_NAME_MAX: _bindgen_ty_2 = 242;
pub const _SC_TRACE_NAME_MAX: _bindgen_ty_2 = 243;
pub const _SC_TRACE_SYS_MAX: _bindgen_ty_2 = 244;
pub const _SC_TRACE_USER_EVENT_MAX: _bindgen_ty_2 = 245;
pub const _SC_XOPEN_STREAMS: _bindgen_ty_2 = 246;
pub const _SC_THREAD_ROBUST_PRIO_INHERIT: _bindgen_ty_2 = 247;
pub const _SC_THREAD_ROBUST_PRIO_PROTECT: _bindgen_ty_2 = 248;
pub const _SC_MINSIGSTKSZ: _bindgen_ty_2 = 249;
pub const _SC_SIGSTKSZ: _bindgen_ty_2 = 250;
pub type _bindgen_ty_2 = ::core::ffi::c_uint;
pub const _CS_PATH: _bindgen_ty_3 = 0;
pub const _CS_V6_WIDTH_RESTRICTED_ENVS: _bindgen_ty_3 = 1;
pub const _CS_GNU_LIBC_VERSION: _bindgen_ty_3 = 2;
pub const _CS_GNU_LIBPTHREAD_VERSION: _bindgen_ty_3 = 3;
pub const _CS_V5_WIDTH_RESTRICTED_ENVS: _bindgen_ty_3 = 4;
pub const _CS_V7_WIDTH_RESTRICTED_ENVS: _bindgen_ty_3 = 5;
pub const _CS_LFS_CFLAGS: _bindgen_ty_3 = 1000;
pub const _CS_LFS_LDFLAGS: _bindgen_ty_3 = 1001;
pub const _CS_LFS_LIBS: _bindgen_ty_3 = 1002;
pub const _CS_LFS_LINTFLAGS: _bindgen_ty_3 = 1003;
pub const _CS_LFS64_CFLAGS: _bindgen_ty_3 = 1004;
pub const _CS_LFS64_LDFLAGS: _bindgen_ty_3 = 1005;
pub const _CS_LFS64_LIBS: _bindgen_ty_3 = 1006;
pub const _CS_LFS64_LINTFLAGS: _bindgen_ty_3 = 1007;
pub const _CS_XBS5_ILP32_OFF32_CFLAGS: _bindgen_ty_3 = 1100;
pub const _CS_XBS5_ILP32_OFF32_LDFLAGS: _bindgen_ty_3 = 1101;
pub const _CS_XBS5_ILP32_OFF32_LIBS: _bindgen_ty_3 = 1102;
pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS: _bindgen_ty_3 = 1103;
pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS: _bindgen_ty_3 = 1104;
pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1105;
pub const _CS_XBS5_ILP32_OFFBIG_LIBS: _bindgen_ty_3 = 1106;
pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1107;
pub const _CS_XBS5_LP64_OFF64_CFLAGS: _bindgen_ty_3 = 1108;
pub const _CS_XBS5_LP64_OFF64_LDFLAGS: _bindgen_ty_3 = 1109;
pub const _CS_XBS5_LP64_OFF64_LIBS: _bindgen_ty_3 = 1110;
pub const _CS_XBS5_LP64_OFF64_LINTFLAGS: _bindgen_ty_3 = 1111;
pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_3 = 1112;
pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1113;
pub const _CS_XBS5_LPBIG_OFFBIG_LIBS: _bindgen_ty_3 = 1114;
pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1115;
pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS: _bindgen_ty_3 = 1116;
pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS: _bindgen_ty_3 = 1117;
pub const _CS_POSIX_V6_ILP32_OFF32_LIBS: _bindgen_ty_3 = 1118;
pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS: _bindgen_ty_3 = 1119;
pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS: _bindgen_ty_3 = 1120;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1121;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS: _bindgen_ty_3 = 1122;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1123;
pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS: _bindgen_ty_3 = 1124;
pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS: _bindgen_ty_3 = 1125;
pub const _CS_POSIX_V6_LP64_OFF64_LIBS: _bindgen_ty_3 = 1126;
pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS: _bindgen_ty_3 = 1127;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_3 = 1128;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1129;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS: _bindgen_ty_3 = 1130;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1131;
pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS: _bindgen_ty_3 = 1132;
pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS: _bindgen_ty_3 = 1133;
pub const _CS_POSIX_V7_ILP32_OFF32_LIBS: _bindgen_ty_3 = 1134;
pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS: _bindgen_ty_3 = 1135;
pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS: _bindgen_ty_3 = 1136;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1137;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS: _bindgen_ty_3 = 1138;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1139;
pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS: _bindgen_ty_3 = 1140;
pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS: _bindgen_ty_3 = 1141;
pub const _CS_POSIX_V7_LP64_OFF64_LIBS: _bindgen_ty_3 = 1142;
pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS: _bindgen_ty_3 = 1143;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_3 = 1144;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1145;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS: _bindgen_ty_3 = 1146;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1147;
pub const _CS_V6_ENV: _bindgen_ty_3 = 1148;
pub const _CS_V7_ENV: _bindgen_ty_3 = 1149;
pub type _bindgen_ty_3 = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn pathconf(
        __path: *const ::core::ffi::c_char,
        __name: ::core::ffi::c_int,
    ) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn fpathconf(__fd: ::core::ffi::c_int, __name: ::core::ffi::c_int) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn sysconf(__name: ::core::ffi::c_int) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn confstr(
        __name: ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_char,
        __len: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn getpid() -> __pid_t;
}
unsafe extern "C" {
    pub fn getppid() -> __pid_t;
}
unsafe extern "C" {
    pub fn getpgrp() -> __pid_t;
}
unsafe extern "C" {
    pub fn __getpgid(__pid: __pid_t) -> __pid_t;
}
unsafe extern "C" {
    pub fn getpgid(__pid: __pid_t) -> __pid_t;
}
unsafe extern "C" {
    pub fn setpgid(__pid: __pid_t, __pgid: __pid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setpgrp() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setsid() -> __pid_t;
}
unsafe extern "C" {
    pub fn getsid(__pid: __pid_t) -> __pid_t;
}
unsafe extern "C" {
    pub fn getuid() -> __uid_t;
}
unsafe extern "C" {
    pub fn geteuid() -> __uid_t;
}
unsafe extern "C" {
    pub fn getgid() -> __gid_t;
}
unsafe extern "C" {
    pub fn getegid() -> __gid_t;
}
unsafe extern "C" {
    pub fn getgroups(__size: ::core::ffi::c_int, __list: *mut __gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setuid(__uid: __uid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setreuid(__ruid: __uid_t, __euid: __uid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn seteuid(__uid: __uid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setgid(__gid: __gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setregid(__rgid: __gid_t, __egid: __gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setegid(__gid: __gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fork() -> __pid_t;
}
unsafe extern "C" {
    pub fn vfork() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ttyname(__fd: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ttyname_r(
        __fd: ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_char,
        __buflen: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isatty(__fd: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ttyslot() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn link(
        __from: *const ::core::ffi::c_char,
        __to: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn linkat(
        __fromfd: ::core::ffi::c_int,
        __from: *const ::core::ffi::c_char,
        __tofd: ::core::ffi::c_int,
        __to: *const ::core::ffi::c_char,
        __flags: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn symlink(
        __from: *const ::core::ffi::c_char,
        __to: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn readlink(
        __path: *const ::core::ffi::c_char,
        __buf: *mut ::core::ffi::c_char,
        __len: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn symlinkat(
        __from: *const ::core::ffi::c_char,
        __tofd: ::core::ffi::c_int,
        __to: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn readlinkat(
        __fd: ::core::ffi::c_int,
        __path: *const ::core::ffi::c_char,
        __buf: *mut ::core::ffi::c_char,
        __len: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn unlink(__name: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn unlinkat(
        __fd: ::core::ffi::c_int,
        __name: *const ::core::ffi::c_char,
        __flag: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rmdir(__path: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn tcgetpgrp(__fd: ::core::ffi::c_int) -> __pid_t;
}
unsafe extern "C" {
    pub fn tcsetpgrp(__fd: ::core::ffi::c_int, __pgrp_id: __pid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getlogin() -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn getlogin_r(__name: *mut ::core::ffi::c_char, __name_len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setlogin(__name: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut optarg: *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub static mut optind: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut opterr: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut optopt: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getopt(
        ___argc: ::core::ffi::c_int,
        ___argv: *const *mut ::core::ffi::c_char,
        __shortopts: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn gethostname(__name: *mut ::core::ffi::c_char, __len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sethostname(__name: *const ::core::ffi::c_char, __len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sethostid(__id: ::core::ffi::c_long) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getdomainname(__name: *mut ::core::ffi::c_char, __len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setdomainname(__name: *const ::core::ffi::c_char, __len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vhangup() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn revoke(__file: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn profil(
        __sample_buffer: *mut ::core::ffi::c_ushort,
        __size: usize,
        __offset: usize,
        __scale: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn acct(__name: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getusershell() -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn endusershell();
}
unsafe extern "C" {
    pub fn setusershell();
}
unsafe extern "C" {
    pub fn daemon(
        __nochdir: ::core::ffi::c_int,
        __noclose: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn chroot(__path: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getpass(__prompt: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fsync(__fd: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn gethostid() -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn sync();
}
unsafe extern "C" {
    pub fn getpagesize() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getdtablesize() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn truncate(__file: *const ::core::ffi::c_char, __length: __off_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftruncate(__fd: ::core::ffi::c_int, __length: __off_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn brk(__addr: *mut ::core::ffi::c_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sbrk(__delta: isize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn syscall(__sysno: ::core::ffi::c_long, ...) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn lockf(
        __fd: ::core::ffi::c_int,
        __cmd: ::core::ffi::c_int,
        __len: __off_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fdatasync(__fildes: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn crypt(
        __key: *const ::core::ffi::c_char,
        __salt: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn getentropy(__buffer: *mut ::core::ffi::c_void, __length: usize) -> ::core::ffi::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::core::ffi::c_schar;
pub type int_fast16_t = ::core::ffi::c_long;
pub type int_fast32_t = ::core::ffi::c_long;
pub type int_fast64_t = ::core::ffi::c_long;
pub type uint_fast8_t = ::core::ffi::c_uchar;
pub type uint_fast16_t = ::core::ffi::c_ulong;
pub type uint_fast32_t = ::core::ffi::c_ulong;
pub type uint_fast64_t = ::core::ffi::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::core::ffi::c_int,
    pub rem: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::core::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::core::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::core::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::core::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::core::ffi::c_long,
    pub rem: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::core::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::core::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::core::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::core::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::core::ffi::c_longlong,
    pub rem: ::core::ffi::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::core::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::core::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::core::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::core::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::core::ffi::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::core::ffi::c_char,
        __endptr: *mut *mut ::core::ffi::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::core::ffi::c_char,
        __endptr: *mut *mut ::core::ffi::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::core::ffi::c_char,
        __endptr: *mut *mut ::core::ffi::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::core::ffi::c_char,
        __endptr: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::core::ffi::c_char,
        __endptr: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::core::ffi::c_char,
        __endptr: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::core::ffi::c_char,
        __endptr: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::core::ffi::c_char,
        __endptr: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::core::ffi::c_char,
        __endptr: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::core::ffi::c_long) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::core::ffi::c_char) -> ::core::ffi::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::core::ffi::c_ulong;
pub type ushort = ::core::ffi::c_ushort;
pub type uint = ::core::ffi::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::core::ffi::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::core::ffi::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::core::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::core::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::core::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::core::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::core::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::core::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::core::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::core::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::core::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::core::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::core::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::core::ffi::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::core::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::core::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::core::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::core::ffi::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::core::ffi::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::core::ffi::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::core::ffi::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::core::ffi::c_uint,
    pub __high: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::core::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::core::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::core::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::core::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::core::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::core::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::core::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::core::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"]
        [::core::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::core::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::core::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::core::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::core::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::core::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::core::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::core::ffi::c_int,
    pub __count: ::core::ffi::c_uint,
    pub __owner: ::core::ffi::c_int,
    pub __nusers: ::core::ffi::c_uint,
    pub __kind: ::core::ffi::c_int,
    pub __spins: ::core::ffi::c_short,
    pub __elision: ::core::ffi::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::core::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::core::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::core::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::core::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::core::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::core::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::core::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::core::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::core::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::core::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::core::ffi::c_uint,
    pub __writers: ::core::ffi::c_uint,
    pub __wrphase_futex: ::core::ffi::c_uint,
    pub __writers_futex: ::core::ffi::c_uint,
    pub __pad3: ::core::ffi::c_uint,
    pub __pad4: ::core::ffi::c_uint,
    pub __cur_writer: ::core::ffi::c_int,
    pub __shared: ::core::ffi::c_int,
    pub __rwelision: ::core::ffi::c_schar,
    pub __pad1: [::core::ffi::c_uchar; 7usize],
    pub __pad2: ::core::ffi::c_ulong,
    pub __flags: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"]
        [::core::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::core::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::core::ffi::c_uint; 2usize],
    pub __g_size: [::core::ffi::c_uint; 2usize],
    pub __g1_orig_size: ::core::ffi::c_uint,
    pub __wrefs: ::core::ffi::c_uint,
    pub __g_signals: [::core::ffi::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::core::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::core::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::core::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::core::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::core::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::core::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::core::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::core::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::core::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::core::ffi::c_uint;
pub type __thrd_t = ::core::ffi::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::core::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::core::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::core::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::core::ffi::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::core::ffi::c_char; 4usize],
    pub __align: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::core::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::core::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::core::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::core::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::core::ffi::c_char; 4usize],
    pub __align: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::core::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::core::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::core::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::core::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::core::ffi::c_uint;
pub type pthread_once_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::core::ffi::c_char; 56usize],
    pub __align: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::core::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::core::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::core::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::core::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::core::ffi::c_char; 40usize],
    pub __align: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::core::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::core::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::core::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::core::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::core::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::core::ffi::c_char; 48usize],
    pub __align: ::core::ffi::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::core::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::core::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::core::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::core::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::core::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::core::ffi::c_char; 56usize],
    pub __align: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::core::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::core::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::core::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::core::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::core::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::core::ffi::c_char; 8usize],
    pub __align: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::core::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::core::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::core::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::core::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::core::ffi::c_char; 32usize],
    pub __align: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::core::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::core::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::core::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::core::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::core::ffi::c_char; 4usize],
    pub __align: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::core::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::core::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::core::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::core::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
unsafe extern "C" {
    pub fn random() -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::core::ffi::c_uint,
        __statebuf: *mut ::core::ffi::c_char,
        __statelen: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn setstate(__statebuf: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::core::ffi::c_int,
    pub rand_deg: ::core::ffi::c_int,
    pub rand_sep: ::core::ffi::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::core::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::core::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::core::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::core::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::core::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::core::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::core::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::core::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::core::mem::offset_of!(random_data, end_ptr) - 40usize];
};
unsafe extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(__seed: ::core::ffi::c_uint, __buf: *mut random_data) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::core::ffi::c_uint,
        __statebuf: *mut ::core::ffi::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::core::ffi::c_char,
        __buf: *mut random_data,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::core::ffi::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn nrand48(__xsubi: *mut ::core::ffi::c_ushort) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn jrand48(__xsubi: *mut ::core::ffi::c_ushort) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::core::ffi::c_long);
}
unsafe extern "C" {
    pub fn seed48(__seed16v: *mut ::core::ffi::c_ushort) -> *mut ::core::ffi::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::core::ffi::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::core::ffi::c_ushort; 3usize],
    pub __old_x: [::core::ffi::c_ushort; 3usize],
    pub __c: ::core::ffi::c_ushort,
    pub __a: ::core::ffi::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::core::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::core::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::core::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::core::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::core::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__a"][::core::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::core::ffi::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::core::ffi::c_long,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::core::ffi::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::core::ffi::c_long,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::core::ffi::c_long,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::core::ffi::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::core::ffi::c_long,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn srand48_r(
        __seedval: ::core::ffi::c_long,
        __buffer: *mut drand48_data,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::core::ffi::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn lcong48_r(
        __param: *mut ::core::ffi::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn arc4random() -> __uint32_t;
}
unsafe extern "C" {
    pub fn arc4random_buf(__buf: *mut ::core::ffi::c_void, __size: usize);
}
unsafe extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
unsafe extern "C" {
    pub fn malloc(__size: ::core::ffi::c_ulong) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __nmemb: ::core::ffi::c_ulong,
        __size: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::core::ffi::c_void,
        __size: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn free(__ptr: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::core::ffi::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn alloca(__size: ::core::ffi::c_ulong) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::core::ffi::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::core::ffi::c_ulong,
        __size: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn atexit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        __func: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn on_exit(
        __func: ::core::option::Option<
            unsafe extern "C" fn(__status: ::core::ffi::c_int, __arg: *mut ::core::ffi::c_void),
        >,
        __arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn exit(__status: ::core::ffi::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(__status: ::core::ffi::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(__status: ::core::ffi::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(__name: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn putenv(__string: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::core::ffi::c_char,
        __value: *const ::core::ffi::c_char,
        __replace: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(__name: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn clearenv() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mktemp(__template: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(__template: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mkstemps(
        __template: *mut ::core::ffi::c_char,
        __suffixlen: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(__template: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn system(__command: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn realpath(
        __name: *const ::core::ffi::c_char,
        __resolved: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
pub type __compar_fn_t = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::core::ffi::c_void,
        __base: *const ::core::ffi::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::core::ffi::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
unsafe extern "C" {
    pub fn abs(__x: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn labs(__x: ::core::ffi::c_long) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn llabs(__x: ::core::ffi::c_longlong) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn div(__numer: ::core::ffi::c_int, __denom: ::core::ffi::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(__numer: ::core::ffi::c_long, __denom: ::core::ffi::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(__numer: ::core::ffi::c_longlong, __denom: ::core::ffi::c_longlong) -> lldiv_t;
}
unsafe extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::core::ffi::c_int,
        __decpt: *mut ::core::ffi::c_int,
        __sign: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::core::ffi::c_int,
        __decpt: *mut ::core::ffi::c_int,
        __sign: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::core::ffi::c_int,
        __decpt: *mut ::core::ffi::c_int,
        __sign: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::core::ffi::c_int,
        __decpt: *mut ::core::ffi::c_int,
        __sign: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::core::ffi::c_int,
        __decpt: *mut ::core::ffi::c_int,
        __sign: *mut ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_char,
        __len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::core::ffi::c_int,
        __decpt: *mut ::core::ffi::c_int,
        __sign: *mut ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_char,
        __len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::core::ffi::c_int,
        __decpt: *mut ::core::ffi::c_int,
        __sign: *mut ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_char,
        __len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::core::ffi::c_int,
        __decpt: *mut ::core::ffi::c_int,
        __sign: *mut ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_char,
        __len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::core::ffi::c_char, __n: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::core::ffi::c_char,
        __n: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn wctomb(__s: *mut ::core::ffi::c_char, __wchar: wchar_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::core::ffi::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(__s: *mut ::core::ffi::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn rpmatch(__response: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::core::ffi::c_char,
        __tokens: *const *mut ::core::ffi::c_char,
        __valuep: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        __dest: *mut ::core::ffi::c_void,
        __src: *const ::core::ffi::c_void,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        __dest: *mut ::core::ffi::c_void,
        __src: *const ::core::ffi::c_void,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memccpy(
        __dest: *mut ::core::ffi::c_void,
        __src: *const ::core::ffi::c_void,
        __c: ::core::ffi::c_int,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memset(
        __s: *mut ::core::ffi::c_void,
        __c: ::core::ffi::c_int,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        __s1: *const ::core::ffi::c_void,
        __s2: *const ::core::ffi::c_void,
        __n: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::core::ffi::c_void,
        __s2: *const ::core::ffi::c_void,
        __n: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        __s: *const ::core::ffi::c_void,
        __c: ::core::ffi::c_int,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn strcpy(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strncpy(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncmp(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strxfrm(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::core::ffi::c_ushort,
    pub __ctype_tolower: *const ::core::ffi::c_int,
    pub __ctype_toupper: *const ::core::ffi::c_int,
    pub __names: [*const ::core::ffi::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::core::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::core::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::core::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::core::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::core::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::core::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::core::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn strcoll_l(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
        __l: locale_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strdup(__s: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        __string: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        __s: *const ::core::ffi::c_char,
        __c: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        __s: *const ::core::ffi::c_char,
        __c: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strchrnul(
        __s: *const ::core::ffi::c_char,
        __c: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        __s: *const ::core::ffi::c_char,
        __reject: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strspn(
        __s: *const ::core::ffi::c_char,
        __accept: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strpbrk(
        __s: *const ::core::ffi::c_char,
        __accept: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strstr(
        __haystack: *const ::core::ffi::c_char,
        __needle: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        __s: *mut ::core::ffi::c_char,
        __delim: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn __strtok_r(
        __s: *mut ::core::ffi::c_char,
        __delim: *const ::core::ffi::c_char,
        __save_ptr: *mut *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strtok_r(
        __s: *mut ::core::ffi::c_char,
        __delim: *const ::core::ffi::c_char,
        __save_ptr: *mut *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcasestr(
        __haystack: *const ::core::ffi::c_char,
        __needle: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn memmem(
        __haystack: *const ::core::ffi::c_void,
        __haystacklen: usize,
        __needle: *const ::core::ffi::c_void,
        __needlelen: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn __mempcpy(
        __dest: *mut ::core::ffi::c_void,
        __src: *const ::core::ffi::c_void,
        __n: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mempcpy(
        __dest: *mut ::core::ffi::c_void,
        __src: *const ::core::ffi::c_void,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn strlen(__s: *const ::core::ffi::c_char) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strnlen(__string: *const ::core::ffi::c_char, __maxlen: usize) -> usize;
}
unsafe extern "C" {
    pub fn strerror(__errnum: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::core::ffi::c_int,
        __buf: *mut ::core::ffi::c_char,
        __buflen: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(__errnum: ::core::ffi::c_int, __l: locale_t) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn bcmp(
        __s1: *const ::core::ffi::c_void,
        __s2: *const ::core::ffi::c_void,
        __n: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        __src: *const ::core::ffi::c_void,
        __dest: *mut ::core::ffi::c_void,
        __n: ::core::ffi::c_ulong,
    );
}
unsafe extern "C" {
    pub fn bzero(__s: *mut ::core::ffi::c_void, __n: ::core::ffi::c_ulong);
}
unsafe extern "C" {
    pub fn index(
        __s: *const ::core::ffi::c_char,
        __c: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        __s: *const ::core::ffi::c_char,
        __c: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ffs(__i: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ffsl(__l: ::core::ffi::c_long) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ffsll(__ll: ::core::ffi::c_longlong) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
        __loc: locale_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn explicit_bzero(__s: *mut ::core::ffi::c_void, __n: usize);
}
unsafe extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::core::ffi::c_char,
        __delim: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__sig: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn stpcpy(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
        __n: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strlcpy(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
        __n: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strlcat(
        __dest: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
        __n: usize,
    ) -> usize;
}
pub const _ISupper: _bindgen_ty_4 = 256;
pub const _ISlower: _bindgen_ty_4 = 512;
pub const _ISalpha: _bindgen_ty_4 = 1024;
pub const _ISdigit: _bindgen_ty_4 = 2048;
pub const _ISxdigit: _bindgen_ty_4 = 4096;
pub const _ISspace: _bindgen_ty_4 = 8192;
pub const _ISprint: _bindgen_ty_4 = 16384;
pub const _ISgraph: _bindgen_ty_4 = 32768;
pub const _ISblank: _bindgen_ty_4 = 1;
pub const _IScntrl: _bindgen_ty_4 = 2;
pub const _ISpunct: _bindgen_ty_4 = 4;
pub const _ISalnum: _bindgen_ty_4 = 8;
pub type _bindgen_ty_4 = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn __ctype_b_loc() -> *mut *const ::core::ffi::c_ushort;
}
unsafe extern "C" {
    pub fn __ctype_tolower_loc() -> *mut *const __int32_t;
}
unsafe extern "C" {
    pub fn __ctype_toupper_loc() -> *mut *const __int32_t;
}
unsafe extern "C" {
    pub fn isalnum(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isalpha(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iscntrl(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isdigit(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn islower(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isgraph(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isprint(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ispunct(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isspace(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isupper(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isxdigit(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn tolower(__c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn toupper(__c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isblank(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isascii(__c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn toascii(__c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _toupper(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _tolower(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isalnum_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isalpha_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iscntrl_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isdigit_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn islower_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isgraph_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isprint_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ispunct_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isspace_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isupper_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isxdigit_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isblank_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __tolower_l(__c: ::core::ffi::c_int, __l: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn tolower_l(__c: ::core::ffi::c_int, __l: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __toupper_l(__c: ::core::ffi::c_int, __l: locale_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn toupper_l(__c: ::core::ffi::c_int, __l: locale_t) -> ::core::ffi::c_int;
}
pub type BOOLEAN = ::core::ffi::c_uchar;
pub type UINT8 = ::core::ffi::c_uchar;
pub type UINT16 = ::core::ffi::c_ushort;
pub type INT16 = ::core::ffi::c_short;
pub type UINT64 = ::core::ffi::c_ulong;
pub type INT64 = ::core::ffi::c_long;
pub type UINT32 = ::core::ffi::c_uint;
pub type INT32 = ::core::ffi::c_int;
pub type ACPI_NATIVE_INT = INT64;
pub type ACPI_SIZE = UINT64;
pub type ACPI_IO_ADDRESS = UINT64;
pub type ACPI_PHYSICAL_ADDRESS = UINT64;
pub type ACPI_STATUS = UINT32;
pub type ACPI_NAME = UINT32;
pub type ACPI_STRING = *mut ::core::ffi::c_char;
pub type ACPI_HANDLE = *mut ::core::ffi::c_void;
pub type ACPI_OWNER_ID = UINT16;
pub type ACPI_INTEGER = UINT64;
pub type ACPI_OBJECT_TYPE = UINT32;
pub type ACPI_EVENT_TYPE = UINT32;
pub type ACPI_EVENT_STATUS = UINT32;
pub type ACPI_ADR_SPACE_TYPE = UINT8;
pub type ACPI_SLEEP_FUNCTION =
    ::core::option::Option<unsafe extern "C" fn(SleepState: UINT8) -> ACPI_STATUS>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_sleep_functions {
    pub LegacyFunction: ACPI_SLEEP_FUNCTION,
    pub ExtendedFunction: ACPI_SLEEP_FUNCTION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_sleep_functions"][::core::mem::size_of::<acpi_sleep_functions>() - 16usize];
    ["Alignment of acpi_sleep_functions"][::core::mem::align_of::<acpi_sleep_functions>() - 8usize];
    ["Offset of field: acpi_sleep_functions::LegacyFunction"]
        [::core::mem::offset_of!(acpi_sleep_functions, LegacyFunction) - 0usize];
    ["Offset of field: acpi_sleep_functions::ExtendedFunction"]
        [::core::mem::offset_of!(acpi_sleep_functions, ExtendedFunction) - 8usize];
};
pub type ACPI_SLEEP_FUNCTIONS = acpi_sleep_functions;
#[repr(C)]
#[derive(Copy, Clone)]
pub union acpi_object {
    pub Type: ACPI_OBJECT_TYPE,
    pub Integer: acpi_object__bindgen_ty_1,
    pub String: acpi_object__bindgen_ty_2,
    pub Buffer: acpi_object__bindgen_ty_3,
    pub Package: acpi_object__bindgen_ty_4,
    pub Reference: acpi_object__bindgen_ty_5,
    pub Processor: acpi_object__bindgen_ty_6,
    pub PowerResource: acpi_object__bindgen_ty_7,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_object__bindgen_ty_1 {
    pub Type: ACPI_OBJECT_TYPE,
    pub Value: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_object__bindgen_ty_1"]
        [::core::mem::size_of::<acpi_object__bindgen_ty_1>() - 16usize];
    ["Alignment of acpi_object__bindgen_ty_1"]
        [::core::mem::align_of::<acpi_object__bindgen_ty_1>() - 8usize];
    ["Offset of field: acpi_object__bindgen_ty_1::Type"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_1, Type) - 0usize];
    ["Offset of field: acpi_object__bindgen_ty_1::Value"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_1, Value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_object__bindgen_ty_2 {
    pub Type: ACPI_OBJECT_TYPE,
    pub Length: UINT32,
    pub Pointer: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_object__bindgen_ty_2"]
        [::core::mem::size_of::<acpi_object__bindgen_ty_2>() - 16usize];
    ["Alignment of acpi_object__bindgen_ty_2"]
        [::core::mem::align_of::<acpi_object__bindgen_ty_2>() - 8usize];
    ["Offset of field: acpi_object__bindgen_ty_2::Type"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_2, Type) - 0usize];
    ["Offset of field: acpi_object__bindgen_ty_2::Length"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_2, Length) - 4usize];
    ["Offset of field: acpi_object__bindgen_ty_2::Pointer"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_2, Pointer) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_object__bindgen_ty_3 {
    pub Type: ACPI_OBJECT_TYPE,
    pub Length: UINT32,
    pub Pointer: *mut UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_object__bindgen_ty_3"]
        [::core::mem::size_of::<acpi_object__bindgen_ty_3>() - 16usize];
    ["Alignment of acpi_object__bindgen_ty_3"]
        [::core::mem::align_of::<acpi_object__bindgen_ty_3>() - 8usize];
    ["Offset of field: acpi_object__bindgen_ty_3::Type"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_3, Type) - 0usize];
    ["Offset of field: acpi_object__bindgen_ty_3::Length"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_3, Length) - 4usize];
    ["Offset of field: acpi_object__bindgen_ty_3::Pointer"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_3, Pointer) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_object__bindgen_ty_4 {
    pub Type: ACPI_OBJECT_TYPE,
    pub Count: UINT32,
    pub Elements: *mut acpi_object,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_object__bindgen_ty_4"]
        [::core::mem::size_of::<acpi_object__bindgen_ty_4>() - 16usize];
    ["Alignment of acpi_object__bindgen_ty_4"]
        [::core::mem::align_of::<acpi_object__bindgen_ty_4>() - 8usize];
    ["Offset of field: acpi_object__bindgen_ty_4::Type"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_4, Type) - 0usize];
    ["Offset of field: acpi_object__bindgen_ty_4::Count"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_4, Count) - 4usize];
    ["Offset of field: acpi_object__bindgen_ty_4::Elements"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_4, Elements) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_object__bindgen_ty_5 {
    pub Type: ACPI_OBJECT_TYPE,
    pub ActualType: ACPI_OBJECT_TYPE,
    pub Handle: ACPI_HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_object__bindgen_ty_5"]
        [::core::mem::size_of::<acpi_object__bindgen_ty_5>() - 16usize];
    ["Alignment of acpi_object__bindgen_ty_5"]
        [::core::mem::align_of::<acpi_object__bindgen_ty_5>() - 8usize];
    ["Offset of field: acpi_object__bindgen_ty_5::Type"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_5, Type) - 0usize];
    ["Offset of field: acpi_object__bindgen_ty_5::ActualType"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_5, ActualType) - 4usize];
    ["Offset of field: acpi_object__bindgen_ty_5::Handle"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_5, Handle) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_object__bindgen_ty_6 {
    pub Type: ACPI_OBJECT_TYPE,
    pub ProcId: UINT32,
    pub PblkAddress: ACPI_IO_ADDRESS,
    pub PblkLength: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_object__bindgen_ty_6"]
        [::core::mem::size_of::<acpi_object__bindgen_ty_6>() - 24usize];
    ["Alignment of acpi_object__bindgen_ty_6"]
        [::core::mem::align_of::<acpi_object__bindgen_ty_6>() - 8usize];
    ["Offset of field: acpi_object__bindgen_ty_6::Type"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_6, Type) - 0usize];
    ["Offset of field: acpi_object__bindgen_ty_6::ProcId"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_6, ProcId) - 4usize];
    ["Offset of field: acpi_object__bindgen_ty_6::PblkAddress"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_6, PblkAddress) - 8usize];
    ["Offset of field: acpi_object__bindgen_ty_6::PblkLength"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_6, PblkLength) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_object__bindgen_ty_7 {
    pub Type: ACPI_OBJECT_TYPE,
    pub SystemLevel: UINT32,
    pub ResourceOrder: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_object__bindgen_ty_7"]
        [::core::mem::size_of::<acpi_object__bindgen_ty_7>() - 12usize];
    ["Alignment of acpi_object__bindgen_ty_7"]
        [::core::mem::align_of::<acpi_object__bindgen_ty_7>() - 4usize];
    ["Offset of field: acpi_object__bindgen_ty_7::Type"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_7, Type) - 0usize];
    ["Offset of field: acpi_object__bindgen_ty_7::SystemLevel"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_7, SystemLevel) - 4usize];
    ["Offset of field: acpi_object__bindgen_ty_7::ResourceOrder"]
        [::core::mem::offset_of!(acpi_object__bindgen_ty_7, ResourceOrder) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_object"][::core::mem::size_of::<acpi_object>() - 24usize];
    ["Alignment of acpi_object"][::core::mem::align_of::<acpi_object>() - 8usize];
    ["Offset of field: acpi_object::Type"][::core::mem::offset_of!(acpi_object, Type) - 0usize];
    ["Offset of field: acpi_object::Integer"]
        [::core::mem::offset_of!(acpi_object, Integer) - 0usize];
    ["Offset of field: acpi_object::String"][::core::mem::offset_of!(acpi_object, String) - 0usize];
    ["Offset of field: acpi_object::Buffer"][::core::mem::offset_of!(acpi_object, Buffer) - 0usize];
    ["Offset of field: acpi_object::Package"]
        [::core::mem::offset_of!(acpi_object, Package) - 0usize];
    ["Offset of field: acpi_object::Reference"]
        [::core::mem::offset_of!(acpi_object, Reference) - 0usize];
    ["Offset of field: acpi_object::Processor"]
        [::core::mem::offset_of!(acpi_object, Processor) - 0usize];
    ["Offset of field: acpi_object::PowerResource"]
        [::core::mem::offset_of!(acpi_object, PowerResource) - 0usize];
};
pub type ACPI_OBJECT = acpi_object;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_object_list {
    pub Count: UINT32,
    pub Pointer: *mut ACPI_OBJECT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_object_list"][::core::mem::size_of::<acpi_object_list>() - 16usize];
    ["Alignment of acpi_object_list"][::core::mem::align_of::<acpi_object_list>() - 8usize];
    ["Offset of field: acpi_object_list::Count"]
        [::core::mem::offset_of!(acpi_object_list, Count) - 0usize];
    ["Offset of field: acpi_object_list::Pointer"]
        [::core::mem::offset_of!(acpi_object_list, Pointer) - 8usize];
};
pub type ACPI_OBJECT_LIST = acpi_object_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_buffer {
    pub Length: ACPI_SIZE,
    pub Pointer: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_buffer"][::core::mem::size_of::<acpi_buffer>() - 16usize];
    ["Alignment of acpi_buffer"][::core::mem::align_of::<acpi_buffer>() - 8usize];
    ["Offset of field: acpi_buffer::Length"][::core::mem::offset_of!(acpi_buffer, Length) - 0usize];
    ["Offset of field: acpi_buffer::Pointer"]
        [::core::mem::offset_of!(acpi_buffer, Pointer) - 8usize];
};
pub type ACPI_BUFFER = acpi_buffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_predefined_names {
    pub Name: *const ::core::ffi::c_char,
    pub Type: UINT8,
    pub Val: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_predefined_names"][::core::mem::size_of::<acpi_predefined_names>() - 24usize];
    ["Alignment of acpi_predefined_names"]
        [::core::mem::align_of::<acpi_predefined_names>() - 8usize];
    ["Offset of field: acpi_predefined_names::Name"]
        [::core::mem::offset_of!(acpi_predefined_names, Name) - 0usize];
    ["Offset of field: acpi_predefined_names::Type"]
        [::core::mem::offset_of!(acpi_predefined_names, Type) - 8usize];
    ["Offset of field: acpi_predefined_names::Val"]
        [::core::mem::offset_of!(acpi_predefined_names, Val) - 16usize];
};
pub type ACPI_PREDEFINED_NAMES = acpi_predefined_names;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_system_info {
    pub AcpiCaVersion: UINT32,
    pub Flags: UINT32,
    pub TimerResolution: UINT32,
    pub Reserved1: UINT32,
    pub Reserved2: UINT32,
    pub DebugLevel: UINT32,
    pub DebugLayer: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_system_info"][::core::mem::size_of::<acpi_system_info>() - 28usize];
    ["Alignment of acpi_system_info"][::core::mem::align_of::<acpi_system_info>() - 4usize];
    ["Offset of field: acpi_system_info::AcpiCaVersion"]
        [::core::mem::offset_of!(acpi_system_info, AcpiCaVersion) - 0usize];
    ["Offset of field: acpi_system_info::Flags"]
        [::core::mem::offset_of!(acpi_system_info, Flags) - 4usize];
    ["Offset of field: acpi_system_info::TimerResolution"]
        [::core::mem::offset_of!(acpi_system_info, TimerResolution) - 8usize];
    ["Offset of field: acpi_system_info::Reserved1"]
        [::core::mem::offset_of!(acpi_system_info, Reserved1) - 12usize];
    ["Offset of field: acpi_system_info::Reserved2"]
        [::core::mem::offset_of!(acpi_system_info, Reserved2) - 16usize];
    ["Offset of field: acpi_system_info::DebugLevel"]
        [::core::mem::offset_of!(acpi_system_info, DebugLevel) - 20usize];
    ["Offset of field: acpi_system_info::DebugLayer"]
        [::core::mem::offset_of!(acpi_system_info, DebugLayer) - 24usize];
};
pub type ACPI_SYSTEM_INFO = acpi_system_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_statistics {
    pub SciCount: UINT32,
    pub GpeCount: UINT32,
    pub FixedEventCount: [UINT32; 5usize],
    pub MethodCount: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_statistics"][::core::mem::size_of::<acpi_statistics>() - 32usize];
    ["Alignment of acpi_statistics"][::core::mem::align_of::<acpi_statistics>() - 4usize];
    ["Offset of field: acpi_statistics::SciCount"]
        [::core::mem::offset_of!(acpi_statistics, SciCount) - 0usize];
    ["Offset of field: acpi_statistics::GpeCount"]
        [::core::mem::offset_of!(acpi_statistics, GpeCount) - 4usize];
    ["Offset of field: acpi_statistics::FixedEventCount"]
        [::core::mem::offset_of!(acpi_statistics, FixedEventCount) - 8usize];
    ["Offset of field: acpi_statistics::MethodCount"]
        [::core::mem::offset_of!(acpi_statistics, MethodCount) - 28usize];
};
pub type ACPI_STATISTICS = acpi_statistics;
pub type ACPI_OSD_HANDLER =
    ::core::option::Option<unsafe extern "C" fn(Context: *mut ::core::ffi::c_void) -> UINT32>;
pub type ACPI_OSD_EXEC_CALLBACK =
    ::core::option::Option<unsafe extern "C" fn(Context: *mut ::core::ffi::c_void)>;
pub type ACPI_SCI_HANDLER =
    ::core::option::Option<unsafe extern "C" fn(Context: *mut ::core::ffi::c_void) -> UINT32>;
pub type ACPI_GBL_EVENT_HANDLER = ::core::option::Option<
    unsafe extern "C" fn(
        EventType: UINT32,
        Device: ACPI_HANDLE,
        EventNumber: UINT32,
        Context: *mut ::core::ffi::c_void,
    ),
>;
pub type ACPI_EVENT_HANDLER =
    ::core::option::Option<unsafe extern "C" fn(Context: *mut ::core::ffi::c_void) -> UINT32>;
pub type ACPI_GPE_HANDLER = ::core::option::Option<
    unsafe extern "C" fn(
        GpeDevice: ACPI_HANDLE,
        GpeNumber: UINT32,
        Context: *mut ::core::ffi::c_void,
    ) -> UINT32,
>;
pub type ACPI_NOTIFY_HANDLER = ::core::option::Option<
    unsafe extern "C" fn(Device: ACPI_HANDLE, Value: UINT32, Context: *mut ::core::ffi::c_void),
>;
pub type ACPI_OBJECT_HANDLER = ::core::option::Option<
    unsafe extern "C" fn(Object: ACPI_HANDLE, Data: *mut ::core::ffi::c_void),
>;
pub type ACPI_INIT_HANDLER = ::core::option::Option<
    unsafe extern "C" fn(Object: ACPI_HANDLE, Function: UINT32) -> ACPI_STATUS,
>;
pub type ACPI_EXCEPTION_HANDLER = ::core::option::Option<
    unsafe extern "C" fn(
        AmlStatus: ACPI_STATUS,
        Name: ACPI_NAME,
        Opcode: UINT16,
        AmlOffset: UINT32,
        Context: *mut ::core::ffi::c_void,
    ) -> ACPI_STATUS,
>;
pub type ACPI_TABLE_HANDLER = ::core::option::Option<
    unsafe extern "C" fn(
        Event: UINT32,
        Table: *mut ::core::ffi::c_void,
        Context: *mut ::core::ffi::c_void,
    ) -> ACPI_STATUS,
>;
pub type ACPI_ADR_SPACE_HANDLER = ::core::option::Option<
    unsafe extern "C" fn(
        Function: UINT32,
        Address: ACPI_PHYSICAL_ADDRESS,
        BitWidth: UINT32,
        Value: *mut UINT64,
        HandlerContext: *mut ::core::ffi::c_void,
        RegionContext: *mut ::core::ffi::c_void,
    ) -> ACPI_STATUS,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_connection_info {
    pub Connection: *mut UINT8,
    pub Length: UINT16,
    pub AccessLength: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_connection_info"][::core::mem::size_of::<acpi_connection_info>() - 16usize];
    ["Alignment of acpi_connection_info"][::core::mem::align_of::<acpi_connection_info>() - 8usize];
    ["Offset of field: acpi_connection_info::Connection"]
        [::core::mem::offset_of!(acpi_connection_info, Connection) - 0usize];
    ["Offset of field: acpi_connection_info::Length"]
        [::core::mem::offset_of!(acpi_connection_info, Length) - 8usize];
    ["Offset of field: acpi_connection_info::AccessLength"]
        [::core::mem::offset_of!(acpi_connection_info, AccessLength) - 10usize];
};
pub type ACPI_CONNECTION_INFO = acpi_connection_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_pcc_info {
    pub SubspaceId: UINT8,
    pub Length: UINT16,
    pub InternalBuffer: *mut UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_pcc_info"][::core::mem::size_of::<acpi_pcc_info>() - 16usize];
    ["Alignment of acpi_pcc_info"][::core::mem::align_of::<acpi_pcc_info>() - 8usize];
    ["Offset of field: acpi_pcc_info::SubspaceId"]
        [::core::mem::offset_of!(acpi_pcc_info, SubspaceId) - 0usize];
    ["Offset of field: acpi_pcc_info::Length"]
        [::core::mem::offset_of!(acpi_pcc_info, Length) - 2usize];
    ["Offset of field: acpi_pcc_info::InternalBuffer"]
        [::core::mem::offset_of!(acpi_pcc_info, InternalBuffer) - 8usize];
};
pub type ACPI_PCC_INFO = acpi_pcc_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_ffh_info {
    pub Offset: UINT64,
    pub Length: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_ffh_info"][::core::mem::size_of::<acpi_ffh_info>() - 16usize];
    ["Alignment of acpi_ffh_info"][::core::mem::align_of::<acpi_ffh_info>() - 8usize];
    ["Offset of field: acpi_ffh_info::Offset"]
        [::core::mem::offset_of!(acpi_ffh_info, Offset) - 0usize];
    ["Offset of field: acpi_ffh_info::Length"]
        [::core::mem::offset_of!(acpi_ffh_info, Length) - 8usize];
};
pub type ACPI_FFH_INFO = acpi_ffh_info;
pub type ACPI_ADR_SPACE_SETUP = ::core::option::Option<
    unsafe extern "C" fn(
        RegionHandle: ACPI_HANDLE,
        Function: UINT32,
        HandlerContext: *mut ::core::ffi::c_void,
        RegionContext: *mut *mut ::core::ffi::c_void,
    ) -> ACPI_STATUS,
>;
pub type ACPI_WALK_CALLBACK = ::core::option::Option<
    unsafe extern "C" fn(
        Object: ACPI_HANDLE,
        NestingLevel: UINT32,
        Context: *mut ::core::ffi::c_void,
        ReturnValue: *mut *mut ::core::ffi::c_void,
    ) -> ACPI_STATUS,
>;
pub type ACPI_INTERFACE_HANDLER = ::core::option::Option<
    unsafe extern "C" fn(InterfaceName: ACPI_STRING, Supported: UINT32) -> UINT32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_pnp_device_id {
    pub Length: UINT32,
    pub String: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_pnp_device_id"][::core::mem::size_of::<acpi_pnp_device_id>() - 16usize];
    ["Alignment of acpi_pnp_device_id"][::core::mem::align_of::<acpi_pnp_device_id>() - 8usize];
    ["Offset of field: acpi_pnp_device_id::Length"]
        [::core::mem::offset_of!(acpi_pnp_device_id, Length) - 0usize];
    ["Offset of field: acpi_pnp_device_id::String"]
        [::core::mem::offset_of!(acpi_pnp_device_id, String) - 8usize];
};
pub type ACPI_PNP_DEVICE_ID = acpi_pnp_device_id;
#[repr(C)]
#[derive(Debug)]
pub struct acpi_pnp_device_id_list {
    pub Count: UINT32,
    pub ListSize: UINT32,
    pub Ids: __IncompleteArrayField<ACPI_PNP_DEVICE_ID>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_pnp_device_id_list"][::core::mem::size_of::<acpi_pnp_device_id_list>() - 8usize];
    ["Alignment of acpi_pnp_device_id_list"]
        [::core::mem::align_of::<acpi_pnp_device_id_list>() - 8usize];
    ["Offset of field: acpi_pnp_device_id_list::Count"]
        [::core::mem::offset_of!(acpi_pnp_device_id_list, Count) - 0usize];
    ["Offset of field: acpi_pnp_device_id_list::ListSize"]
        [::core::mem::offset_of!(acpi_pnp_device_id_list, ListSize) - 4usize];
    ["Offset of field: acpi_pnp_device_id_list::Ids"]
        [::core::mem::offset_of!(acpi_pnp_device_id_list, Ids) - 8usize];
};
pub type ACPI_PNP_DEVICE_ID_LIST = acpi_pnp_device_id_list;
#[repr(C)]
#[derive(Debug)]
pub struct acpi_device_info {
    pub InfoSize: UINT32,
    pub Name: UINT32,
    pub Type: ACPI_OBJECT_TYPE,
    pub ParamCount: UINT8,
    pub Valid: UINT16,
    pub Flags: UINT8,
    pub HighestDstates: [UINT8; 4usize],
    pub LowestDstates: [UINT8; 5usize],
    pub Address: UINT64,
    pub HardwareId: ACPI_PNP_DEVICE_ID,
    pub UniqueId: ACPI_PNP_DEVICE_ID,
    pub ClassCode: ACPI_PNP_DEVICE_ID,
    pub CompatibleIdList: ACPI_PNP_DEVICE_ID_LIST,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_device_info"][::core::mem::size_of::<acpi_device_info>() - 96usize];
    ["Alignment of acpi_device_info"][::core::mem::align_of::<acpi_device_info>() - 8usize];
    ["Offset of field: acpi_device_info::InfoSize"]
        [::core::mem::offset_of!(acpi_device_info, InfoSize) - 0usize];
    ["Offset of field: acpi_device_info::Name"]
        [::core::mem::offset_of!(acpi_device_info, Name) - 4usize];
    ["Offset of field: acpi_device_info::Type"]
        [::core::mem::offset_of!(acpi_device_info, Type) - 8usize];
    ["Offset of field: acpi_device_info::ParamCount"]
        [::core::mem::offset_of!(acpi_device_info, ParamCount) - 12usize];
    ["Offset of field: acpi_device_info::Valid"]
        [::core::mem::offset_of!(acpi_device_info, Valid) - 14usize];
    ["Offset of field: acpi_device_info::Flags"]
        [::core::mem::offset_of!(acpi_device_info, Flags) - 16usize];
    ["Offset of field: acpi_device_info::HighestDstates"]
        [::core::mem::offset_of!(acpi_device_info, HighestDstates) - 17usize];
    ["Offset of field: acpi_device_info::LowestDstates"]
        [::core::mem::offset_of!(acpi_device_info, LowestDstates) - 21usize];
    ["Offset of field: acpi_device_info::Address"]
        [::core::mem::offset_of!(acpi_device_info, Address) - 32usize];
    ["Offset of field: acpi_device_info::HardwareId"]
        [::core::mem::offset_of!(acpi_device_info, HardwareId) - 40usize];
    ["Offset of field: acpi_device_info::UniqueId"]
        [::core::mem::offset_of!(acpi_device_info, UniqueId) - 56usize];
    ["Offset of field: acpi_device_info::ClassCode"]
        [::core::mem::offset_of!(acpi_device_info, ClassCode) - 72usize];
    ["Offset of field: acpi_device_info::CompatibleIdList"]
        [::core::mem::offset_of!(acpi_device_info, CompatibleIdList) - 88usize];
};
pub type ACPI_DEVICE_INFO = acpi_device_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_pci_id {
    pub Segment: UINT16,
    pub Bus: UINT16,
    pub Device: UINT16,
    pub Function: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_pci_id"][::core::mem::size_of::<acpi_pci_id>() - 8usize];
    ["Alignment of acpi_pci_id"][::core::mem::align_of::<acpi_pci_id>() - 2usize];
    ["Offset of field: acpi_pci_id::Segment"]
        [::core::mem::offset_of!(acpi_pci_id, Segment) - 0usize];
    ["Offset of field: acpi_pci_id::Bus"][::core::mem::offset_of!(acpi_pci_id, Bus) - 2usize];
    ["Offset of field: acpi_pci_id::Device"][::core::mem::offset_of!(acpi_pci_id, Device) - 4usize];
    ["Offset of field: acpi_pci_id::Function"]
        [::core::mem::offset_of!(acpi_pci_id, Function) - 6usize];
};
pub type ACPI_PCI_ID = acpi_pci_id;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_mem_mapping {
    pub PhysicalAddress: ACPI_PHYSICAL_ADDRESS,
    pub LogicalAddress: *mut UINT8,
    pub Length: ACPI_SIZE,
    pub NextMm: *mut acpi_mem_mapping,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_mem_mapping"][::core::mem::size_of::<acpi_mem_mapping>() - 32usize];
    ["Alignment of acpi_mem_mapping"][::core::mem::align_of::<acpi_mem_mapping>() - 8usize];
    ["Offset of field: acpi_mem_mapping::PhysicalAddress"]
        [::core::mem::offset_of!(acpi_mem_mapping, PhysicalAddress) - 0usize];
    ["Offset of field: acpi_mem_mapping::LogicalAddress"]
        [::core::mem::offset_of!(acpi_mem_mapping, LogicalAddress) - 8usize];
    ["Offset of field: acpi_mem_mapping::Length"]
        [::core::mem::offset_of!(acpi_mem_mapping, Length) - 16usize];
    ["Offset of field: acpi_mem_mapping::NextMm"]
        [::core::mem::offset_of!(acpi_mem_mapping, NextMm) - 24usize];
};
pub type ACPI_MEM_MAPPING = acpi_mem_mapping;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_mem_space_context {
    pub Length: UINT32,
    pub Address: ACPI_PHYSICAL_ADDRESS,
    pub CurMm: *mut ACPI_MEM_MAPPING,
    pub FirstMm: *mut ACPI_MEM_MAPPING,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_mem_space_context"][::core::mem::size_of::<acpi_mem_space_context>() - 32usize];
    ["Alignment of acpi_mem_space_context"]
        [::core::mem::align_of::<acpi_mem_space_context>() - 8usize];
    ["Offset of field: acpi_mem_space_context::Length"]
        [::core::mem::offset_of!(acpi_mem_space_context, Length) - 0usize];
    ["Offset of field: acpi_mem_space_context::Address"]
        [::core::mem::offset_of!(acpi_mem_space_context, Address) - 8usize];
    ["Offset of field: acpi_mem_space_context::CurMm"]
        [::core::mem::offset_of!(acpi_mem_space_context, CurMm) - 16usize];
    ["Offset of field: acpi_mem_space_context::FirstMm"]
        [::core::mem::offset_of!(acpi_mem_space_context, FirstMm) - 24usize];
};
pub type ACPI_MEM_SPACE_CONTEXT = acpi_mem_space_context;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_data_table_mapping {
    pub Pointer: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_data_table_mapping"][::core::mem::size_of::<acpi_data_table_mapping>() - 8usize];
    ["Alignment of acpi_data_table_mapping"]
        [::core::mem::align_of::<acpi_data_table_mapping>() - 8usize];
    ["Offset of field: acpi_data_table_mapping::Pointer"]
        [::core::mem::offset_of!(acpi_data_table_mapping, Pointer) - 0usize];
};
pub type ACPI_DATA_TABLE_MAPPING = acpi_data_table_mapping;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_memory_list {
    pub ListName: *const ::core::ffi::c_char,
    pub ListHead: *mut ::core::ffi::c_void,
    pub ObjectSize: UINT16,
    pub MaxDepth: UINT16,
    pub CurrentDepth: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_memory_list"][::core::mem::size_of::<acpi_memory_list>() - 24usize];
    ["Alignment of acpi_memory_list"][::core::mem::align_of::<acpi_memory_list>() - 8usize];
    ["Offset of field: acpi_memory_list::ListName"]
        [::core::mem::offset_of!(acpi_memory_list, ListName) - 0usize];
    ["Offset of field: acpi_memory_list::ListHead"]
        [::core::mem::offset_of!(acpi_memory_list, ListHead) - 8usize];
    ["Offset of field: acpi_memory_list::ObjectSize"]
        [::core::mem::offset_of!(acpi_memory_list, ObjectSize) - 16usize];
    ["Offset of field: acpi_memory_list::MaxDepth"]
        [::core::mem::offset_of!(acpi_memory_list, MaxDepth) - 18usize];
    ["Offset of field: acpi_memory_list::CurrentDepth"]
        [::core::mem::offset_of!(acpi_memory_list, CurrentDepth) - 20usize];
};
pub type ACPI_MEMORY_LIST = acpi_memory_list;
pub const ACPI_TRACE_EVENT_TYPE_ACPI_TRACE_AML_METHOD: ACPI_TRACE_EVENT_TYPE = 0;
pub const ACPI_TRACE_EVENT_TYPE_ACPI_TRACE_AML_OPCODE: ACPI_TRACE_EVENT_TYPE = 1;
pub const ACPI_TRACE_EVENT_TYPE_ACPI_TRACE_AML_REGION: ACPI_TRACE_EVENT_TYPE = 2;
pub type ACPI_TRACE_EVENT_TYPE = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_exception_info {
    pub Name: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_exception_info"][::core::mem::size_of::<acpi_exception_info>() - 8usize];
    ["Alignment of acpi_exception_info"][::core::mem::align_of::<acpi_exception_info>() - 8usize];
    ["Offset of field: acpi_exception_info::Name"]
        [::core::mem::offset_of!(acpi_exception_info, Name) - 0usize];
};
pub type ACPI_EXCEPTION_INFO = acpi_exception_info;
#[doc = " Master ACPI Table Header. This common header is used by all ACPI tables\n except the RSDP and FACS.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_header {
    pub Signature: [::core::ffi::c_char; 4usize],
    pub Length: UINT32,
    pub Revision: UINT8,
    pub Checksum: UINT8,
    pub OemId: [::core::ffi::c_char; 6usize],
    pub OemTableId: [::core::ffi::c_char; 8usize],
    pub OemRevision: UINT32,
    pub AslCompilerId: [::core::ffi::c_char; 4usize],
    pub AslCompilerRevision: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_header"][::core::mem::size_of::<acpi_table_header>() - 36usize];
    ["Alignment of acpi_table_header"][::core::mem::align_of::<acpi_table_header>() - 1usize];
    ["Offset of field: acpi_table_header::Signature"]
        [::core::mem::offset_of!(acpi_table_header, Signature) - 0usize];
    ["Offset of field: acpi_table_header::Length"]
        [::core::mem::offset_of!(acpi_table_header, Length) - 4usize];
    ["Offset of field: acpi_table_header::Revision"]
        [::core::mem::offset_of!(acpi_table_header, Revision) - 8usize];
    ["Offset of field: acpi_table_header::Checksum"]
        [::core::mem::offset_of!(acpi_table_header, Checksum) - 9usize];
    ["Offset of field: acpi_table_header::OemId"]
        [::core::mem::offset_of!(acpi_table_header, OemId) - 10usize];
    ["Offset of field: acpi_table_header::OemTableId"]
        [::core::mem::offset_of!(acpi_table_header, OemTableId) - 16usize];
    ["Offset of field: acpi_table_header::OemRevision"]
        [::core::mem::offset_of!(acpi_table_header, OemRevision) - 24usize];
    ["Offset of field: acpi_table_header::AslCompilerId"]
        [::core::mem::offset_of!(acpi_table_header, AslCompilerId) - 28usize];
    ["Offset of field: acpi_table_header::AslCompilerRevision"]
        [::core::mem::offset_of!(acpi_table_header, AslCompilerRevision) - 32usize];
};
#[doc = " Master ACPI Table Header. This common header is used by all ACPI tables\n except the RSDP and FACS.\n"]
pub type ACPI_TABLE_HEADER = acpi_table_header;
#[doc = " GAS - Generic Address Structure (ACPI 2.0+)\n\n Note: Since this structure is used in the ACPI tables, it is byte aligned.\n If misaligned access is not supported by the hardware, accesses to the\n 64-bit Address field must be performed with care.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_generic_address {
    pub SpaceId: UINT8,
    pub BitWidth: UINT8,
    pub BitOffset: UINT8,
    pub AccessWidth: UINT8,
    pub Address: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_generic_address"][::core::mem::size_of::<acpi_generic_address>() - 12usize];
    ["Alignment of acpi_generic_address"][::core::mem::align_of::<acpi_generic_address>() - 1usize];
    ["Offset of field: acpi_generic_address::SpaceId"]
        [::core::mem::offset_of!(acpi_generic_address, SpaceId) - 0usize];
    ["Offset of field: acpi_generic_address::BitWidth"]
        [::core::mem::offset_of!(acpi_generic_address, BitWidth) - 1usize];
    ["Offset of field: acpi_generic_address::BitOffset"]
        [::core::mem::offset_of!(acpi_generic_address, BitOffset) - 2usize];
    ["Offset of field: acpi_generic_address::AccessWidth"]
        [::core::mem::offset_of!(acpi_generic_address, AccessWidth) - 3usize];
    ["Offset of field: acpi_generic_address::Address"]
        [::core::mem::offset_of!(acpi_generic_address, Address) - 4usize];
};
#[doc = " GAS - Generic Address Structure (ACPI 2.0+)\n\n Note: Since this structure is used in the ACPI tables, it is byte aligned.\n If misaligned access is not supported by the hardware, accesses to the\n 64-bit Address field must be performed with care.\n"]
pub type ACPI_GENERIC_ADDRESS = acpi_generic_address;
#[doc = " RSDP - Root System Description Pointer (Signature is \"RSD PTR \")\n        Version 2\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_rsdp {
    pub Signature: [::core::ffi::c_char; 8usize],
    pub Checksum: UINT8,
    pub OemId: [::core::ffi::c_char; 6usize],
    pub Revision: UINT8,
    pub RsdtPhysicalAddress: UINT32,
    pub Length: UINT32,
    pub XsdtPhysicalAddress: UINT64,
    pub ExtendedChecksum: UINT8,
    pub Reserved: [UINT8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_rsdp"][::core::mem::size_of::<acpi_table_rsdp>() - 36usize];
    ["Alignment of acpi_table_rsdp"][::core::mem::align_of::<acpi_table_rsdp>() - 1usize];
    ["Offset of field: acpi_table_rsdp::Signature"]
        [::core::mem::offset_of!(acpi_table_rsdp, Signature) - 0usize];
    ["Offset of field: acpi_table_rsdp::Checksum"]
        [::core::mem::offset_of!(acpi_table_rsdp, Checksum) - 8usize];
    ["Offset of field: acpi_table_rsdp::OemId"]
        [::core::mem::offset_of!(acpi_table_rsdp, OemId) - 9usize];
    ["Offset of field: acpi_table_rsdp::Revision"]
        [::core::mem::offset_of!(acpi_table_rsdp, Revision) - 15usize];
    ["Offset of field: acpi_table_rsdp::RsdtPhysicalAddress"]
        [::core::mem::offset_of!(acpi_table_rsdp, RsdtPhysicalAddress) - 16usize];
    ["Offset of field: acpi_table_rsdp::Length"]
        [::core::mem::offset_of!(acpi_table_rsdp, Length) - 20usize];
    ["Offset of field: acpi_table_rsdp::XsdtPhysicalAddress"]
        [::core::mem::offset_of!(acpi_table_rsdp, XsdtPhysicalAddress) - 24usize];
    ["Offset of field: acpi_table_rsdp::ExtendedChecksum"]
        [::core::mem::offset_of!(acpi_table_rsdp, ExtendedChecksum) - 32usize];
    ["Offset of field: acpi_table_rsdp::Reserved"]
        [::core::mem::offset_of!(acpi_table_rsdp, Reserved) - 33usize];
};
#[doc = " RSDP - Root System Description Pointer (Signature is \"RSD PTR \")\n        Version 2\n"]
pub type ACPI_TABLE_RSDP = acpi_table_rsdp;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_rsdp_common {
    pub Signature: [::core::ffi::c_char; 8usize],
    pub Checksum: UINT8,
    pub OemId: [::core::ffi::c_char; 6usize],
    pub Revision: UINT8,
    pub RsdtPhysicalAddress: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_rsdp_common"][::core::mem::size_of::<acpi_rsdp_common>() - 20usize];
    ["Alignment of acpi_rsdp_common"][::core::mem::align_of::<acpi_rsdp_common>() - 1usize];
    ["Offset of field: acpi_rsdp_common::Signature"]
        [::core::mem::offset_of!(acpi_rsdp_common, Signature) - 0usize];
    ["Offset of field: acpi_rsdp_common::Checksum"]
        [::core::mem::offset_of!(acpi_rsdp_common, Checksum) - 8usize];
    ["Offset of field: acpi_rsdp_common::OemId"]
        [::core::mem::offset_of!(acpi_rsdp_common, OemId) - 9usize];
    ["Offset of field: acpi_rsdp_common::Revision"]
        [::core::mem::offset_of!(acpi_rsdp_common, Revision) - 15usize];
    ["Offset of field: acpi_rsdp_common::RsdtPhysicalAddress"]
        [::core::mem::offset_of!(acpi_rsdp_common, RsdtPhysicalAddress) - 16usize];
};
pub type ACPI_RSDP_COMMON = acpi_rsdp_common;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_rsdp_extension {
    pub Length: UINT32,
    pub XsdtPhysicalAddress: UINT64,
    pub ExtendedChecksum: UINT8,
    pub Reserved: [UINT8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_rsdp_extension"][::core::mem::size_of::<acpi_rsdp_extension>() - 16usize];
    ["Alignment of acpi_rsdp_extension"][::core::mem::align_of::<acpi_rsdp_extension>() - 1usize];
    ["Offset of field: acpi_rsdp_extension::Length"]
        [::core::mem::offset_of!(acpi_rsdp_extension, Length) - 0usize];
    ["Offset of field: acpi_rsdp_extension::XsdtPhysicalAddress"]
        [::core::mem::offset_of!(acpi_rsdp_extension, XsdtPhysicalAddress) - 4usize];
    ["Offset of field: acpi_rsdp_extension::ExtendedChecksum"]
        [::core::mem::offset_of!(acpi_rsdp_extension, ExtendedChecksum) - 12usize];
    ["Offset of field: acpi_rsdp_extension::Reserved"]
        [::core::mem::offset_of!(acpi_rsdp_extension, Reserved) - 13usize];
};
pub type ACPI_RSDP_EXTENSION = acpi_rsdp_extension;
#[doc = " RSDT/XSDT - Root System Description Tables\n             Version 1 (both)\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_rsdt {
    pub Header: ACPI_TABLE_HEADER,
    pub TableOffsetEntry: [UINT32; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_rsdt"][::core::mem::size_of::<acpi_table_rsdt>() - 40usize];
    ["Alignment of acpi_table_rsdt"][::core::mem::align_of::<acpi_table_rsdt>() - 1usize];
    ["Offset of field: acpi_table_rsdt::Header"]
        [::core::mem::offset_of!(acpi_table_rsdt, Header) - 0usize];
    ["Offset of field: acpi_table_rsdt::TableOffsetEntry"]
        [::core::mem::offset_of!(acpi_table_rsdt, TableOffsetEntry) - 36usize];
};
#[doc = " RSDT/XSDT - Root System Description Tables\n             Version 1 (both)\n"]
pub type ACPI_TABLE_RSDT = acpi_table_rsdt;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_xsdt {
    pub Header: ACPI_TABLE_HEADER,
    pub TableOffsetEntry: [UINT64; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_xsdt"][::core::mem::size_of::<acpi_table_xsdt>() - 44usize];
    ["Alignment of acpi_table_xsdt"][::core::mem::align_of::<acpi_table_xsdt>() - 1usize];
    ["Offset of field: acpi_table_xsdt::Header"]
        [::core::mem::offset_of!(acpi_table_xsdt, Header) - 0usize];
    ["Offset of field: acpi_table_xsdt::TableOffsetEntry"]
        [::core::mem::offset_of!(acpi_table_xsdt, TableOffsetEntry) - 36usize];
};
pub type ACPI_TABLE_XSDT = acpi_table_xsdt;
#[doc = " FACS - Firmware ACPI Control Structure (FACS)\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_facs {
    pub Signature: [::core::ffi::c_char; 4usize],
    pub Length: UINT32,
    pub HardwareSignature: UINT32,
    pub FirmwareWakingVector: UINT32,
    pub GlobalLock: UINT32,
    pub Flags: UINT32,
    pub XFirmwareWakingVector: UINT64,
    pub Version: UINT8,
    pub Reserved: [UINT8; 3usize],
    pub OspmFlags: UINT32,
    pub Reserved1: [UINT8; 24usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_facs"][::core::mem::size_of::<acpi_table_facs>() - 64usize];
    ["Alignment of acpi_table_facs"][::core::mem::align_of::<acpi_table_facs>() - 1usize];
    ["Offset of field: acpi_table_facs::Signature"]
        [::core::mem::offset_of!(acpi_table_facs, Signature) - 0usize];
    ["Offset of field: acpi_table_facs::Length"]
        [::core::mem::offset_of!(acpi_table_facs, Length) - 4usize];
    ["Offset of field: acpi_table_facs::HardwareSignature"]
        [::core::mem::offset_of!(acpi_table_facs, HardwareSignature) - 8usize];
    ["Offset of field: acpi_table_facs::FirmwareWakingVector"]
        [::core::mem::offset_of!(acpi_table_facs, FirmwareWakingVector) - 12usize];
    ["Offset of field: acpi_table_facs::GlobalLock"]
        [::core::mem::offset_of!(acpi_table_facs, GlobalLock) - 16usize];
    ["Offset of field: acpi_table_facs::Flags"]
        [::core::mem::offset_of!(acpi_table_facs, Flags) - 20usize];
    ["Offset of field: acpi_table_facs::XFirmwareWakingVector"]
        [::core::mem::offset_of!(acpi_table_facs, XFirmwareWakingVector) - 24usize];
    ["Offset of field: acpi_table_facs::Version"]
        [::core::mem::offset_of!(acpi_table_facs, Version) - 32usize];
    ["Offset of field: acpi_table_facs::Reserved"]
        [::core::mem::offset_of!(acpi_table_facs, Reserved) - 33usize];
    ["Offset of field: acpi_table_facs::OspmFlags"]
        [::core::mem::offset_of!(acpi_table_facs, OspmFlags) - 36usize];
    ["Offset of field: acpi_table_facs::Reserved1"]
        [::core::mem::offset_of!(acpi_table_facs, Reserved1) - 40usize];
};
#[doc = " FACS - Firmware ACPI Control Structure (FACS)\n"]
pub type ACPI_TABLE_FACS = acpi_table_facs;
#[doc = " FADT - Fixed ACPI Description Table (Signature \"FACP\")\n        Version 6\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_fadt {
    pub Header: ACPI_TABLE_HEADER,
    pub Facs: UINT32,
    pub Dsdt: UINT32,
    pub Model: UINT8,
    pub PreferredProfile: UINT8,
    pub SciInterrupt: UINT16,
    pub SmiCommand: UINT32,
    pub AcpiEnable: UINT8,
    pub AcpiDisable: UINT8,
    pub S4BiosRequest: UINT8,
    pub PstateControl: UINT8,
    pub Pm1aEventBlock: UINT32,
    pub Pm1bEventBlock: UINT32,
    pub Pm1aControlBlock: UINT32,
    pub Pm1bControlBlock: UINT32,
    pub Pm2ControlBlock: UINT32,
    pub PmTimerBlock: UINT32,
    pub Gpe0Block: UINT32,
    pub Gpe1Block: UINT32,
    pub Pm1EventLength: UINT8,
    pub Pm1ControlLength: UINT8,
    pub Pm2ControlLength: UINT8,
    pub PmTimerLength: UINT8,
    pub Gpe0BlockLength: UINT8,
    pub Gpe1BlockLength: UINT8,
    pub Gpe1Base: UINT8,
    pub CstControl: UINT8,
    pub C2Latency: UINT16,
    pub C3Latency: UINT16,
    pub FlushSize: UINT16,
    pub FlushStride: UINT16,
    pub DutyOffset: UINT8,
    pub DutyWidth: UINT8,
    pub DayAlarm: UINT8,
    pub MonthAlarm: UINT8,
    pub Century: UINT8,
    pub BootFlags: UINT16,
    pub Reserved: UINT8,
    pub Flags: UINT32,
    pub ResetRegister: ACPI_GENERIC_ADDRESS,
    pub ResetValue: UINT8,
    pub ArmBootFlags: UINT16,
    pub MinorRevision: UINT8,
    pub XFacs: UINT64,
    pub XDsdt: UINT64,
    pub XPm1aEventBlock: ACPI_GENERIC_ADDRESS,
    pub XPm1bEventBlock: ACPI_GENERIC_ADDRESS,
    pub XPm1aControlBlock: ACPI_GENERIC_ADDRESS,
    pub XPm1bControlBlock: ACPI_GENERIC_ADDRESS,
    pub XPm2ControlBlock: ACPI_GENERIC_ADDRESS,
    pub XPmTimerBlock: ACPI_GENERIC_ADDRESS,
    pub XGpe0Block: ACPI_GENERIC_ADDRESS,
    pub XGpe1Block: ACPI_GENERIC_ADDRESS,
    pub SleepControl: ACPI_GENERIC_ADDRESS,
    pub SleepStatus: ACPI_GENERIC_ADDRESS,
    pub HypervisorId: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_fadt"][::core::mem::size_of::<acpi_table_fadt>() - 276usize];
    ["Alignment of acpi_table_fadt"][::core::mem::align_of::<acpi_table_fadt>() - 1usize];
    ["Offset of field: acpi_table_fadt::Header"]
        [::core::mem::offset_of!(acpi_table_fadt, Header) - 0usize];
    ["Offset of field: acpi_table_fadt::Facs"]
        [::core::mem::offset_of!(acpi_table_fadt, Facs) - 36usize];
    ["Offset of field: acpi_table_fadt::Dsdt"]
        [::core::mem::offset_of!(acpi_table_fadt, Dsdt) - 40usize];
    ["Offset of field: acpi_table_fadt::Model"]
        [::core::mem::offset_of!(acpi_table_fadt, Model) - 44usize];
    ["Offset of field: acpi_table_fadt::PreferredProfile"]
        [::core::mem::offset_of!(acpi_table_fadt, PreferredProfile) - 45usize];
    ["Offset of field: acpi_table_fadt::SciInterrupt"]
        [::core::mem::offset_of!(acpi_table_fadt, SciInterrupt) - 46usize];
    ["Offset of field: acpi_table_fadt::SmiCommand"]
        [::core::mem::offset_of!(acpi_table_fadt, SmiCommand) - 48usize];
    ["Offset of field: acpi_table_fadt::AcpiEnable"]
        [::core::mem::offset_of!(acpi_table_fadt, AcpiEnable) - 52usize];
    ["Offset of field: acpi_table_fadt::AcpiDisable"]
        [::core::mem::offset_of!(acpi_table_fadt, AcpiDisable) - 53usize];
    ["Offset of field: acpi_table_fadt::S4BiosRequest"]
        [::core::mem::offset_of!(acpi_table_fadt, S4BiosRequest) - 54usize];
    ["Offset of field: acpi_table_fadt::PstateControl"]
        [::core::mem::offset_of!(acpi_table_fadt, PstateControl) - 55usize];
    ["Offset of field: acpi_table_fadt::Pm1aEventBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, Pm1aEventBlock) - 56usize];
    ["Offset of field: acpi_table_fadt::Pm1bEventBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, Pm1bEventBlock) - 60usize];
    ["Offset of field: acpi_table_fadt::Pm1aControlBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, Pm1aControlBlock) - 64usize];
    ["Offset of field: acpi_table_fadt::Pm1bControlBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, Pm1bControlBlock) - 68usize];
    ["Offset of field: acpi_table_fadt::Pm2ControlBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, Pm2ControlBlock) - 72usize];
    ["Offset of field: acpi_table_fadt::PmTimerBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, PmTimerBlock) - 76usize];
    ["Offset of field: acpi_table_fadt::Gpe0Block"]
        [::core::mem::offset_of!(acpi_table_fadt, Gpe0Block) - 80usize];
    ["Offset of field: acpi_table_fadt::Gpe1Block"]
        [::core::mem::offset_of!(acpi_table_fadt, Gpe1Block) - 84usize];
    ["Offset of field: acpi_table_fadt::Pm1EventLength"]
        [::core::mem::offset_of!(acpi_table_fadt, Pm1EventLength) - 88usize];
    ["Offset of field: acpi_table_fadt::Pm1ControlLength"]
        [::core::mem::offset_of!(acpi_table_fadt, Pm1ControlLength) - 89usize];
    ["Offset of field: acpi_table_fadt::Pm2ControlLength"]
        [::core::mem::offset_of!(acpi_table_fadt, Pm2ControlLength) - 90usize];
    ["Offset of field: acpi_table_fadt::PmTimerLength"]
        [::core::mem::offset_of!(acpi_table_fadt, PmTimerLength) - 91usize];
    ["Offset of field: acpi_table_fadt::Gpe0BlockLength"]
        [::core::mem::offset_of!(acpi_table_fadt, Gpe0BlockLength) - 92usize];
    ["Offset of field: acpi_table_fadt::Gpe1BlockLength"]
        [::core::mem::offset_of!(acpi_table_fadt, Gpe1BlockLength) - 93usize];
    ["Offset of field: acpi_table_fadt::Gpe1Base"]
        [::core::mem::offset_of!(acpi_table_fadt, Gpe1Base) - 94usize];
    ["Offset of field: acpi_table_fadt::CstControl"]
        [::core::mem::offset_of!(acpi_table_fadt, CstControl) - 95usize];
    ["Offset of field: acpi_table_fadt::C2Latency"]
        [::core::mem::offset_of!(acpi_table_fadt, C2Latency) - 96usize];
    ["Offset of field: acpi_table_fadt::C3Latency"]
        [::core::mem::offset_of!(acpi_table_fadt, C3Latency) - 98usize];
    ["Offset of field: acpi_table_fadt::FlushSize"]
        [::core::mem::offset_of!(acpi_table_fadt, FlushSize) - 100usize];
    ["Offset of field: acpi_table_fadt::FlushStride"]
        [::core::mem::offset_of!(acpi_table_fadt, FlushStride) - 102usize];
    ["Offset of field: acpi_table_fadt::DutyOffset"]
        [::core::mem::offset_of!(acpi_table_fadt, DutyOffset) - 104usize];
    ["Offset of field: acpi_table_fadt::DutyWidth"]
        [::core::mem::offset_of!(acpi_table_fadt, DutyWidth) - 105usize];
    ["Offset of field: acpi_table_fadt::DayAlarm"]
        [::core::mem::offset_of!(acpi_table_fadt, DayAlarm) - 106usize];
    ["Offset of field: acpi_table_fadt::MonthAlarm"]
        [::core::mem::offset_of!(acpi_table_fadt, MonthAlarm) - 107usize];
    ["Offset of field: acpi_table_fadt::Century"]
        [::core::mem::offset_of!(acpi_table_fadt, Century) - 108usize];
    ["Offset of field: acpi_table_fadt::BootFlags"]
        [::core::mem::offset_of!(acpi_table_fadt, BootFlags) - 109usize];
    ["Offset of field: acpi_table_fadt::Reserved"]
        [::core::mem::offset_of!(acpi_table_fadt, Reserved) - 111usize];
    ["Offset of field: acpi_table_fadt::Flags"]
        [::core::mem::offset_of!(acpi_table_fadt, Flags) - 112usize];
    ["Offset of field: acpi_table_fadt::ResetRegister"]
        [::core::mem::offset_of!(acpi_table_fadt, ResetRegister) - 116usize];
    ["Offset of field: acpi_table_fadt::ResetValue"]
        [::core::mem::offset_of!(acpi_table_fadt, ResetValue) - 128usize];
    ["Offset of field: acpi_table_fadt::ArmBootFlags"]
        [::core::mem::offset_of!(acpi_table_fadt, ArmBootFlags) - 129usize];
    ["Offset of field: acpi_table_fadt::MinorRevision"]
        [::core::mem::offset_of!(acpi_table_fadt, MinorRevision) - 131usize];
    ["Offset of field: acpi_table_fadt::XFacs"]
        [::core::mem::offset_of!(acpi_table_fadt, XFacs) - 132usize];
    ["Offset of field: acpi_table_fadt::XDsdt"]
        [::core::mem::offset_of!(acpi_table_fadt, XDsdt) - 140usize];
    ["Offset of field: acpi_table_fadt::XPm1aEventBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, XPm1aEventBlock) - 148usize];
    ["Offset of field: acpi_table_fadt::XPm1bEventBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, XPm1bEventBlock) - 160usize];
    ["Offset of field: acpi_table_fadt::XPm1aControlBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, XPm1aControlBlock) - 172usize];
    ["Offset of field: acpi_table_fadt::XPm1bControlBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, XPm1bControlBlock) - 184usize];
    ["Offset of field: acpi_table_fadt::XPm2ControlBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, XPm2ControlBlock) - 196usize];
    ["Offset of field: acpi_table_fadt::XPmTimerBlock"]
        [::core::mem::offset_of!(acpi_table_fadt, XPmTimerBlock) - 208usize];
    ["Offset of field: acpi_table_fadt::XGpe0Block"]
        [::core::mem::offset_of!(acpi_table_fadt, XGpe0Block) - 220usize];
    ["Offset of field: acpi_table_fadt::XGpe1Block"]
        [::core::mem::offset_of!(acpi_table_fadt, XGpe1Block) - 232usize];
    ["Offset of field: acpi_table_fadt::SleepControl"]
        [::core::mem::offset_of!(acpi_table_fadt, SleepControl) - 244usize];
    ["Offset of field: acpi_table_fadt::SleepStatus"]
        [::core::mem::offset_of!(acpi_table_fadt, SleepStatus) - 256usize];
    ["Offset of field: acpi_table_fadt::HypervisorId"]
        [::core::mem::offset_of!(acpi_table_fadt, HypervisorId) - 268usize];
};
#[doc = " FADT - Fixed ACPI Description Table (Signature \"FACP\")\n        Version 6\n"]
pub type ACPI_TABLE_FADT = acpi_table_fadt;
pub const AcpiPreferredPmProfiles_PM_UNSPECIFIED: AcpiPreferredPmProfiles = 0;
pub const AcpiPreferredPmProfiles_PM_DESKTOP: AcpiPreferredPmProfiles = 1;
pub const AcpiPreferredPmProfiles_PM_MOBILE: AcpiPreferredPmProfiles = 2;
pub const AcpiPreferredPmProfiles_PM_WORKSTATION: AcpiPreferredPmProfiles = 3;
pub const AcpiPreferredPmProfiles_PM_ENTERPRISE_SERVER: AcpiPreferredPmProfiles = 4;
pub const AcpiPreferredPmProfiles_PM_SOHO_SERVER: AcpiPreferredPmProfiles = 5;
pub const AcpiPreferredPmProfiles_PM_APPLIANCE_PC: AcpiPreferredPmProfiles = 6;
pub const AcpiPreferredPmProfiles_PM_PERFORMANCE_SERVER: AcpiPreferredPmProfiles = 7;
pub const AcpiPreferredPmProfiles_PM_TABLET: AcpiPreferredPmProfiles = 8;
pub type AcpiPreferredPmProfiles = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union acpi_name_union {
    pub Integer: UINT32,
    pub Ascii: [::core::ffi::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_name_union"][::core::mem::size_of::<acpi_name_union>() - 4usize];
    ["Alignment of acpi_name_union"][::core::mem::align_of::<acpi_name_union>() - 4usize];
    ["Offset of field: acpi_name_union::Integer"]
        [::core::mem::offset_of!(acpi_name_union, Integer) - 0usize];
    ["Offset of field: acpi_name_union::Ascii"]
        [::core::mem::offset_of!(acpi_name_union, Ascii) - 0usize];
};
pub type ACPI_NAME_UNION = acpi_name_union;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct acpi_table_desc {
    pub Address: ACPI_PHYSICAL_ADDRESS,
    pub Pointer: *mut ACPI_TABLE_HEADER,
    pub Length: UINT32,
    pub Signature: ACPI_NAME_UNION,
    pub OwnerId: ACPI_OWNER_ID,
    pub Flags: UINT8,
    pub ValidationCount: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_desc"][::core::mem::size_of::<acpi_table_desc>() - 32usize];
    ["Alignment of acpi_table_desc"][::core::mem::align_of::<acpi_table_desc>() - 8usize];
    ["Offset of field: acpi_table_desc::Address"]
        [::core::mem::offset_of!(acpi_table_desc, Address) - 0usize];
    ["Offset of field: acpi_table_desc::Pointer"]
        [::core::mem::offset_of!(acpi_table_desc, Pointer) - 8usize];
    ["Offset of field: acpi_table_desc::Length"]
        [::core::mem::offset_of!(acpi_table_desc, Length) - 16usize];
    ["Offset of field: acpi_table_desc::Signature"]
        [::core::mem::offset_of!(acpi_table_desc, Signature) - 20usize];
    ["Offset of field: acpi_table_desc::OwnerId"]
        [::core::mem::offset_of!(acpi_table_desc, OwnerId) - 24usize];
    ["Offset of field: acpi_table_desc::Flags"]
        [::core::mem::offset_of!(acpi_table_desc, Flags) - 26usize];
    ["Offset of field: acpi_table_desc::ValidationCount"]
        [::core::mem::offset_of!(acpi_table_desc, ValidationCount) - 28usize];
};
pub type ACPI_TABLE_DESC = acpi_table_desc;
#[doc = " Common subtable headers\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_subtable_header {
    pub Type: UINT8,
    pub Length: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_subtable_header"][::core::mem::size_of::<acpi_subtable_header>() - 2usize];
    ["Alignment of acpi_subtable_header"][::core::mem::align_of::<acpi_subtable_header>() - 1usize];
    ["Offset of field: acpi_subtable_header::Type"]
        [::core::mem::offset_of!(acpi_subtable_header, Type) - 0usize];
    ["Offset of field: acpi_subtable_header::Length"]
        [::core::mem::offset_of!(acpi_subtable_header, Length) - 1usize];
};
#[doc = " Common subtable headers\n"]
pub type ACPI_SUBTABLE_HEADER = acpi_subtable_header;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_whea_header {
    pub Action: UINT8,
    pub Instruction: UINT8,
    pub Flags: UINT8,
    pub Reserved: UINT8,
    pub RegisterRegion: ACPI_GENERIC_ADDRESS,
    pub Value: UINT64,
    pub Mask: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_whea_header"][::core::mem::size_of::<acpi_whea_header>() - 32usize];
    ["Alignment of acpi_whea_header"][::core::mem::align_of::<acpi_whea_header>() - 1usize];
    ["Offset of field: acpi_whea_header::Action"]
        [::core::mem::offset_of!(acpi_whea_header, Action) - 0usize];
    ["Offset of field: acpi_whea_header::Instruction"]
        [::core::mem::offset_of!(acpi_whea_header, Instruction) - 1usize];
    ["Offset of field: acpi_whea_header::Flags"]
        [::core::mem::offset_of!(acpi_whea_header, Flags) - 2usize];
    ["Offset of field: acpi_whea_header::Reserved"]
        [::core::mem::offset_of!(acpi_whea_header, Reserved) - 3usize];
    ["Offset of field: acpi_whea_header::RegisterRegion"]
        [::core::mem::offset_of!(acpi_whea_header, RegisterRegion) - 4usize];
    ["Offset of field: acpi_whea_header::Value"]
        [::core::mem::offset_of!(acpi_whea_header, Value) - 16usize];
    ["Offset of field: acpi_whea_header::Mask"]
        [::core::mem::offset_of!(acpi_whea_header, Mask) - 24usize];
};
pub type ACPI_WHEA_HEADER = acpi_whea_header;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_subtbl_hdr_16 {
    pub Type: UINT16,
    pub Length: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_subtbl_hdr_16"][::core::mem::size_of::<acpi_subtbl_hdr_16>() - 4usize];
    ["Alignment of acpi_subtbl_hdr_16"][::core::mem::align_of::<acpi_subtbl_hdr_16>() - 1usize];
    ["Offset of field: acpi_subtbl_hdr_16::Type"]
        [::core::mem::offset_of!(acpi_subtbl_hdr_16, Type) - 0usize];
    ["Offset of field: acpi_subtbl_hdr_16::Length"]
        [::core::mem::offset_of!(acpi_subtbl_hdr_16, Length) - 2usize];
};
pub type ACPI_SUBTBL_HDR_16 = acpi_subtbl_hdr_16;
#[doc = " ASF - Alert Standard Format table (Signature \"ASF!\")\n       Revision 0x10\n\n Conforms to the Alert Standard Format Specification V2.0, 23 April 2003\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_asf {
    pub Header: ACPI_TABLE_HEADER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_asf"][::core::mem::size_of::<acpi_table_asf>() - 36usize];
    ["Alignment of acpi_table_asf"][::core::mem::align_of::<acpi_table_asf>() - 1usize];
    ["Offset of field: acpi_table_asf::Header"]
        [::core::mem::offset_of!(acpi_table_asf, Header) - 0usize];
};
#[doc = " ASF - Alert Standard Format table (Signature \"ASF!\")\n       Revision 0x10\n\n Conforms to the Alert Standard Format Specification V2.0, 23 April 2003\n"]
pub type ACPI_TABLE_ASF = acpi_table_asf;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_asf_header {
    pub Type: UINT8,
    pub Reserved: UINT8,
    pub Length: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_asf_header"][::core::mem::size_of::<acpi_asf_header>() - 4usize];
    ["Alignment of acpi_asf_header"][::core::mem::align_of::<acpi_asf_header>() - 1usize];
    ["Offset of field: acpi_asf_header::Type"]
        [::core::mem::offset_of!(acpi_asf_header, Type) - 0usize];
    ["Offset of field: acpi_asf_header::Reserved"]
        [::core::mem::offset_of!(acpi_asf_header, Reserved) - 1usize];
    ["Offset of field: acpi_asf_header::Length"]
        [::core::mem::offset_of!(acpi_asf_header, Length) - 2usize];
};
pub type ACPI_ASF_HEADER = acpi_asf_header;
pub const AcpiAsfType_ACPI_ASF_TYPE_INFO: AcpiAsfType = 0;
pub const AcpiAsfType_ACPI_ASF_TYPE_ALERT: AcpiAsfType = 1;
pub const AcpiAsfType_ACPI_ASF_TYPE_CONTROL: AcpiAsfType = 2;
pub const AcpiAsfType_ACPI_ASF_TYPE_BOOT: AcpiAsfType = 3;
pub const AcpiAsfType_ACPI_ASF_TYPE_ADDRESS: AcpiAsfType = 4;
pub const AcpiAsfType_ACPI_ASF_TYPE_RESERVED: AcpiAsfType = 5;
pub type AcpiAsfType = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_asf_info {
    pub Header: ACPI_ASF_HEADER,
    pub MinResetValue: UINT8,
    pub MinPollInterval: UINT8,
    pub SystemId: UINT16,
    pub MfgId: UINT32,
    pub Flags: UINT8,
    pub Reserved2: [UINT8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_asf_info"][::core::mem::size_of::<acpi_asf_info>() - 16usize];
    ["Alignment of acpi_asf_info"][::core::mem::align_of::<acpi_asf_info>() - 1usize];
    ["Offset of field: acpi_asf_info::Header"]
        [::core::mem::offset_of!(acpi_asf_info, Header) - 0usize];
    ["Offset of field: acpi_asf_info::MinResetValue"]
        [::core::mem::offset_of!(acpi_asf_info, MinResetValue) - 4usize];
    ["Offset of field: acpi_asf_info::MinPollInterval"]
        [::core::mem::offset_of!(acpi_asf_info, MinPollInterval) - 5usize];
    ["Offset of field: acpi_asf_info::SystemId"]
        [::core::mem::offset_of!(acpi_asf_info, SystemId) - 6usize];
    ["Offset of field: acpi_asf_info::MfgId"]
        [::core::mem::offset_of!(acpi_asf_info, MfgId) - 8usize];
    ["Offset of field: acpi_asf_info::Flags"]
        [::core::mem::offset_of!(acpi_asf_info, Flags) - 12usize];
    ["Offset of field: acpi_asf_info::Reserved2"]
        [::core::mem::offset_of!(acpi_asf_info, Reserved2) - 13usize];
};
pub type ACPI_ASF_INFO = acpi_asf_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_asf_alert {
    pub Header: ACPI_ASF_HEADER,
    pub AssertMask: UINT8,
    pub DeassertMask: UINT8,
    pub Alerts: UINT8,
    pub DataLength: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_asf_alert"][::core::mem::size_of::<acpi_asf_alert>() - 8usize];
    ["Alignment of acpi_asf_alert"][::core::mem::align_of::<acpi_asf_alert>() - 1usize];
    ["Offset of field: acpi_asf_alert::Header"]
        [::core::mem::offset_of!(acpi_asf_alert, Header) - 0usize];
    ["Offset of field: acpi_asf_alert::AssertMask"]
        [::core::mem::offset_of!(acpi_asf_alert, AssertMask) - 4usize];
    ["Offset of field: acpi_asf_alert::DeassertMask"]
        [::core::mem::offset_of!(acpi_asf_alert, DeassertMask) - 5usize];
    ["Offset of field: acpi_asf_alert::Alerts"]
        [::core::mem::offset_of!(acpi_asf_alert, Alerts) - 6usize];
    ["Offset of field: acpi_asf_alert::DataLength"]
        [::core::mem::offset_of!(acpi_asf_alert, DataLength) - 7usize];
};
pub type ACPI_ASF_ALERT = acpi_asf_alert;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_asf_alert_data {
    pub Address: UINT8,
    pub Command: UINT8,
    pub Mask: UINT8,
    pub Value: UINT8,
    pub SensorType: UINT8,
    pub Type: UINT8,
    pub Offset: UINT8,
    pub SourceType: UINT8,
    pub Severity: UINT8,
    pub SensorNumber: UINT8,
    pub Entity: UINT8,
    pub Instance: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_asf_alert_data"][::core::mem::size_of::<acpi_asf_alert_data>() - 12usize];
    ["Alignment of acpi_asf_alert_data"][::core::mem::align_of::<acpi_asf_alert_data>() - 1usize];
    ["Offset of field: acpi_asf_alert_data::Address"]
        [::core::mem::offset_of!(acpi_asf_alert_data, Address) - 0usize];
    ["Offset of field: acpi_asf_alert_data::Command"]
        [::core::mem::offset_of!(acpi_asf_alert_data, Command) - 1usize];
    ["Offset of field: acpi_asf_alert_data::Mask"]
        [::core::mem::offset_of!(acpi_asf_alert_data, Mask) - 2usize];
    ["Offset of field: acpi_asf_alert_data::Value"]
        [::core::mem::offset_of!(acpi_asf_alert_data, Value) - 3usize];
    ["Offset of field: acpi_asf_alert_data::SensorType"]
        [::core::mem::offset_of!(acpi_asf_alert_data, SensorType) - 4usize];
    ["Offset of field: acpi_asf_alert_data::Type"]
        [::core::mem::offset_of!(acpi_asf_alert_data, Type) - 5usize];
    ["Offset of field: acpi_asf_alert_data::Offset"]
        [::core::mem::offset_of!(acpi_asf_alert_data, Offset) - 6usize];
    ["Offset of field: acpi_asf_alert_data::SourceType"]
        [::core::mem::offset_of!(acpi_asf_alert_data, SourceType) - 7usize];
    ["Offset of field: acpi_asf_alert_data::Severity"]
        [::core::mem::offset_of!(acpi_asf_alert_data, Severity) - 8usize];
    ["Offset of field: acpi_asf_alert_data::SensorNumber"]
        [::core::mem::offset_of!(acpi_asf_alert_data, SensorNumber) - 9usize];
    ["Offset of field: acpi_asf_alert_data::Entity"]
        [::core::mem::offset_of!(acpi_asf_alert_data, Entity) - 10usize];
    ["Offset of field: acpi_asf_alert_data::Instance"]
        [::core::mem::offset_of!(acpi_asf_alert_data, Instance) - 11usize];
};
pub type ACPI_ASF_ALERT_DATA = acpi_asf_alert_data;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_asf_remote {
    pub Header: ACPI_ASF_HEADER,
    pub Controls: UINT8,
    pub DataLength: UINT8,
    pub Reserved2: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_asf_remote"][::core::mem::size_of::<acpi_asf_remote>() - 8usize];
    ["Alignment of acpi_asf_remote"][::core::mem::align_of::<acpi_asf_remote>() - 1usize];
    ["Offset of field: acpi_asf_remote::Header"]
        [::core::mem::offset_of!(acpi_asf_remote, Header) - 0usize];
    ["Offset of field: acpi_asf_remote::Controls"]
        [::core::mem::offset_of!(acpi_asf_remote, Controls) - 4usize];
    ["Offset of field: acpi_asf_remote::DataLength"]
        [::core::mem::offset_of!(acpi_asf_remote, DataLength) - 5usize];
    ["Offset of field: acpi_asf_remote::Reserved2"]
        [::core::mem::offset_of!(acpi_asf_remote, Reserved2) - 6usize];
};
pub type ACPI_ASF_REMOTE = acpi_asf_remote;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_asf_control_data {
    pub Function: UINT8,
    pub Address: UINT8,
    pub Command: UINT8,
    pub Value: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_asf_control_data"][::core::mem::size_of::<acpi_asf_control_data>() - 4usize];
    ["Alignment of acpi_asf_control_data"]
        [::core::mem::align_of::<acpi_asf_control_data>() - 1usize];
    ["Offset of field: acpi_asf_control_data::Function"]
        [::core::mem::offset_of!(acpi_asf_control_data, Function) - 0usize];
    ["Offset of field: acpi_asf_control_data::Address"]
        [::core::mem::offset_of!(acpi_asf_control_data, Address) - 1usize];
    ["Offset of field: acpi_asf_control_data::Command"]
        [::core::mem::offset_of!(acpi_asf_control_data, Command) - 2usize];
    ["Offset of field: acpi_asf_control_data::Value"]
        [::core::mem::offset_of!(acpi_asf_control_data, Value) - 3usize];
};
pub type ACPI_ASF_CONTROL_DATA = acpi_asf_control_data;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_asf_rmcp {
    pub Header: ACPI_ASF_HEADER,
    pub Capabilities: [UINT8; 7usize],
    pub CompletionCode: UINT8,
    pub EnterpriseId: UINT32,
    pub Command: UINT8,
    pub Parameter: UINT16,
    pub BootOptions: UINT16,
    pub OemParameters: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_asf_rmcp"][::core::mem::size_of::<acpi_asf_rmcp>() - 23usize];
    ["Alignment of acpi_asf_rmcp"][::core::mem::align_of::<acpi_asf_rmcp>() - 1usize];
    ["Offset of field: acpi_asf_rmcp::Header"]
        [::core::mem::offset_of!(acpi_asf_rmcp, Header) - 0usize];
    ["Offset of field: acpi_asf_rmcp::Capabilities"]
        [::core::mem::offset_of!(acpi_asf_rmcp, Capabilities) - 4usize];
    ["Offset of field: acpi_asf_rmcp::CompletionCode"]
        [::core::mem::offset_of!(acpi_asf_rmcp, CompletionCode) - 11usize];
    ["Offset of field: acpi_asf_rmcp::EnterpriseId"]
        [::core::mem::offset_of!(acpi_asf_rmcp, EnterpriseId) - 12usize];
    ["Offset of field: acpi_asf_rmcp::Command"]
        [::core::mem::offset_of!(acpi_asf_rmcp, Command) - 16usize];
    ["Offset of field: acpi_asf_rmcp::Parameter"]
        [::core::mem::offset_of!(acpi_asf_rmcp, Parameter) - 17usize];
    ["Offset of field: acpi_asf_rmcp::BootOptions"]
        [::core::mem::offset_of!(acpi_asf_rmcp, BootOptions) - 19usize];
    ["Offset of field: acpi_asf_rmcp::OemParameters"]
        [::core::mem::offset_of!(acpi_asf_rmcp, OemParameters) - 21usize];
};
pub type ACPI_ASF_RMCP = acpi_asf_rmcp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_asf_address {
    pub Header: ACPI_ASF_HEADER,
    pub EpromAddress: UINT8,
    pub Devices: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_asf_address"][::core::mem::size_of::<acpi_asf_address>() - 6usize];
    ["Alignment of acpi_asf_address"][::core::mem::align_of::<acpi_asf_address>() - 1usize];
    ["Offset of field: acpi_asf_address::Header"]
        [::core::mem::offset_of!(acpi_asf_address, Header) - 0usize];
    ["Offset of field: acpi_asf_address::EpromAddress"]
        [::core::mem::offset_of!(acpi_asf_address, EpromAddress) - 4usize];
    ["Offset of field: acpi_asf_address::Devices"]
        [::core::mem::offset_of!(acpi_asf_address, Devices) - 5usize];
};
pub type ACPI_ASF_ADDRESS = acpi_asf_address;
#[doc = " ASPT - AMD Secure Processor Table (Signature \"ASPT\")\n        Revision 0x1\n\n Conforms to AMD Socket SP5/SP6 Platform ASPT Rev1 Specification,\n 12 September 2022\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_aspt {
    pub Header: ACPI_TABLE_HEADER,
    pub NumEntries: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_aspt"][::core::mem::size_of::<acpi_table_aspt>() - 40usize];
    ["Alignment of acpi_table_aspt"][::core::mem::align_of::<acpi_table_aspt>() - 1usize];
    ["Offset of field: acpi_table_aspt::Header"]
        [::core::mem::offset_of!(acpi_table_aspt, Header) - 0usize];
    ["Offset of field: acpi_table_aspt::NumEntries"]
        [::core::mem::offset_of!(acpi_table_aspt, NumEntries) - 36usize];
};
#[doc = " ASPT - AMD Secure Processor Table (Signature \"ASPT\")\n        Revision 0x1\n\n Conforms to AMD Socket SP5/SP6 Platform ASPT Rev1 Specification,\n 12 September 2022\n"]
pub type ACPI_TABLE_ASPT = acpi_table_aspt;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_aspt_header {
    pub Type: UINT16,
    pub Length: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_aspt_header"][::core::mem::size_of::<acpi_aspt_header>() - 4usize];
    ["Alignment of acpi_aspt_header"][::core::mem::align_of::<acpi_aspt_header>() - 1usize];
    ["Offset of field: acpi_aspt_header::Type"]
        [::core::mem::offset_of!(acpi_aspt_header, Type) - 0usize];
    ["Offset of field: acpi_aspt_header::Length"]
        [::core::mem::offset_of!(acpi_aspt_header, Length) - 2usize];
};
pub type ACPI_ASPT_HEADER = acpi_aspt_header;
pub const AcpiAsptType_ACPI_ASPT_TYPE_GLOBAL_REGS: AcpiAsptType = 0;
pub const AcpiAsptType_ACPI_ASPT_TYPE_SEV_MBOX_REGS: AcpiAsptType = 1;
pub const AcpiAsptType_ACPI_ASPT_TYPE_ACPI_MBOX_REGS: AcpiAsptType = 2;
pub const AcpiAsptType_ACPI_ASPT_TYPE_UNKNOWN: AcpiAsptType = 3;
pub type AcpiAsptType = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_aspt_global_regs {
    pub Header: ACPI_ASPT_HEADER,
    pub Reserved: UINT32,
    pub FeatureRegAddr: UINT64,
    pub IrqEnRegAddr: UINT64,
    pub IrqStRegAddr: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_aspt_global_regs"][::core::mem::size_of::<acpi_aspt_global_regs>() - 32usize];
    ["Alignment of acpi_aspt_global_regs"]
        [::core::mem::align_of::<acpi_aspt_global_regs>() - 1usize];
    ["Offset of field: acpi_aspt_global_regs::Header"]
        [::core::mem::offset_of!(acpi_aspt_global_regs, Header) - 0usize];
    ["Offset of field: acpi_aspt_global_regs::Reserved"]
        [::core::mem::offset_of!(acpi_aspt_global_regs, Reserved) - 4usize];
    ["Offset of field: acpi_aspt_global_regs::FeatureRegAddr"]
        [::core::mem::offset_of!(acpi_aspt_global_regs, FeatureRegAddr) - 8usize];
    ["Offset of field: acpi_aspt_global_regs::IrqEnRegAddr"]
        [::core::mem::offset_of!(acpi_aspt_global_regs, IrqEnRegAddr) - 16usize];
    ["Offset of field: acpi_aspt_global_regs::IrqStRegAddr"]
        [::core::mem::offset_of!(acpi_aspt_global_regs, IrqStRegAddr) - 24usize];
};
pub type ACPI_ASPT_GLOBAL_REGS = acpi_aspt_global_regs;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_aspt_sev_mbox_regs {
    pub Header: ACPI_ASPT_HEADER,
    pub MboxIrqId: UINT8,
    pub Reserved: [UINT8; 3usize],
    pub CmdRespRegAddr: UINT64,
    pub CmdBufLoRegAddr: UINT64,
    pub CmdBufHiRegAddr: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_aspt_sev_mbox_regs"]
        [::core::mem::size_of::<acpi_aspt_sev_mbox_regs>() - 32usize];
    ["Alignment of acpi_aspt_sev_mbox_regs"]
        [::core::mem::align_of::<acpi_aspt_sev_mbox_regs>() - 1usize];
    ["Offset of field: acpi_aspt_sev_mbox_regs::Header"]
        [::core::mem::offset_of!(acpi_aspt_sev_mbox_regs, Header) - 0usize];
    ["Offset of field: acpi_aspt_sev_mbox_regs::MboxIrqId"]
        [::core::mem::offset_of!(acpi_aspt_sev_mbox_regs, MboxIrqId) - 4usize];
    ["Offset of field: acpi_aspt_sev_mbox_regs::Reserved"]
        [::core::mem::offset_of!(acpi_aspt_sev_mbox_regs, Reserved) - 5usize];
    ["Offset of field: acpi_aspt_sev_mbox_regs::CmdRespRegAddr"]
        [::core::mem::offset_of!(acpi_aspt_sev_mbox_regs, CmdRespRegAddr) - 8usize];
    ["Offset of field: acpi_aspt_sev_mbox_regs::CmdBufLoRegAddr"]
        [::core::mem::offset_of!(acpi_aspt_sev_mbox_regs, CmdBufLoRegAddr) - 16usize];
    ["Offset of field: acpi_aspt_sev_mbox_regs::CmdBufHiRegAddr"]
        [::core::mem::offset_of!(acpi_aspt_sev_mbox_regs, CmdBufHiRegAddr) - 24usize];
};
pub type ACPI_ASPT_SEV_MBOX_REGS = acpi_aspt_sev_mbox_regs;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_aspt_acpi_mbox_regs {
    pub Header: ACPI_ASPT_HEADER,
    pub Reserved1: UINT32,
    pub CmdRespRegAddr: UINT64,
    pub Reserved2: [UINT64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_aspt_acpi_mbox_regs"]
        [::core::mem::size_of::<acpi_aspt_acpi_mbox_regs>() - 32usize];
    ["Alignment of acpi_aspt_acpi_mbox_regs"]
        [::core::mem::align_of::<acpi_aspt_acpi_mbox_regs>() - 1usize];
    ["Offset of field: acpi_aspt_acpi_mbox_regs::Header"]
        [::core::mem::offset_of!(acpi_aspt_acpi_mbox_regs, Header) - 0usize];
    ["Offset of field: acpi_aspt_acpi_mbox_regs::Reserved1"]
        [::core::mem::offset_of!(acpi_aspt_acpi_mbox_regs, Reserved1) - 4usize];
    ["Offset of field: acpi_aspt_acpi_mbox_regs::CmdRespRegAddr"]
        [::core::mem::offset_of!(acpi_aspt_acpi_mbox_regs, CmdRespRegAddr) - 8usize];
    ["Offset of field: acpi_aspt_acpi_mbox_regs::Reserved2"]
        [::core::mem::offset_of!(acpi_aspt_acpi_mbox_regs, Reserved2) - 16usize];
};
pub type ACPI_ASPT_ACPI_MBOX_REGS = acpi_aspt_acpi_mbox_regs;
#[doc = " BERT - Boot Error Record Table (ACPI 4.0)\n        Version 1\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_bert {
    pub Header: ACPI_TABLE_HEADER,
    pub RegionLength: UINT32,
    pub Address: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_bert"][::core::mem::size_of::<acpi_table_bert>() - 48usize];
    ["Alignment of acpi_table_bert"][::core::mem::align_of::<acpi_table_bert>() - 1usize];
    ["Offset of field: acpi_table_bert::Header"]
        [::core::mem::offset_of!(acpi_table_bert, Header) - 0usize];
    ["Offset of field: acpi_table_bert::RegionLength"]
        [::core::mem::offset_of!(acpi_table_bert, RegionLength) - 36usize];
    ["Offset of field: acpi_table_bert::Address"]
        [::core::mem::offset_of!(acpi_table_bert, Address) - 40usize];
};
#[doc = " BERT - Boot Error Record Table (ACPI 4.0)\n        Version 1\n"]
pub type ACPI_TABLE_BERT = acpi_table_bert;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_bert_region {
    pub BlockStatus: UINT32,
    pub RawDataOffset: UINT32,
    pub RawDataLength: UINT32,
    pub DataLength: UINT32,
    pub ErrorSeverity: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_bert_region"][::core::mem::size_of::<acpi_bert_region>() - 20usize];
    ["Alignment of acpi_bert_region"][::core::mem::align_of::<acpi_bert_region>() - 1usize];
    ["Offset of field: acpi_bert_region::BlockStatus"]
        [::core::mem::offset_of!(acpi_bert_region, BlockStatus) - 0usize];
    ["Offset of field: acpi_bert_region::RawDataOffset"]
        [::core::mem::offset_of!(acpi_bert_region, RawDataOffset) - 4usize];
    ["Offset of field: acpi_bert_region::RawDataLength"]
        [::core::mem::offset_of!(acpi_bert_region, RawDataLength) - 8usize];
    ["Offset of field: acpi_bert_region::DataLength"]
        [::core::mem::offset_of!(acpi_bert_region, DataLength) - 12usize];
    ["Offset of field: acpi_bert_region::ErrorSeverity"]
        [::core::mem::offset_of!(acpi_bert_region, ErrorSeverity) - 16usize];
};
pub type ACPI_BERT_REGION = acpi_bert_region;
pub const AcpiBertErrorSeverity_ACPI_BERT_ERROR_CORRECTABLE: AcpiBertErrorSeverity = 0;
pub const AcpiBertErrorSeverity_ACPI_BERT_ERROR_FATAL: AcpiBertErrorSeverity = 1;
pub const AcpiBertErrorSeverity_ACPI_BERT_ERROR_CORRECTED: AcpiBertErrorSeverity = 2;
pub const AcpiBertErrorSeverity_ACPI_BERT_ERROR_NONE: AcpiBertErrorSeverity = 3;
pub const AcpiBertErrorSeverity_ACPI_BERT_ERROR_RESERVED: AcpiBertErrorSeverity = 4;
pub type AcpiBertErrorSeverity = ::core::ffi::c_uint;
#[doc = " BGRT - Boot Graphics Resource Table (ACPI 5.0)\n        Version 1\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_bgrt {
    pub Header: ACPI_TABLE_HEADER,
    pub Version: UINT16,
    pub Status: UINT8,
    pub ImageType: UINT8,
    pub ImageAddress: UINT64,
    pub ImageOffsetX: UINT32,
    pub ImageOffsetY: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_bgrt"][::core::mem::size_of::<acpi_table_bgrt>() - 56usize];
    ["Alignment of acpi_table_bgrt"][::core::mem::align_of::<acpi_table_bgrt>() - 1usize];
    ["Offset of field: acpi_table_bgrt::Header"]
        [::core::mem::offset_of!(acpi_table_bgrt, Header) - 0usize];
    ["Offset of field: acpi_table_bgrt::Version"]
        [::core::mem::offset_of!(acpi_table_bgrt, Version) - 36usize];
    ["Offset of field: acpi_table_bgrt::Status"]
        [::core::mem::offset_of!(acpi_table_bgrt, Status) - 38usize];
    ["Offset of field: acpi_table_bgrt::ImageType"]
        [::core::mem::offset_of!(acpi_table_bgrt, ImageType) - 39usize];
    ["Offset of field: acpi_table_bgrt::ImageAddress"]
        [::core::mem::offset_of!(acpi_table_bgrt, ImageAddress) - 40usize];
    ["Offset of field: acpi_table_bgrt::ImageOffsetX"]
        [::core::mem::offset_of!(acpi_table_bgrt, ImageOffsetX) - 48usize];
    ["Offset of field: acpi_table_bgrt::ImageOffsetY"]
        [::core::mem::offset_of!(acpi_table_bgrt, ImageOffsetY) - 52usize];
};
#[doc = " BGRT - Boot Graphics Resource Table (ACPI 5.0)\n        Version 1\n"]
pub type ACPI_TABLE_BGRT = acpi_table_bgrt;
#[doc = " BOOT - Simple Boot Flag Table\n        Version 1\n\n Conforms to the \"Simple Boot Flag Specification\", Version 2.1\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_boot {
    pub Header: ACPI_TABLE_HEADER,
    pub CmosIndex: UINT8,
    pub Reserved: [UINT8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_boot"][::core::mem::size_of::<acpi_table_boot>() - 40usize];
    ["Alignment of acpi_table_boot"][::core::mem::align_of::<acpi_table_boot>() - 1usize];
    ["Offset of field: acpi_table_boot::Header"]
        [::core::mem::offset_of!(acpi_table_boot, Header) - 0usize];
    ["Offset of field: acpi_table_boot::CmosIndex"]
        [::core::mem::offset_of!(acpi_table_boot, CmosIndex) - 36usize];
    ["Offset of field: acpi_table_boot::Reserved"]
        [::core::mem::offset_of!(acpi_table_boot, Reserved) - 37usize];
};
#[doc = " BOOT - Simple Boot Flag Table\n        Version 1\n\n Conforms to the \"Simple Boot Flag Specification\", Version 2.1\n"]
pub type ACPI_TABLE_BOOT = acpi_table_boot;
#[doc = " CDAT - Coherent Device Attribute Table\n        Version 1\n\n Conforms to the \"Coherent Device Attribute Table (CDAT) Specification\n\" (Revision 1.01, October 2020.)\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_cdat {
    pub Length: UINT32,
    pub Revision: UINT8,
    pub Checksum: UINT8,
    pub Reserved: [UINT8; 6usize],
    pub Sequence: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_cdat"][::core::mem::size_of::<acpi_table_cdat>() - 16usize];
    ["Alignment of acpi_table_cdat"][::core::mem::align_of::<acpi_table_cdat>() - 1usize];
    ["Offset of field: acpi_table_cdat::Length"]
        [::core::mem::offset_of!(acpi_table_cdat, Length) - 0usize];
    ["Offset of field: acpi_table_cdat::Revision"]
        [::core::mem::offset_of!(acpi_table_cdat, Revision) - 4usize];
    ["Offset of field: acpi_table_cdat::Checksum"]
        [::core::mem::offset_of!(acpi_table_cdat, Checksum) - 5usize];
    ["Offset of field: acpi_table_cdat::Reserved"]
        [::core::mem::offset_of!(acpi_table_cdat, Reserved) - 6usize];
    ["Offset of field: acpi_table_cdat::Sequence"]
        [::core::mem::offset_of!(acpi_table_cdat, Sequence) - 12usize];
};
#[doc = " CDAT - Coherent Device Attribute Table\n        Version 1\n\n Conforms to the \"Coherent Device Attribute Table (CDAT) Specification\n\" (Revision 1.01, October 2020.)\n"]
pub type ACPI_TABLE_CDAT = acpi_table_cdat;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cdat_header {
    pub Type: UINT8,
    pub Reserved: UINT8,
    pub Length: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cdat_header"][::core::mem::size_of::<acpi_cdat_header>() - 4usize];
    ["Alignment of acpi_cdat_header"][::core::mem::align_of::<acpi_cdat_header>() - 1usize];
    ["Offset of field: acpi_cdat_header::Type"]
        [::core::mem::offset_of!(acpi_cdat_header, Type) - 0usize];
    ["Offset of field: acpi_cdat_header::Reserved"]
        [::core::mem::offset_of!(acpi_cdat_header, Reserved) - 1usize];
    ["Offset of field: acpi_cdat_header::Length"]
        [::core::mem::offset_of!(acpi_cdat_header, Length) - 2usize];
};
pub type ACPI_CDAT_HEADER = acpi_cdat_header;
pub const AcpiCdatType_ACPI_CDAT_TYPE_DSMAS: AcpiCdatType = 0;
pub const AcpiCdatType_ACPI_CDAT_TYPE_DSLBIS: AcpiCdatType = 1;
pub const AcpiCdatType_ACPI_CDAT_TYPE_DSMSCIS: AcpiCdatType = 2;
pub const AcpiCdatType_ACPI_CDAT_TYPE_DSIS: AcpiCdatType = 3;
pub const AcpiCdatType_ACPI_CDAT_TYPE_DSEMTS: AcpiCdatType = 4;
pub const AcpiCdatType_ACPI_CDAT_TYPE_SSLBIS: AcpiCdatType = 5;
pub const AcpiCdatType_ACPI_CDAT_TYPE_RESERVED: AcpiCdatType = 6;
pub type AcpiCdatType = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cdat_dsmas {
    pub DsmadHandle: UINT8,
    pub Flags: UINT8,
    pub Reserved: UINT16,
    pub DpaBaseAddress: UINT64,
    pub DpaLength: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cdat_dsmas"][::core::mem::size_of::<acpi_cdat_dsmas>() - 20usize];
    ["Alignment of acpi_cdat_dsmas"][::core::mem::align_of::<acpi_cdat_dsmas>() - 1usize];
    ["Offset of field: acpi_cdat_dsmas::DsmadHandle"]
        [::core::mem::offset_of!(acpi_cdat_dsmas, DsmadHandle) - 0usize];
    ["Offset of field: acpi_cdat_dsmas::Flags"]
        [::core::mem::offset_of!(acpi_cdat_dsmas, Flags) - 1usize];
    ["Offset of field: acpi_cdat_dsmas::Reserved"]
        [::core::mem::offset_of!(acpi_cdat_dsmas, Reserved) - 2usize];
    ["Offset of field: acpi_cdat_dsmas::DpaBaseAddress"]
        [::core::mem::offset_of!(acpi_cdat_dsmas, DpaBaseAddress) - 4usize];
    ["Offset of field: acpi_cdat_dsmas::DpaLength"]
        [::core::mem::offset_of!(acpi_cdat_dsmas, DpaLength) - 12usize];
};
pub type ACPI_CDAT_DSMAS = acpi_cdat_dsmas;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cdat_dslbis {
    pub Handle: UINT8,
    pub Flags: UINT8,
    pub DataType: UINT8,
    pub Reserved: UINT8,
    pub EntryBaseUnit: UINT64,
    pub Entry: [UINT16; 3usize],
    pub Reserved2: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cdat_dslbis"][::core::mem::size_of::<acpi_cdat_dslbis>() - 20usize];
    ["Alignment of acpi_cdat_dslbis"][::core::mem::align_of::<acpi_cdat_dslbis>() - 1usize];
    ["Offset of field: acpi_cdat_dslbis::Handle"]
        [::core::mem::offset_of!(acpi_cdat_dslbis, Handle) - 0usize];
    ["Offset of field: acpi_cdat_dslbis::Flags"]
        [::core::mem::offset_of!(acpi_cdat_dslbis, Flags) - 1usize];
    ["Offset of field: acpi_cdat_dslbis::DataType"]
        [::core::mem::offset_of!(acpi_cdat_dslbis, DataType) - 2usize];
    ["Offset of field: acpi_cdat_dslbis::Reserved"]
        [::core::mem::offset_of!(acpi_cdat_dslbis, Reserved) - 3usize];
    ["Offset of field: acpi_cdat_dslbis::EntryBaseUnit"]
        [::core::mem::offset_of!(acpi_cdat_dslbis, EntryBaseUnit) - 4usize];
    ["Offset of field: acpi_cdat_dslbis::Entry"]
        [::core::mem::offset_of!(acpi_cdat_dslbis, Entry) - 12usize];
    ["Offset of field: acpi_cdat_dslbis::Reserved2"]
        [::core::mem::offset_of!(acpi_cdat_dslbis, Reserved2) - 18usize];
};
pub type ACPI_CDAT_DSLBIS = acpi_cdat_dslbis;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cdat_dsmscis {
    pub DsmasHandle: UINT8,
    pub Reserved: [UINT8; 3usize],
    pub SideCacheSize: UINT64,
    pub CacheAttributes: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cdat_dsmscis"][::core::mem::size_of::<acpi_cdat_dsmscis>() - 16usize];
    ["Alignment of acpi_cdat_dsmscis"][::core::mem::align_of::<acpi_cdat_dsmscis>() - 1usize];
    ["Offset of field: acpi_cdat_dsmscis::DsmasHandle"]
        [::core::mem::offset_of!(acpi_cdat_dsmscis, DsmasHandle) - 0usize];
    ["Offset of field: acpi_cdat_dsmscis::Reserved"]
        [::core::mem::offset_of!(acpi_cdat_dsmscis, Reserved) - 1usize];
    ["Offset of field: acpi_cdat_dsmscis::SideCacheSize"]
        [::core::mem::offset_of!(acpi_cdat_dsmscis, SideCacheSize) - 4usize];
    ["Offset of field: acpi_cdat_dsmscis::CacheAttributes"]
        [::core::mem::offset_of!(acpi_cdat_dsmscis, CacheAttributes) - 12usize];
};
pub type ACPI_CDAT_DSMSCIS = acpi_cdat_dsmscis;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cdat_dsis {
    pub Flags: UINT8,
    pub Handle: UINT8,
    pub Reserved: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cdat_dsis"][::core::mem::size_of::<acpi_cdat_dsis>() - 4usize];
    ["Alignment of acpi_cdat_dsis"][::core::mem::align_of::<acpi_cdat_dsis>() - 1usize];
    ["Offset of field: acpi_cdat_dsis::Flags"]
        [::core::mem::offset_of!(acpi_cdat_dsis, Flags) - 0usize];
    ["Offset of field: acpi_cdat_dsis::Handle"]
        [::core::mem::offset_of!(acpi_cdat_dsis, Handle) - 1usize];
    ["Offset of field: acpi_cdat_dsis::Reserved"]
        [::core::mem::offset_of!(acpi_cdat_dsis, Reserved) - 2usize];
};
pub type ACPI_CDAT_DSIS = acpi_cdat_dsis;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cdat_dsemts {
    pub DsmasHandle: UINT8,
    pub MemoryType: UINT8,
    pub Reserved: UINT16,
    pub DpaOffset: UINT64,
    pub RangeLength: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cdat_dsemts"][::core::mem::size_of::<acpi_cdat_dsemts>() - 20usize];
    ["Alignment of acpi_cdat_dsemts"][::core::mem::align_of::<acpi_cdat_dsemts>() - 1usize];
    ["Offset of field: acpi_cdat_dsemts::DsmasHandle"]
        [::core::mem::offset_of!(acpi_cdat_dsemts, DsmasHandle) - 0usize];
    ["Offset of field: acpi_cdat_dsemts::MemoryType"]
        [::core::mem::offset_of!(acpi_cdat_dsemts, MemoryType) - 1usize];
    ["Offset of field: acpi_cdat_dsemts::Reserved"]
        [::core::mem::offset_of!(acpi_cdat_dsemts, Reserved) - 2usize];
    ["Offset of field: acpi_cdat_dsemts::DpaOffset"]
        [::core::mem::offset_of!(acpi_cdat_dsemts, DpaOffset) - 4usize];
    ["Offset of field: acpi_cdat_dsemts::RangeLength"]
        [::core::mem::offset_of!(acpi_cdat_dsemts, RangeLength) - 12usize];
};
pub type ACPI_CDAT_DSEMTS = acpi_cdat_dsemts;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cdat_sslbis {
    pub DataType: UINT8,
    pub Reserved: [UINT8; 3usize],
    pub EntryBaseUnit: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cdat_sslbis"][::core::mem::size_of::<acpi_cdat_sslbis>() - 12usize];
    ["Alignment of acpi_cdat_sslbis"][::core::mem::align_of::<acpi_cdat_sslbis>() - 1usize];
    ["Offset of field: acpi_cdat_sslbis::DataType"]
        [::core::mem::offset_of!(acpi_cdat_sslbis, DataType) - 0usize];
    ["Offset of field: acpi_cdat_sslbis::Reserved"]
        [::core::mem::offset_of!(acpi_cdat_sslbis, Reserved) - 1usize];
    ["Offset of field: acpi_cdat_sslbis::EntryBaseUnit"]
        [::core::mem::offset_of!(acpi_cdat_sslbis, EntryBaseUnit) - 4usize];
};
pub type ACPI_CDAT_SSLBIS = acpi_cdat_sslbis;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cdat_sslbe {
    pub PortxId: UINT16,
    pub PortyId: UINT16,
    pub LatencyOrBandwidth: UINT16,
    pub Reserved: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cdat_sslbe"][::core::mem::size_of::<acpi_cdat_sslbe>() - 8usize];
    ["Alignment of acpi_cdat_sslbe"][::core::mem::align_of::<acpi_cdat_sslbe>() - 1usize];
    ["Offset of field: acpi_cdat_sslbe::PortxId"]
        [::core::mem::offset_of!(acpi_cdat_sslbe, PortxId) - 0usize];
    ["Offset of field: acpi_cdat_sslbe::PortyId"]
        [::core::mem::offset_of!(acpi_cdat_sslbe, PortyId) - 2usize];
    ["Offset of field: acpi_cdat_sslbe::LatencyOrBandwidth"]
        [::core::mem::offset_of!(acpi_cdat_sslbe, LatencyOrBandwidth) - 4usize];
    ["Offset of field: acpi_cdat_sslbe::Reserved"]
        [::core::mem::offset_of!(acpi_cdat_sslbe, Reserved) - 6usize];
};
pub type ACPI_CDAT_SSLBE = acpi_cdat_sslbe;
#[doc = " CEDT - CXL Early Discovery Table\n        Version 1\n\n Conforms to the \"CXL Early Discovery Table\" (CXL 2.0, October 2020)\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_cedt {
    pub Header: ACPI_TABLE_HEADER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_cedt"][::core::mem::size_of::<acpi_table_cedt>() - 36usize];
    ["Alignment of acpi_table_cedt"][::core::mem::align_of::<acpi_table_cedt>() - 1usize];
    ["Offset of field: acpi_table_cedt::Header"]
        [::core::mem::offset_of!(acpi_table_cedt, Header) - 0usize];
};
#[doc = " CEDT - CXL Early Discovery Table\n        Version 1\n\n Conforms to the \"CXL Early Discovery Table\" (CXL 2.0, October 2020)\n"]
pub type ACPI_TABLE_CEDT = acpi_table_cedt;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cedt_header {
    pub Type: UINT8,
    pub Reserved: UINT8,
    pub Length: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cedt_header"][::core::mem::size_of::<acpi_cedt_header>() - 4usize];
    ["Alignment of acpi_cedt_header"][::core::mem::align_of::<acpi_cedt_header>() - 1usize];
    ["Offset of field: acpi_cedt_header::Type"]
        [::core::mem::offset_of!(acpi_cedt_header, Type) - 0usize];
    ["Offset of field: acpi_cedt_header::Reserved"]
        [::core::mem::offset_of!(acpi_cedt_header, Reserved) - 1usize];
    ["Offset of field: acpi_cedt_header::Length"]
        [::core::mem::offset_of!(acpi_cedt_header, Length) - 2usize];
};
pub type ACPI_CEDT_HEADER = acpi_cedt_header;
pub const AcpiCedtType_ACPI_CEDT_TYPE_CHBS: AcpiCedtType = 0;
pub const AcpiCedtType_ACPI_CEDT_TYPE_CFMWS: AcpiCedtType = 1;
pub const AcpiCedtType_ACPI_CEDT_TYPE_CXIMS: AcpiCedtType = 2;
pub const AcpiCedtType_ACPI_CEDT_TYPE_RDPAS: AcpiCedtType = 3;
pub const AcpiCedtType_ACPI_CEDT_TYPE_RESERVED: AcpiCedtType = 4;
pub type AcpiCedtType = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cedt_chbs {
    pub Header: ACPI_CEDT_HEADER,
    pub Uid: UINT32,
    pub CxlVersion: UINT32,
    pub Reserved: UINT32,
    pub Base: UINT64,
    pub Length: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cedt_chbs"][::core::mem::size_of::<acpi_cedt_chbs>() - 32usize];
    ["Alignment of acpi_cedt_chbs"][::core::mem::align_of::<acpi_cedt_chbs>() - 1usize];
    ["Offset of field: acpi_cedt_chbs::Header"]
        [::core::mem::offset_of!(acpi_cedt_chbs, Header) - 0usize];
    ["Offset of field: acpi_cedt_chbs::Uid"][::core::mem::offset_of!(acpi_cedt_chbs, Uid) - 4usize];
    ["Offset of field: acpi_cedt_chbs::CxlVersion"]
        [::core::mem::offset_of!(acpi_cedt_chbs, CxlVersion) - 8usize];
    ["Offset of field: acpi_cedt_chbs::Reserved"]
        [::core::mem::offset_of!(acpi_cedt_chbs, Reserved) - 12usize];
    ["Offset of field: acpi_cedt_chbs::Base"]
        [::core::mem::offset_of!(acpi_cedt_chbs, Base) - 16usize];
    ["Offset of field: acpi_cedt_chbs::Length"]
        [::core::mem::offset_of!(acpi_cedt_chbs, Length) - 24usize];
};
pub type ACPI_CEDT_CHBS = acpi_cedt_chbs;
#[repr(C, packed)]
pub struct acpi_cedt_cfmws {
    pub Header: ACPI_CEDT_HEADER,
    pub Reserved1: UINT32,
    pub BaseHpa: UINT64,
    pub WindowSize: UINT64,
    pub InterleaveWays: UINT8,
    pub InterleaveArithmetic: UINT8,
    pub Reserved2: UINT16,
    pub Granularity: UINT32,
    pub Restrictions: UINT16,
    pub QtgId: UINT16,
    pub InterleaveTargets: __IncompleteArrayField<UINT32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cedt_cfmws"][::core::mem::size_of::<acpi_cedt_cfmws>() - 36usize];
    ["Alignment of acpi_cedt_cfmws"][::core::mem::align_of::<acpi_cedt_cfmws>() - 1usize];
    ["Offset of field: acpi_cedt_cfmws::Header"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, Header) - 0usize];
    ["Offset of field: acpi_cedt_cfmws::Reserved1"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, Reserved1) - 4usize];
    ["Offset of field: acpi_cedt_cfmws::BaseHpa"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, BaseHpa) - 8usize];
    ["Offset of field: acpi_cedt_cfmws::WindowSize"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, WindowSize) - 16usize];
    ["Offset of field: acpi_cedt_cfmws::InterleaveWays"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, InterleaveWays) - 24usize];
    ["Offset of field: acpi_cedt_cfmws::InterleaveArithmetic"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, InterleaveArithmetic) - 25usize];
    ["Offset of field: acpi_cedt_cfmws::Reserved2"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, Reserved2) - 26usize];
    ["Offset of field: acpi_cedt_cfmws::Granularity"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, Granularity) - 28usize];
    ["Offset of field: acpi_cedt_cfmws::Restrictions"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, Restrictions) - 32usize];
    ["Offset of field: acpi_cedt_cfmws::QtgId"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, QtgId) - 34usize];
    ["Offset of field: acpi_cedt_cfmws::InterleaveTargets"]
        [::core::mem::offset_of!(acpi_cedt_cfmws, InterleaveTargets) - 36usize];
};
pub type ACPI_CEDT_CFMWS = acpi_cedt_cfmws;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cedt_cfmws_target_element {
    pub InterleaveTarget: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cedt_cfmws_target_element"]
        [::core::mem::size_of::<acpi_cedt_cfmws_target_element>() - 4usize];
    ["Alignment of acpi_cedt_cfmws_target_element"]
        [::core::mem::align_of::<acpi_cedt_cfmws_target_element>() - 1usize];
    ["Offset of field: acpi_cedt_cfmws_target_element::InterleaveTarget"]
        [::core::mem::offset_of!(acpi_cedt_cfmws_target_element, InterleaveTarget) - 0usize];
};
pub type ACPI_CEDT_CFMWS_TARGET_ELEMENT = acpi_cedt_cfmws_target_element;
#[repr(C, packed)]
pub struct acpi_cedt_cxims {
    pub Header: ACPI_CEDT_HEADER,
    pub Reserved1: UINT16,
    pub Hbig: UINT8,
    pub NrXormaps: UINT8,
    pub XormapList: __IncompleteArrayField<UINT64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cedt_cxims"][::core::mem::size_of::<acpi_cedt_cxims>() - 8usize];
    ["Alignment of acpi_cedt_cxims"][::core::mem::align_of::<acpi_cedt_cxims>() - 1usize];
    ["Offset of field: acpi_cedt_cxims::Header"]
        [::core::mem::offset_of!(acpi_cedt_cxims, Header) - 0usize];
    ["Offset of field: acpi_cedt_cxims::Reserved1"]
        [::core::mem::offset_of!(acpi_cedt_cxims, Reserved1) - 4usize];
    ["Offset of field: acpi_cedt_cxims::Hbig"]
        [::core::mem::offset_of!(acpi_cedt_cxims, Hbig) - 6usize];
    ["Offset of field: acpi_cedt_cxims::NrXormaps"]
        [::core::mem::offset_of!(acpi_cedt_cxims, NrXormaps) - 7usize];
    ["Offset of field: acpi_cedt_cxims::XormapList"]
        [::core::mem::offset_of!(acpi_cedt_cxims, XormapList) - 8usize];
};
pub type ACPI_CEDT_CXIMS = acpi_cedt_cxims;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cedt_cxims_target_element {
    pub Xormap: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cedt_cxims_target_element"]
        [::core::mem::size_of::<acpi_cedt_cxims_target_element>() - 8usize];
    ["Alignment of acpi_cedt_cxims_target_element"]
        [::core::mem::align_of::<acpi_cedt_cxims_target_element>() - 1usize];
    ["Offset of field: acpi_cedt_cxims_target_element::Xormap"]
        [::core::mem::offset_of!(acpi_cedt_cxims_target_element, Xormap) - 0usize];
};
pub type ACPI_CEDT_CXIMS_TARGET_ELEMENT = acpi_cedt_cxims_target_element;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cedt_rdpas {
    pub Header: ACPI_CEDT_HEADER,
    pub Segment: UINT16,
    pub Bdf: UINT16,
    pub Protocol: UINT8,
    pub Address: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cedt_rdpas"][::core::mem::size_of::<acpi_cedt_rdpas>() - 17usize];
    ["Alignment of acpi_cedt_rdpas"][::core::mem::align_of::<acpi_cedt_rdpas>() - 1usize];
    ["Offset of field: acpi_cedt_rdpas::Header"]
        [::core::mem::offset_of!(acpi_cedt_rdpas, Header) - 0usize];
    ["Offset of field: acpi_cedt_rdpas::Segment"]
        [::core::mem::offset_of!(acpi_cedt_rdpas, Segment) - 4usize];
    ["Offset of field: acpi_cedt_rdpas::Bdf"]
        [::core::mem::offset_of!(acpi_cedt_rdpas, Bdf) - 6usize];
    ["Offset of field: acpi_cedt_rdpas::Protocol"]
        [::core::mem::offset_of!(acpi_cedt_rdpas, Protocol) - 8usize];
    ["Offset of field: acpi_cedt_rdpas::Address"]
        [::core::mem::offset_of!(acpi_cedt_rdpas, Address) - 9usize];
};
#[doc = " CPEP - Corrected Platform Error Polling table (ACPI 4.0)\n        Version 1\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_cpep {
    pub Header: ACPI_TABLE_HEADER,
    pub Reserved: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_cpep"][::core::mem::size_of::<acpi_table_cpep>() - 44usize];
    ["Alignment of acpi_table_cpep"][::core::mem::align_of::<acpi_table_cpep>() - 1usize];
    ["Offset of field: acpi_table_cpep::Header"]
        [::core::mem::offset_of!(acpi_table_cpep, Header) - 0usize];
    ["Offset of field: acpi_table_cpep::Reserved"]
        [::core::mem::offset_of!(acpi_table_cpep, Reserved) - 36usize];
};
#[doc = " CPEP - Corrected Platform Error Polling table (ACPI 4.0)\n        Version 1\n"]
pub type ACPI_TABLE_CPEP = acpi_table_cpep;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_cpep_polling {
    pub Header: ACPI_SUBTABLE_HEADER,
    pub Id: UINT8,
    pub Eid: UINT8,
    pub Interval: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_cpep_polling"][::core::mem::size_of::<acpi_cpep_polling>() - 8usize];
    ["Alignment of acpi_cpep_polling"][::core::mem::align_of::<acpi_cpep_polling>() - 1usize];
    ["Offset of field: acpi_cpep_polling::Header"]
        [::core::mem::offset_of!(acpi_cpep_polling, Header) - 0usize];
    ["Offset of field: acpi_cpep_polling::Id"]
        [::core::mem::offset_of!(acpi_cpep_polling, Id) - 2usize];
    ["Offset of field: acpi_cpep_polling::Eid"]
        [::core::mem::offset_of!(acpi_cpep_polling, Eid) - 3usize];
    ["Offset of field: acpi_cpep_polling::Interval"]
        [::core::mem::offset_of!(acpi_cpep_polling, Interval) - 4usize];
};
pub type ACPI_CPEP_POLLING = acpi_cpep_polling;
#[doc = " CSRT - Core System Resource Table\n        Version 0\n\n Conforms to the \"Core System Resource Table (CSRT)\", November 14, 2011\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_csrt {
    pub Header: ACPI_TABLE_HEADER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_csrt"][::core::mem::size_of::<acpi_table_csrt>() - 36usize];
    ["Alignment of acpi_table_csrt"][::core::mem::align_of::<acpi_table_csrt>() - 1usize];
    ["Offset of field: acpi_table_csrt::Header"]
        [::core::mem::offset_of!(acpi_table_csrt, Header) - 0usize];
};
#[doc = " CSRT - Core System Resource Table\n        Version 0\n\n Conforms to the \"Core System Resource Table (CSRT)\", November 14, 2011\n"]
pub type ACPI_TABLE_CSRT = acpi_table_csrt;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_csrt_group {
    pub Length: UINT32,
    pub VendorId: UINT32,
    pub SubvendorId: UINT32,
    pub DeviceId: UINT16,
    pub SubdeviceId: UINT16,
    pub Revision: UINT16,
    pub Reserved: UINT16,
    pub SharedInfoLength: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_csrt_group"][::core::mem::size_of::<acpi_csrt_group>() - 24usize];
    ["Alignment of acpi_csrt_group"][::core::mem::align_of::<acpi_csrt_group>() - 1usize];
    ["Offset of field: acpi_csrt_group::Length"]
        [::core::mem::offset_of!(acpi_csrt_group, Length) - 0usize];
    ["Offset of field: acpi_csrt_group::VendorId"]
        [::core::mem::offset_of!(acpi_csrt_group, VendorId) - 4usize];
    ["Offset of field: acpi_csrt_group::SubvendorId"]
        [::core::mem::offset_of!(acpi_csrt_group, SubvendorId) - 8usize];
    ["Offset of field: acpi_csrt_group::DeviceId"]
        [::core::mem::offset_of!(acpi_csrt_group, DeviceId) - 12usize];
    ["Offset of field: acpi_csrt_group::SubdeviceId"]
        [::core::mem::offset_of!(acpi_csrt_group, SubdeviceId) - 14usize];
    ["Offset of field: acpi_csrt_group::Revision"]
        [::core::mem::offset_of!(acpi_csrt_group, Revision) - 16usize];
    ["Offset of field: acpi_csrt_group::Reserved"]
        [::core::mem::offset_of!(acpi_csrt_group, Reserved) - 18usize];
    ["Offset of field: acpi_csrt_group::SharedInfoLength"]
        [::core::mem::offset_of!(acpi_csrt_group, SharedInfoLength) - 20usize];
};
pub type ACPI_CSRT_GROUP = acpi_csrt_group;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_csrt_shared_info {
    pub MajorVersion: UINT16,
    pub MinorVersion: UINT16,
    pub MmioBaseLow: UINT32,
    pub MmioBaseHigh: UINT32,
    pub GsiInterrupt: UINT32,
    pub InterruptPolarity: UINT8,
    pub InterruptMode: UINT8,
    pub NumChannels: UINT8,
    pub DmaAddressWidth: UINT8,
    pub BaseRequestLine: UINT16,
    pub NumHandshakeSignals: UINT16,
    pub MaxBlockSize: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_csrt_shared_info"][::core::mem::size_of::<acpi_csrt_shared_info>() - 28usize];
    ["Alignment of acpi_csrt_shared_info"]
        [::core::mem::align_of::<acpi_csrt_shared_info>() - 1usize];
    ["Offset of field: acpi_csrt_shared_info::MajorVersion"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, MajorVersion) - 0usize];
    ["Offset of field: acpi_csrt_shared_info::MinorVersion"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, MinorVersion) - 2usize];
    ["Offset of field: acpi_csrt_shared_info::MmioBaseLow"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, MmioBaseLow) - 4usize];
    ["Offset of field: acpi_csrt_shared_info::MmioBaseHigh"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, MmioBaseHigh) - 8usize];
    ["Offset of field: acpi_csrt_shared_info::GsiInterrupt"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, GsiInterrupt) - 12usize];
    ["Offset of field: acpi_csrt_shared_info::InterruptPolarity"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, InterruptPolarity) - 16usize];
    ["Offset of field: acpi_csrt_shared_info::InterruptMode"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, InterruptMode) - 17usize];
    ["Offset of field: acpi_csrt_shared_info::NumChannels"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, NumChannels) - 18usize];
    ["Offset of field: acpi_csrt_shared_info::DmaAddressWidth"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, DmaAddressWidth) - 19usize];
    ["Offset of field: acpi_csrt_shared_info::BaseRequestLine"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, BaseRequestLine) - 20usize];
    ["Offset of field: acpi_csrt_shared_info::NumHandshakeSignals"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, NumHandshakeSignals) - 22usize];
    ["Offset of field: acpi_csrt_shared_info::MaxBlockSize"]
        [::core::mem::offset_of!(acpi_csrt_shared_info, MaxBlockSize) - 24usize];
};
pub type ACPI_CSRT_SHARED_INFO = acpi_csrt_shared_info;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_csrt_descriptor {
    pub Length: UINT32,
    pub Type: UINT16,
    pub Subtype: UINT16,
    pub Uid: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_csrt_descriptor"][::core::mem::size_of::<acpi_csrt_descriptor>() - 12usize];
    ["Alignment of acpi_csrt_descriptor"][::core::mem::align_of::<acpi_csrt_descriptor>() - 1usize];
    ["Offset of field: acpi_csrt_descriptor::Length"]
        [::core::mem::offset_of!(acpi_csrt_descriptor, Length) - 0usize];
    ["Offset of field: acpi_csrt_descriptor::Type"]
        [::core::mem::offset_of!(acpi_csrt_descriptor, Type) - 4usize];
    ["Offset of field: acpi_csrt_descriptor::Subtype"]
        [::core::mem::offset_of!(acpi_csrt_descriptor, Subtype) - 6usize];
    ["Offset of field: acpi_csrt_descriptor::Uid"]
        [::core::mem::offset_of!(acpi_csrt_descriptor, Uid) - 8usize];
};
pub type ACPI_CSRT_DESCRIPTOR = acpi_csrt_descriptor;
#[doc = " DBG2 - Debug Port Table 2\n        Version 0 (Both main table and subtables)\n\n Conforms to \"Microsoft Debug Port Table 2 (DBG2)\", September 21, 2020\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_dbg2 {
    pub Header: ACPI_TABLE_HEADER,
    pub InfoOffset: UINT32,
    pub InfoCount: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_dbg2"][::core::mem::size_of::<acpi_table_dbg2>() - 44usize];
    ["Alignment of acpi_table_dbg2"][::core::mem::align_of::<acpi_table_dbg2>() - 1usize];
    ["Offset of field: acpi_table_dbg2::Header"]
        [::core::mem::offset_of!(acpi_table_dbg2, Header) - 0usize];
    ["Offset of field: acpi_table_dbg2::InfoOffset"]
        [::core::mem::offset_of!(acpi_table_dbg2, InfoOffset) - 36usize];
    ["Offset of field: acpi_table_dbg2::InfoCount"]
        [::core::mem::offset_of!(acpi_table_dbg2, InfoCount) - 40usize];
};
#[doc = " DBG2 - Debug Port Table 2\n        Version 0 (Both main table and subtables)\n\n Conforms to \"Microsoft Debug Port Table 2 (DBG2)\", September 21, 2020\n"]
pub type ACPI_TABLE_DBG2 = acpi_table_dbg2;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dbg2_header {
    pub InfoOffset: UINT32,
    pub InfoCount: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dbg2_header"][::core::mem::size_of::<acpi_dbg2_header>() - 8usize];
    ["Alignment of acpi_dbg2_header"][::core::mem::align_of::<acpi_dbg2_header>() - 1usize];
    ["Offset of field: acpi_dbg2_header::InfoOffset"]
        [::core::mem::offset_of!(acpi_dbg2_header, InfoOffset) - 0usize];
    ["Offset of field: acpi_dbg2_header::InfoCount"]
        [::core::mem::offset_of!(acpi_dbg2_header, InfoCount) - 4usize];
};
pub type ACPI_DBG2_HEADER = acpi_dbg2_header;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dbg2_device {
    pub Revision: UINT8,
    pub Length: UINT16,
    pub RegisterCount: UINT8,
    pub NamepathLength: UINT16,
    pub NamepathOffset: UINT16,
    pub OemDataLength: UINT16,
    pub OemDataOffset: UINT16,
    pub PortType: UINT16,
    pub PortSubtype: UINT16,
    pub Reserved: UINT16,
    pub BaseAddressOffset: UINT16,
    pub AddressSizeOffset: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dbg2_device"][::core::mem::size_of::<acpi_dbg2_device>() - 22usize];
    ["Alignment of acpi_dbg2_device"][::core::mem::align_of::<acpi_dbg2_device>() - 1usize];
    ["Offset of field: acpi_dbg2_device::Revision"]
        [::core::mem::offset_of!(acpi_dbg2_device, Revision) - 0usize];
    ["Offset of field: acpi_dbg2_device::Length"]
        [::core::mem::offset_of!(acpi_dbg2_device, Length) - 1usize];
    ["Offset of field: acpi_dbg2_device::RegisterCount"]
        [::core::mem::offset_of!(acpi_dbg2_device, RegisterCount) - 3usize];
    ["Offset of field: acpi_dbg2_device::NamepathLength"]
        [::core::mem::offset_of!(acpi_dbg2_device, NamepathLength) - 4usize];
    ["Offset of field: acpi_dbg2_device::NamepathOffset"]
        [::core::mem::offset_of!(acpi_dbg2_device, NamepathOffset) - 6usize];
    ["Offset of field: acpi_dbg2_device::OemDataLength"]
        [::core::mem::offset_of!(acpi_dbg2_device, OemDataLength) - 8usize];
    ["Offset of field: acpi_dbg2_device::OemDataOffset"]
        [::core::mem::offset_of!(acpi_dbg2_device, OemDataOffset) - 10usize];
    ["Offset of field: acpi_dbg2_device::PortType"]
        [::core::mem::offset_of!(acpi_dbg2_device, PortType) - 12usize];
    ["Offset of field: acpi_dbg2_device::PortSubtype"]
        [::core::mem::offset_of!(acpi_dbg2_device, PortSubtype) - 14usize];
    ["Offset of field: acpi_dbg2_device::Reserved"]
        [::core::mem::offset_of!(acpi_dbg2_device, Reserved) - 16usize];
    ["Offset of field: acpi_dbg2_device::BaseAddressOffset"]
        [::core::mem::offset_of!(acpi_dbg2_device, BaseAddressOffset) - 18usize];
    ["Offset of field: acpi_dbg2_device::AddressSizeOffset"]
        [::core::mem::offset_of!(acpi_dbg2_device, AddressSizeOffset) - 20usize];
};
pub type ACPI_DBG2_DEVICE = acpi_dbg2_device;
#[doc = " DBGP - Debug Port table\n        Version 1\n\n Conforms to the \"Debug Port Specification\", Version 1.00, 2/9/2000\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_dbgp {
    pub Header: ACPI_TABLE_HEADER,
    pub Type: UINT8,
    pub Reserved: [UINT8; 3usize],
    pub DebugPort: ACPI_GENERIC_ADDRESS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_dbgp"][::core::mem::size_of::<acpi_table_dbgp>() - 52usize];
    ["Alignment of acpi_table_dbgp"][::core::mem::align_of::<acpi_table_dbgp>() - 1usize];
    ["Offset of field: acpi_table_dbgp::Header"]
        [::core::mem::offset_of!(acpi_table_dbgp, Header) - 0usize];
    ["Offset of field: acpi_table_dbgp::Type"]
        [::core::mem::offset_of!(acpi_table_dbgp, Type) - 36usize];
    ["Offset of field: acpi_table_dbgp::Reserved"]
        [::core::mem::offset_of!(acpi_table_dbgp, Reserved) - 37usize];
    ["Offset of field: acpi_table_dbgp::DebugPort"]
        [::core::mem::offset_of!(acpi_table_dbgp, DebugPort) - 40usize];
};
#[doc = " DBGP - Debug Port table\n        Version 1\n\n Conforms to the \"Debug Port Specification\", Version 1.00, 2/9/2000\n"]
pub type ACPI_TABLE_DBGP = acpi_table_dbgp;
#[doc = " DMAR - DMA Remapping table\n        Version 1\n\n Conforms to \"Intel Virtualization Technology for Directed I/O\",\n Version 2.3, October 2014\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_dmar {
    pub Header: ACPI_TABLE_HEADER,
    pub Width: UINT8,
    pub Flags: UINT8,
    pub Reserved: [UINT8; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_dmar"][::core::mem::size_of::<acpi_table_dmar>() - 48usize];
    ["Alignment of acpi_table_dmar"][::core::mem::align_of::<acpi_table_dmar>() - 1usize];
    ["Offset of field: acpi_table_dmar::Header"]
        [::core::mem::offset_of!(acpi_table_dmar, Header) - 0usize];
    ["Offset of field: acpi_table_dmar::Width"]
        [::core::mem::offset_of!(acpi_table_dmar, Width) - 36usize];
    ["Offset of field: acpi_table_dmar::Flags"]
        [::core::mem::offset_of!(acpi_table_dmar, Flags) - 37usize];
    ["Offset of field: acpi_table_dmar::Reserved"]
        [::core::mem::offset_of!(acpi_table_dmar, Reserved) - 38usize];
};
#[doc = " DMAR - DMA Remapping table\n        Version 1\n\n Conforms to \"Intel Virtualization Technology for Directed I/O\",\n Version 2.3, October 2014\n"]
pub type ACPI_TABLE_DMAR = acpi_table_dmar;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dmar_header {
    pub Type: UINT16,
    pub Length: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_header"][::core::mem::size_of::<acpi_dmar_header>() - 4usize];
    ["Alignment of acpi_dmar_header"][::core::mem::align_of::<acpi_dmar_header>() - 1usize];
    ["Offset of field: acpi_dmar_header::Type"]
        [::core::mem::offset_of!(acpi_dmar_header, Type) - 0usize];
    ["Offset of field: acpi_dmar_header::Length"]
        [::core::mem::offset_of!(acpi_dmar_header, Length) - 2usize];
};
pub type ACPI_DMAR_HEADER = acpi_dmar_header;
pub const AcpiDmarType_ACPI_DMAR_TYPE_HARDWARE_UNIT: AcpiDmarType = 0;
pub const AcpiDmarType_ACPI_DMAR_TYPE_RESERVED_MEMORY: AcpiDmarType = 1;
pub const AcpiDmarType_ACPI_DMAR_TYPE_ROOT_ATS: AcpiDmarType = 2;
pub const AcpiDmarType_ACPI_DMAR_TYPE_HARDWARE_AFFINITY: AcpiDmarType = 3;
pub const AcpiDmarType_ACPI_DMAR_TYPE_NAMESPACE: AcpiDmarType = 4;
pub const AcpiDmarType_ACPI_DMAR_TYPE_SATC: AcpiDmarType = 5;
pub const AcpiDmarType_ACPI_DMAR_TYPE_SIDP: AcpiDmarType = 6;
pub const AcpiDmarType_ACPI_DMAR_TYPE_RESERVED: AcpiDmarType = 7;
pub type AcpiDmarType = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dmar_device_scope {
    pub EntryType: UINT8,
    pub Length: UINT8,
    pub Flags: UINT8,
    pub Reserved: UINT8,
    pub EnumerationId: UINT8,
    pub Bus: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_device_scope"][::core::mem::size_of::<acpi_dmar_device_scope>() - 6usize];
    ["Alignment of acpi_dmar_device_scope"]
        [::core::mem::align_of::<acpi_dmar_device_scope>() - 1usize];
    ["Offset of field: acpi_dmar_device_scope::EntryType"]
        [::core::mem::offset_of!(acpi_dmar_device_scope, EntryType) - 0usize];
    ["Offset of field: acpi_dmar_device_scope::Length"]
        [::core::mem::offset_of!(acpi_dmar_device_scope, Length) - 1usize];
    ["Offset of field: acpi_dmar_device_scope::Flags"]
        [::core::mem::offset_of!(acpi_dmar_device_scope, Flags) - 2usize];
    ["Offset of field: acpi_dmar_device_scope::Reserved"]
        [::core::mem::offset_of!(acpi_dmar_device_scope, Reserved) - 3usize];
    ["Offset of field: acpi_dmar_device_scope::EnumerationId"]
        [::core::mem::offset_of!(acpi_dmar_device_scope, EnumerationId) - 4usize];
    ["Offset of field: acpi_dmar_device_scope::Bus"]
        [::core::mem::offset_of!(acpi_dmar_device_scope, Bus) - 5usize];
};
pub type ACPI_DMAR_DEVICE_SCOPE = acpi_dmar_device_scope;
pub const AcpiDmarScopeType_ACPI_DMAR_SCOPE_TYPE_NOT_USED: AcpiDmarScopeType = 0;
pub const AcpiDmarScopeType_ACPI_DMAR_SCOPE_TYPE_ENDPOINT: AcpiDmarScopeType = 1;
pub const AcpiDmarScopeType_ACPI_DMAR_SCOPE_TYPE_BRIDGE: AcpiDmarScopeType = 2;
pub const AcpiDmarScopeType_ACPI_DMAR_SCOPE_TYPE_IOAPIC: AcpiDmarScopeType = 3;
pub const AcpiDmarScopeType_ACPI_DMAR_SCOPE_TYPE_HPET: AcpiDmarScopeType = 4;
pub const AcpiDmarScopeType_ACPI_DMAR_SCOPE_TYPE_NAMESPACE: AcpiDmarScopeType = 5;
pub const AcpiDmarScopeType_ACPI_DMAR_SCOPE_TYPE_RESERVED: AcpiDmarScopeType = 6;
pub type AcpiDmarScopeType = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dmar_pci_path {
    pub Device: UINT8,
    pub Function: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_pci_path"][::core::mem::size_of::<acpi_dmar_pci_path>() - 2usize];
    ["Alignment of acpi_dmar_pci_path"][::core::mem::align_of::<acpi_dmar_pci_path>() - 1usize];
    ["Offset of field: acpi_dmar_pci_path::Device"]
        [::core::mem::offset_of!(acpi_dmar_pci_path, Device) - 0usize];
    ["Offset of field: acpi_dmar_pci_path::Function"]
        [::core::mem::offset_of!(acpi_dmar_pci_path, Function) - 1usize];
};
pub type ACPI_DMAR_PCI_PATH = acpi_dmar_pci_path;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dmar_hardware_unit {
    pub Header: ACPI_DMAR_HEADER,
    pub Flags: UINT8,
    pub Size: UINT8,
    pub Segment: UINT16,
    pub Address: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_hardware_unit"]
        [::core::mem::size_of::<acpi_dmar_hardware_unit>() - 16usize];
    ["Alignment of acpi_dmar_hardware_unit"]
        [::core::mem::align_of::<acpi_dmar_hardware_unit>() - 1usize];
    ["Offset of field: acpi_dmar_hardware_unit::Header"]
        [::core::mem::offset_of!(acpi_dmar_hardware_unit, Header) - 0usize];
    ["Offset of field: acpi_dmar_hardware_unit::Flags"]
        [::core::mem::offset_of!(acpi_dmar_hardware_unit, Flags) - 4usize];
    ["Offset of field: acpi_dmar_hardware_unit::Size"]
        [::core::mem::offset_of!(acpi_dmar_hardware_unit, Size) - 5usize];
    ["Offset of field: acpi_dmar_hardware_unit::Segment"]
        [::core::mem::offset_of!(acpi_dmar_hardware_unit, Segment) - 6usize];
    ["Offset of field: acpi_dmar_hardware_unit::Address"]
        [::core::mem::offset_of!(acpi_dmar_hardware_unit, Address) - 8usize];
};
pub type ACPI_DMAR_HARDWARE_UNIT = acpi_dmar_hardware_unit;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dmar_reserved_memory {
    pub Header: ACPI_DMAR_HEADER,
    pub Reserved: UINT16,
    pub Segment: UINT16,
    pub BaseAddress: UINT64,
    pub EndAddress: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_reserved_memory"]
        [::core::mem::size_of::<acpi_dmar_reserved_memory>() - 24usize];
    ["Alignment of acpi_dmar_reserved_memory"]
        [::core::mem::align_of::<acpi_dmar_reserved_memory>() - 1usize];
    ["Offset of field: acpi_dmar_reserved_memory::Header"]
        [::core::mem::offset_of!(acpi_dmar_reserved_memory, Header) - 0usize];
    ["Offset of field: acpi_dmar_reserved_memory::Reserved"]
        [::core::mem::offset_of!(acpi_dmar_reserved_memory, Reserved) - 4usize];
    ["Offset of field: acpi_dmar_reserved_memory::Segment"]
        [::core::mem::offset_of!(acpi_dmar_reserved_memory, Segment) - 6usize];
    ["Offset of field: acpi_dmar_reserved_memory::BaseAddress"]
        [::core::mem::offset_of!(acpi_dmar_reserved_memory, BaseAddress) - 8usize];
    ["Offset of field: acpi_dmar_reserved_memory::EndAddress"]
        [::core::mem::offset_of!(acpi_dmar_reserved_memory, EndAddress) - 16usize];
};
pub type ACPI_DMAR_RESERVED_MEMORY = acpi_dmar_reserved_memory;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dmar_atsr {
    pub Header: ACPI_DMAR_HEADER,
    pub Flags: UINT8,
    pub Reserved: UINT8,
    pub Segment: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_atsr"][::core::mem::size_of::<acpi_dmar_atsr>() - 8usize];
    ["Alignment of acpi_dmar_atsr"][::core::mem::align_of::<acpi_dmar_atsr>() - 1usize];
    ["Offset of field: acpi_dmar_atsr::Header"]
        [::core::mem::offset_of!(acpi_dmar_atsr, Header) - 0usize];
    ["Offset of field: acpi_dmar_atsr::Flags"]
        [::core::mem::offset_of!(acpi_dmar_atsr, Flags) - 4usize];
    ["Offset of field: acpi_dmar_atsr::Reserved"]
        [::core::mem::offset_of!(acpi_dmar_atsr, Reserved) - 5usize];
    ["Offset of field: acpi_dmar_atsr::Segment"]
        [::core::mem::offset_of!(acpi_dmar_atsr, Segment) - 6usize];
};
pub type ACPI_DMAR_ATSR = acpi_dmar_atsr;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dmar_rhsa {
    pub Header: ACPI_DMAR_HEADER,
    pub Reserved: UINT32,
    pub BaseAddress: UINT64,
    pub ProximityDomain: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_rhsa"][::core::mem::size_of::<acpi_dmar_rhsa>() - 20usize];
    ["Alignment of acpi_dmar_rhsa"][::core::mem::align_of::<acpi_dmar_rhsa>() - 1usize];
    ["Offset of field: acpi_dmar_rhsa::Header"]
        [::core::mem::offset_of!(acpi_dmar_rhsa, Header) - 0usize];
    ["Offset of field: acpi_dmar_rhsa::Reserved"]
        [::core::mem::offset_of!(acpi_dmar_rhsa, Reserved) - 4usize];
    ["Offset of field: acpi_dmar_rhsa::BaseAddress"]
        [::core::mem::offset_of!(acpi_dmar_rhsa, BaseAddress) - 8usize];
    ["Offset of field: acpi_dmar_rhsa::ProximityDomain"]
        [::core::mem::offset_of!(acpi_dmar_rhsa, ProximityDomain) - 16usize];
};
pub type ACPI_DMAR_RHSA = acpi_dmar_rhsa;
#[repr(C)]
pub struct acpi_dmar_andd {
    pub Header: ACPI_DMAR_HEADER,
    pub Reserved: [UINT8; 3usize],
    pub DeviceNumber: UINT8,
    pub __bindgen_anon_1: acpi_dmar_andd__bindgen_ty_1,
}
#[repr(C)]
pub struct acpi_dmar_andd__bindgen_ty_1 {
    pub __pad: __BindgenUnionField<::core::ffi::c_char>,
    pub __bindgen_anon_1: __BindgenUnionField<acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1 {
    pub __Empty_DeviceName: acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub DeviceName: __IncompleteArrayField<::core::ffi::c_char>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"][::core::mem::size_of::<
        acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    >() - 0usize];
    ["Alignment of acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"][::core::mem::align_of::<
        acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    >() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1>() - 0usize];
    ["Alignment of acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1::__Empty_DeviceName"][::core::mem::offset_of!(
        acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1,
        __Empty_DeviceName
    ) - 0usize];
    ["Offset of field: acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1::DeviceName"]
        [::core::mem::offset_of!(acpi_dmar_andd__bindgen_ty_1__bindgen_ty_1, DeviceName) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_andd__bindgen_ty_1"]
        [::core::mem::size_of::<acpi_dmar_andd__bindgen_ty_1>() - 1usize];
    ["Alignment of acpi_dmar_andd__bindgen_ty_1"]
        [::core::mem::align_of::<acpi_dmar_andd__bindgen_ty_1>() - 1usize];
    ["Offset of field: acpi_dmar_andd__bindgen_ty_1::__pad"]
        [::core::mem::offset_of!(acpi_dmar_andd__bindgen_ty_1, __pad) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_andd"][::core::mem::size_of::<acpi_dmar_andd>() - 9usize];
    ["Alignment of acpi_dmar_andd"][::core::mem::align_of::<acpi_dmar_andd>() - 1usize];
    ["Offset of field: acpi_dmar_andd::Header"]
        [::core::mem::offset_of!(acpi_dmar_andd, Header) - 0usize];
    ["Offset of field: acpi_dmar_andd::Reserved"]
        [::core::mem::offset_of!(acpi_dmar_andd, Reserved) - 4usize];
    ["Offset of field: acpi_dmar_andd::DeviceNumber"]
        [::core::mem::offset_of!(acpi_dmar_andd, DeviceNumber) - 7usize];
};
pub type ACPI_DMAR_ANDD = acpi_dmar_andd;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dmar_satc {
    pub Header: ACPI_DMAR_HEADER,
    pub Flags: UINT8,
    pub Reserved: UINT8,
    pub Segment: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_satc"][::core::mem::size_of::<acpi_dmar_satc>() - 8usize];
    ["Alignment of acpi_dmar_satc"][::core::mem::align_of::<acpi_dmar_satc>() - 1usize];
    ["Offset of field: acpi_dmar_satc::Header"]
        [::core::mem::offset_of!(acpi_dmar_satc, Header) - 0usize];
    ["Offset of field: acpi_dmar_satc::Flags"]
        [::core::mem::offset_of!(acpi_dmar_satc, Flags) - 4usize];
    ["Offset of field: acpi_dmar_satc::Reserved"]
        [::core::mem::offset_of!(acpi_dmar_satc, Reserved) - 5usize];
    ["Offset of field: acpi_dmar_satc::Segment"]
        [::core::mem::offset_of!(acpi_dmar_satc, Segment) - 6usize];
};
pub type ACPI_DMAR_SATC = acpi_dmar_satc;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_dmar_sidp {
    pub Header: ACPI_DMAR_HEADER,
    pub Reserved: UINT16,
    pub Segment: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_dmar_sidp"][::core::mem::size_of::<acpi_dmar_sidp>() - 8usize];
    ["Alignment of acpi_dmar_sidp"][::core::mem::align_of::<acpi_dmar_sidp>() - 1usize];
    ["Offset of field: acpi_dmar_sidp::Header"]
        [::core::mem::offset_of!(acpi_dmar_sidp, Header) - 0usize];
    ["Offset of field: acpi_dmar_sidp::Reserved"]
        [::core::mem::offset_of!(acpi_dmar_sidp, Reserved) - 4usize];
    ["Offset of field: acpi_dmar_sidp::Segment"]
        [::core::mem::offset_of!(acpi_dmar_sidp, Segment) - 6usize];
};
pub type ACPI_DMAR_SIDP = acpi_dmar_sidp;
#[doc = " DRTM - Dynamic Root of Trust for Measurement table\n Conforms to \"TCG D-RTM Architecture\" June 17 2013, Version 1.0.0\n Table version 1\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_drtm {
    pub Header: ACPI_TABLE_HEADER,
    pub EntryBaseAddress: UINT64,
    pub EntryLength: UINT64,
    pub EntryAddress32: UINT32,
    pub EntryAddress64: UINT64,
    pub ExitAddress: UINT64,
    pub LogAreaAddress: UINT64,
    pub LogAreaLength: UINT32,
    pub ArchDependentAddress: UINT64,
    pub Flags: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_drtm"][::core::mem::size_of::<acpi_table_drtm>() - 96usize];
    ["Alignment of acpi_table_drtm"][::core::mem::align_of::<acpi_table_drtm>() - 1usize];
    ["Offset of field: acpi_table_drtm::Header"]
        [::core::mem::offset_of!(acpi_table_drtm, Header) - 0usize];
    ["Offset of field: acpi_table_drtm::EntryBaseAddress"]
        [::core::mem::offset_of!(acpi_table_drtm, EntryBaseAddress) - 36usize];
    ["Offset of field: acpi_table_drtm::EntryLength"]
        [::core::mem::offset_of!(acpi_table_drtm, EntryLength) - 44usize];
    ["Offset of field: acpi_table_drtm::EntryAddress32"]
        [::core::mem::offset_of!(acpi_table_drtm, EntryAddress32) - 52usize];
    ["Offset of field: acpi_table_drtm::EntryAddress64"]
        [::core::mem::offset_of!(acpi_table_drtm, EntryAddress64) - 56usize];
    ["Offset of field: acpi_table_drtm::ExitAddress"]
        [::core::mem::offset_of!(acpi_table_drtm, ExitAddress) - 64usize];
    ["Offset of field: acpi_table_drtm::LogAreaAddress"]
        [::core::mem::offset_of!(acpi_table_drtm, LogAreaAddress) - 72usize];
    ["Offset of field: acpi_table_drtm::LogAreaLength"]
        [::core::mem::offset_of!(acpi_table_drtm, LogAreaLength) - 80usize];
    ["Offset of field: acpi_table_drtm::ArchDependentAddress"]
        [::core::mem::offset_of!(acpi_table_drtm, ArchDependentAddress) - 84usize];
    ["Offset of field: acpi_table_drtm::Flags"]
        [::core::mem::offset_of!(acpi_table_drtm, Flags) - 92usize];
};
#[doc = " DRTM - Dynamic Root of Trust for Measurement table\n Conforms to \"TCG D-RTM Architecture\" June 17 2013, Version 1.0.0\n Table version 1\n"]
pub type ACPI_TABLE_DRTM = acpi_table_drtm;
#[repr(C, packed)]
pub struct acpi_drtm_vtable_list {
    pub ValidatedTableCount: UINT32,
    pub ValidatedTables: __IncompleteArrayField<UINT64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_drtm_vtable_list"][::core::mem::size_of::<acpi_drtm_vtable_list>() - 4usize];
    ["Alignment of acpi_drtm_vtable_list"]
        [::core::mem::align_of::<acpi_drtm_vtable_list>() - 1usize];
    ["Offset of field: acpi_drtm_vtable_list::ValidatedTableCount"]
        [::core::mem::offset_of!(acpi_drtm_vtable_list, ValidatedTableCount) - 0usize];
    ["Offset of field: acpi_drtm_vtable_list::ValidatedTables"]
        [::core::mem::offset_of!(acpi_drtm_vtable_list, ValidatedTables) - 4usize];
};
pub type ACPI_DRTM_VTABLE_LIST = acpi_drtm_vtable_list;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_drtm_resource {
    pub Size: [UINT8; 7usize],
    pub Type: UINT8,
    pub Address: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_drtm_resource"][::core::mem::size_of::<acpi_drtm_resource>() - 16usize];
    ["Alignment of acpi_drtm_resource"][::core::mem::align_of::<acpi_drtm_resource>() - 1usize];
    ["Offset of field: acpi_drtm_resource::Size"]
        [::core::mem::offset_of!(acpi_drtm_resource, Size) - 0usize];
    ["Offset of field: acpi_drtm_resource::Type"]
        [::core::mem::offset_of!(acpi_drtm_resource, Type) - 7usize];
    ["Offset of field: acpi_drtm_resource::Address"]
        [::core::mem::offset_of!(acpi_drtm_resource, Address) - 8usize];
};
pub type ACPI_DRTM_RESOURCE = acpi_drtm_resource;
#[repr(C, packed)]
pub struct acpi_drtm_resource_list {
    pub ResourceCount: UINT32,
    pub Resources: __IncompleteArrayField<ACPI_DRTM_RESOURCE>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_drtm_resource_list"][::core::mem::size_of::<acpi_drtm_resource_list>() - 4usize];
    ["Alignment of acpi_drtm_resource_list"]
        [::core::mem::align_of::<acpi_drtm_resource_list>() - 1usize];
    ["Offset of field: acpi_drtm_resource_list::ResourceCount"]
        [::core::mem::offset_of!(acpi_drtm_resource_list, ResourceCount) - 0usize];
    ["Offset of field: acpi_drtm_resource_list::Resources"]
        [::core::mem::offset_of!(acpi_drtm_resource_list, Resources) - 4usize];
};
pub type ACPI_DRTM_RESOURCE_LIST = acpi_drtm_resource_list;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_drtm_dps_id {
    pub DpsIdLength: UINT32,
    pub DpsId: [UINT8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_drtm_dps_id"][::core::mem::size_of::<acpi_drtm_dps_id>() - 20usize];
    ["Alignment of acpi_drtm_dps_id"][::core::mem::align_of::<acpi_drtm_dps_id>() - 1usize];
    ["Offset of field: acpi_drtm_dps_id::DpsIdLength"]
        [::core::mem::offset_of!(acpi_drtm_dps_id, DpsIdLength) - 0usize];
    ["Offset of field: acpi_drtm_dps_id::DpsId"]
        [::core::mem::offset_of!(acpi_drtm_dps_id, DpsId) - 4usize];
};
pub type ACPI_DRTM_DPS_ID = acpi_drtm_dps_id;
#[doc = " ECDT - Embedded Controller Boot Resources Table\n        Version 1\n"]
#[repr(C, packed)]
pub struct acpi_table_ecdt {
    pub Header: ACPI_TABLE_HEADER,
    pub Control: ACPI_GENERIC_ADDRESS,
    pub Data: ACPI_GENERIC_ADDRESS,
    pub Uid: UINT32,
    pub Gpe: UINT8,
    pub Id: __IncompleteArrayField<UINT8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_ecdt"][::core::mem::size_of::<acpi_table_ecdt>() - 65usize];
    ["Alignment of acpi_table_ecdt"][::core::mem::align_of::<acpi_table_ecdt>() - 1usize];
    ["Offset of field: acpi_table_ecdt::Header"]
        [::core::mem::offset_of!(acpi_table_ecdt, Header) - 0usize];
    ["Offset of field: acpi_table_ecdt::Control"]
        [::core::mem::offset_of!(acpi_table_ecdt, Control) - 36usize];
    ["Offset of field: acpi_table_ecdt::Data"]
        [::core::mem::offset_of!(acpi_table_ecdt, Data) - 48usize];
    ["Offset of field: acpi_table_ecdt::Uid"]
        [::core::mem::offset_of!(acpi_table_ecdt, Uid) - 60usize];
    ["Offset of field: acpi_table_ecdt::Gpe"]
        [::core::mem::offset_of!(acpi_table_ecdt, Gpe) - 64usize];
    ["Offset of field: acpi_table_ecdt::Id"]
        [::core::mem::offset_of!(acpi_table_ecdt, Id) - 65usize];
};
#[doc = " ECDT - Embedded Controller Boot Resources Table\n        Version 1\n"]
pub type ACPI_TABLE_ECDT = acpi_table_ecdt;
#[doc = " EINJ - Error Injection Table (ACPI 4.0)\n        Version 1\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_einj {
    pub Header: ACPI_TABLE_HEADER,
    pub HeaderLength: UINT32,
    pub Flags: UINT8,
    pub Reserved: [UINT8; 3usize],
    pub Entries: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_einj"][::core::mem::size_of::<acpi_table_einj>() - 48usize];
    ["Alignment of acpi_table_einj"][::core::mem::align_of::<acpi_table_einj>() - 1usize];
    ["Offset of field: acpi_table_einj::Header"]
        [::core::mem::offset_of!(acpi_table_einj, Header) - 0usize];
    ["Offset of field: acpi_table_einj::HeaderLength"]
        [::core::mem::offset_of!(acpi_table_einj, HeaderLength) - 36usize];
    ["Offset of field: acpi_table_einj::Flags"]
        [::core::mem::offset_of!(acpi_table_einj, Flags) - 40usize];
    ["Offset of field: acpi_table_einj::Reserved"]
        [::core::mem::offset_of!(acpi_table_einj, Reserved) - 41usize];
    ["Offset of field: acpi_table_einj::Entries"]
        [::core::mem::offset_of!(acpi_table_einj, Entries) - 44usize];
};
#[doc = " EINJ - Error Injection Table (ACPI 4.0)\n        Version 1\n"]
pub type ACPI_TABLE_EINJ = acpi_table_einj;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_einj_entry {
    pub WheaHeader: ACPI_WHEA_HEADER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_einj_entry"][::core::mem::size_of::<acpi_einj_entry>() - 32usize];
    ["Alignment of acpi_einj_entry"][::core::mem::align_of::<acpi_einj_entry>() - 1usize];
    ["Offset of field: acpi_einj_entry::WheaHeader"]
        [::core::mem::offset_of!(acpi_einj_entry, WheaHeader) - 0usize];
};
pub type ACPI_EINJ_ENTRY = acpi_einj_entry;
pub const AcpiEinjActions_ACPI_EINJ_BEGIN_OPERATION: AcpiEinjActions = 0;
pub const AcpiEinjActions_ACPI_EINJ_GET_TRIGGER_TABLE: AcpiEinjActions = 1;
pub const AcpiEinjActions_ACPI_EINJ_SET_ERROR_TYPE: AcpiEinjActions = 2;
pub const AcpiEinjActions_ACPI_EINJ_GET_ERROR_TYPE: AcpiEinjActions = 3;
pub const AcpiEinjActions_ACPI_EINJ_END_OPERATION: AcpiEinjActions = 4;
pub const AcpiEinjActions_ACPI_EINJ_EXECUTE_OPERATION: AcpiEinjActions = 5;
pub const AcpiEinjActions_ACPI_EINJ_CHECK_BUSY_STATUS: AcpiEinjActions = 6;
pub const AcpiEinjActions_ACPI_EINJ_GET_COMMAND_STATUS: AcpiEinjActions = 7;
pub const AcpiEinjActions_ACPI_EINJ_SET_ERROR_TYPE_WITH_ADDRESS: AcpiEinjActions = 8;
pub const AcpiEinjActions_ACPI_EINJ_GET_EXECUTE_TIMINGS: AcpiEinjActions = 9;
pub const AcpiEinjActions_ACPI_EINJV2_GET_ERROR_TYPE: AcpiEinjActions = 17;
pub const AcpiEinjActions_ACPI_EINJ_ACTION_RESERVED: AcpiEinjActions = 18;
pub const AcpiEinjActions_ACPI_EINJ_TRIGGER_ERROR: AcpiEinjActions = 255;
pub type AcpiEinjActions = ::core::ffi::c_uint;
pub const AcpiEinjInstructions_ACPI_EINJ_READ_REGISTER: AcpiEinjInstructions = 0;
pub const AcpiEinjInstructions_ACPI_EINJ_READ_REGISTER_VALUE: AcpiEinjInstructions = 1;
pub const AcpiEinjInstructions_ACPI_EINJ_WRITE_REGISTER: AcpiEinjInstructions = 2;
pub const AcpiEinjInstructions_ACPI_EINJ_WRITE_REGISTER_VALUE: AcpiEinjInstructions = 3;
pub const AcpiEinjInstructions_ACPI_EINJ_NOOP: AcpiEinjInstructions = 4;
pub const AcpiEinjInstructions_ACPI_EINJ_FLUSH_CACHELINE: AcpiEinjInstructions = 5;
pub const AcpiEinjInstructions_ACPI_EINJ_INSTRUCTION_RESERVED: AcpiEinjInstructions = 6;
pub type AcpiEinjInstructions = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_einj_error_type_with_addr {
    pub ErrorType: UINT32,
    pub VendorStructOffset: UINT32,
    pub Flags: UINT32,
    pub ApicId: UINT32,
    pub Address: UINT64,
    pub Range: UINT64,
    pub PcieId: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_einj_error_type_with_addr"]
        [::core::mem::size_of::<acpi_einj_error_type_with_addr>() - 36usize];
    ["Alignment of acpi_einj_error_type_with_addr"]
        [::core::mem::align_of::<acpi_einj_error_type_with_addr>() - 1usize];
    ["Offset of field: acpi_einj_error_type_with_addr::ErrorType"]
        [::core::mem::offset_of!(acpi_einj_error_type_with_addr, ErrorType) - 0usize];
    ["Offset of field: acpi_einj_error_type_with_addr::VendorStructOffset"]
        [::core::mem::offset_of!(acpi_einj_error_type_with_addr, VendorStructOffset) - 4usize];
    ["Offset of field: acpi_einj_error_type_with_addr::Flags"]
        [::core::mem::offset_of!(acpi_einj_error_type_with_addr, Flags) - 8usize];
    ["Offset of field: acpi_einj_error_type_with_addr::ApicId"]
        [::core::mem::offset_of!(acpi_einj_error_type_with_addr, ApicId) - 12usize];
    ["Offset of field: acpi_einj_error_type_with_addr::Address"]
        [::core::mem::offset_of!(acpi_einj_error_type_with_addr, Address) - 16usize];
    ["Offset of field: acpi_einj_error_type_with_addr::Range"]
        [::core::mem::offset_of!(acpi_einj_error_type_with_addr, Range) - 24usize];
    ["Offset of field: acpi_einj_error_type_with_addr::PcieId"]
        [::core::mem::offset_of!(acpi_einj_error_type_with_addr, PcieId) - 32usize];
};
pub type ACPI_EINJ_ERROR_TYPE_WITH_ADDR = acpi_einj_error_type_with_addr;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_einj_vendor {
    pub Length: UINT32,
    pub PcieId: UINT32,
    pub VendorId: UINT16,
    pub DeviceId: UINT16,
    pub RevisionId: UINT8,
    pub Reserved: [UINT8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_einj_vendor"][::core::mem::size_of::<acpi_einj_vendor>() - 16usize];
    ["Alignment of acpi_einj_vendor"][::core::mem::align_of::<acpi_einj_vendor>() - 1usize];
    ["Offset of field: acpi_einj_vendor::Length"]
        [::core::mem::offset_of!(acpi_einj_vendor, Length) - 0usize];
    ["Offset of field: acpi_einj_vendor::PcieId"]
        [::core::mem::offset_of!(acpi_einj_vendor, PcieId) - 4usize];
    ["Offset of field: acpi_einj_vendor::VendorId"]
        [::core::mem::offset_of!(acpi_einj_vendor, VendorId) - 8usize];
    ["Offset of field: acpi_einj_vendor::DeviceId"]
        [::core::mem::offset_of!(acpi_einj_vendor, DeviceId) - 10usize];
    ["Offset of field: acpi_einj_vendor::RevisionId"]
        [::core::mem::offset_of!(acpi_einj_vendor, RevisionId) - 12usize];
    ["Offset of field: acpi_einj_vendor::Reserved"]
        [::core::mem::offset_of!(acpi_einj_vendor, Reserved) - 13usize];
};
pub type ACPI_EINJ_VENDOR = acpi_einj_vendor;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_einj_trigger {
    pub HeaderSize: UINT32,
    pub Revision: UINT32,
    pub TableSize: UINT32,
    pub EntryCount: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_einj_trigger"][::core::mem::size_of::<acpi_einj_trigger>() - 16usize];
    ["Alignment of acpi_einj_trigger"][::core::mem::align_of::<acpi_einj_trigger>() - 1usize];
    ["Offset of field: acpi_einj_trigger::HeaderSize"]
        [::core::mem::offset_of!(acpi_einj_trigger, HeaderSize) - 0usize];
    ["Offset of field: acpi_einj_trigger::Revision"]
        [::core::mem::offset_of!(acpi_einj_trigger, Revision) - 4usize];
    ["Offset of field: acpi_einj_trigger::TableSize"]
        [::core::mem::offset_of!(acpi_einj_trigger, TableSize) - 8usize];
    ["Offset of field: acpi_einj_trigger::EntryCount"]
        [::core::mem::offset_of!(acpi_einj_trigger, EntryCount) - 12usize];
};
pub type ACPI_EINJ_TRIGGER = acpi_einj_trigger;
pub const AcpiEinjCommandStatus_ACPI_EINJ_SUCCESS: AcpiEinjCommandStatus = 0;
pub const AcpiEinjCommandStatus_ACPI_EINJ_FAILURE: AcpiEinjCommandStatus = 1;
pub const AcpiEinjCommandStatus_ACPI_EINJ_INVALID_ACCESS: AcpiEinjCommandStatus = 2;
pub const AcpiEinjCommandStatus_ACPI_EINJ_STATUS_RESERVED: AcpiEinjCommandStatus = 3;
pub type AcpiEinjCommandStatus = ::core::ffi::c_uint;
#[doc = " ERST - Error Record Serialization Table (ACPI 4.0)\n        Version 1\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_erst {
    pub Header: ACPI_TABLE_HEADER,
    pub HeaderLength: UINT32,
    pub Reserved: UINT32,
    pub Entries: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_erst"][::core::mem::size_of::<acpi_table_erst>() - 48usize];
    ["Alignment of acpi_table_erst"][::core::mem::align_of::<acpi_table_erst>() - 1usize];
    ["Offset of field: acpi_table_erst::Header"]
        [::core::mem::offset_of!(acpi_table_erst, Header) - 0usize];
    ["Offset of field: acpi_table_erst::HeaderLength"]
        [::core::mem::offset_of!(acpi_table_erst, HeaderLength) - 36usize];
    ["Offset of field: acpi_table_erst::Reserved"]
        [::core::mem::offset_of!(acpi_table_erst, Reserved) - 40usize];
    ["Offset of field: acpi_table_erst::Entries"]
        [::core::mem::offset_of!(acpi_table_erst, Entries) - 44usize];
};
#[doc = " ERST - Error Record Serialization Table (ACPI 4.0)\n        Version 1\n"]
pub type ACPI_TABLE_ERST = acpi_table_erst;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_erst_entry {
    pub WheaHeader: ACPI_WHEA_HEADER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_erst_entry"][::core::mem::size_of::<acpi_erst_entry>() - 32usize];
    ["Alignment of acpi_erst_entry"][::core::mem::align_of::<acpi_erst_entry>() - 1usize];
    ["Offset of field: acpi_erst_entry::WheaHeader"]
        [::core::mem::offset_of!(acpi_erst_entry, WheaHeader) - 0usize];
};
pub type ACPI_ERST_ENTRY = acpi_erst_entry;
pub const AcpiErstActions_ACPI_ERST_BEGIN_WRITE: AcpiErstActions = 0;
pub const AcpiErstActions_ACPI_ERST_BEGIN_READ: AcpiErstActions = 1;
pub const AcpiErstActions_ACPI_ERST_BEGIN_CLEAR: AcpiErstActions = 2;
pub const AcpiErstActions_ACPI_ERST_END: AcpiErstActions = 3;
pub const AcpiErstActions_ACPI_ERST_SET_RECORD_OFFSET: AcpiErstActions = 4;
pub const AcpiErstActions_ACPI_ERST_EXECUTE_OPERATION: AcpiErstActions = 5;
pub const AcpiErstActions_ACPI_ERST_CHECK_BUSY_STATUS: AcpiErstActions = 6;
pub const AcpiErstActions_ACPI_ERST_GET_COMMAND_STATUS: AcpiErstActions = 7;
pub const AcpiErstActions_ACPI_ERST_GET_RECORD_ID: AcpiErstActions = 8;
pub const AcpiErstActions_ACPI_ERST_SET_RECORD_ID: AcpiErstActions = 9;
pub const AcpiErstActions_ACPI_ERST_GET_RECORD_COUNT: AcpiErstActions = 10;
pub const AcpiErstActions_ACPI_ERST_BEGIN_DUMMY_WRIITE: AcpiErstActions = 11;
pub const AcpiErstActions_ACPI_ERST_NOT_USED: AcpiErstActions = 12;
pub const AcpiErstActions_ACPI_ERST_GET_ERROR_RANGE: AcpiErstActions = 13;
pub const AcpiErstActions_ACPI_ERST_GET_ERROR_LENGTH: AcpiErstActions = 14;
pub const AcpiErstActions_ACPI_ERST_GET_ERROR_ATTRIBUTES: AcpiErstActions = 15;
pub const AcpiErstActions_ACPI_ERST_EXECUTE_TIMINGS: AcpiErstActions = 16;
pub const AcpiErstActions_ACPI_ERST_ACTION_RESERVED: AcpiErstActions = 17;
pub type AcpiErstActions = ::core::ffi::c_uint;
pub const AcpiErstInstructions_ACPI_ERST_READ_REGISTER: AcpiErstInstructions = 0;
pub const AcpiErstInstructions_ACPI_ERST_READ_REGISTER_VALUE: AcpiErstInstructions = 1;
pub const AcpiErstInstructions_ACPI_ERST_WRITE_REGISTER: AcpiErstInstructions = 2;
pub const AcpiErstInstructions_ACPI_ERST_WRITE_REGISTER_VALUE: AcpiErstInstructions = 3;
pub const AcpiErstInstructions_ACPI_ERST_NOOP: AcpiErstInstructions = 4;
pub const AcpiErstInstructions_ACPI_ERST_LOAD_VAR1: AcpiErstInstructions = 5;
pub const AcpiErstInstructions_ACPI_ERST_LOAD_VAR2: AcpiErstInstructions = 6;
pub const AcpiErstInstructions_ACPI_ERST_STORE_VAR1: AcpiErstInstructions = 7;
pub const AcpiErstInstructions_ACPI_ERST_ADD: AcpiErstInstructions = 8;
pub const AcpiErstInstructions_ACPI_ERST_SUBTRACT: AcpiErstInstructions = 9;
pub const AcpiErstInstructions_ACPI_ERST_ADD_VALUE: AcpiErstInstructions = 10;
pub const AcpiErstInstructions_ACPI_ERST_SUBTRACT_VALUE: AcpiErstInstructions = 11;
pub const AcpiErstInstructions_ACPI_ERST_STALL: AcpiErstInstructions = 12;
pub const AcpiErstInstructions_ACPI_ERST_STALL_WHILE_TRUE: AcpiErstInstructions = 13;
pub const AcpiErstInstructions_ACPI_ERST_SKIP_NEXT_IF_TRUE: AcpiErstInstructions = 14;
pub const AcpiErstInstructions_ACPI_ERST_GOTO: AcpiErstInstructions = 15;
pub const AcpiErstInstructions_ACPI_ERST_SET_SRC_ADDRESS_BASE: AcpiErstInstructions = 16;
pub const AcpiErstInstructions_ACPI_ERST_SET_DST_ADDRESS_BASE: AcpiErstInstructions = 17;
pub const AcpiErstInstructions_ACPI_ERST_MOVE_DATA: AcpiErstInstructions = 18;
pub const AcpiErstInstructions_ACPI_ERST_INSTRUCTION_RESERVED: AcpiErstInstructions = 19;
pub type AcpiErstInstructions = ::core::ffi::c_uint;
pub const AcpiErstCommandStatus_ACPI_ERST_SUCCESS: AcpiErstCommandStatus = 0;
pub const AcpiErstCommandStatus_ACPI_ERST_NO_SPACE: AcpiErstCommandStatus = 1;
pub const AcpiErstCommandStatus_ACPI_ERST_NOT_AVAILABLE: AcpiErstCommandStatus = 2;
pub const AcpiErstCommandStatus_ACPI_ERST_FAILURE: AcpiErstCommandStatus = 3;
pub const AcpiErstCommandStatus_ACPI_ERST_RECORD_EMPTY: AcpiErstCommandStatus = 4;
pub const AcpiErstCommandStatus_ACPI_ERST_NOT_FOUND: AcpiErstCommandStatus = 5;
pub const AcpiErstCommandStatus_ACPI_ERST_STATUS_RESERVED: AcpiErstCommandStatus = 6;
pub type AcpiErstCommandStatus = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_erst_info {
    pub Signature: UINT16,
    pub Data: [UINT8; 48usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_erst_info"][::core::mem::size_of::<acpi_erst_info>() - 50usize];
    ["Alignment of acpi_erst_info"][::core::mem::align_of::<acpi_erst_info>() - 1usize];
    ["Offset of field: acpi_erst_info::Signature"]
        [::core::mem::offset_of!(acpi_erst_info, Signature) - 0usize];
    ["Offset of field: acpi_erst_info::Data"]
        [::core::mem::offset_of!(acpi_erst_info, Data) - 2usize];
};
pub type ACPI_ERST_INFO = acpi_erst_info;
#[doc = " FPDT - Firmware Performance Data Table (ACPI 5.0)\n        Version 1\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_fpdt {
    pub Header: ACPI_TABLE_HEADER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_fpdt"][::core::mem::size_of::<acpi_table_fpdt>() - 36usize];
    ["Alignment of acpi_table_fpdt"][::core::mem::align_of::<acpi_table_fpdt>() - 1usize];
    ["Offset of field: acpi_table_fpdt::Header"]
        [::core::mem::offset_of!(acpi_table_fpdt, Header) - 0usize];
};
#[doc = " FPDT - Firmware Performance Data Table (ACPI 5.0)\n        Version 1\n"]
pub type ACPI_TABLE_FPDT = acpi_table_fpdt;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_fpdt_header {
    pub Type: UINT16,
    pub Length: UINT8,
    pub Revision: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_fpdt_header"][::core::mem::size_of::<acpi_fpdt_header>() - 4usize];
    ["Alignment of acpi_fpdt_header"][::core::mem::align_of::<acpi_fpdt_header>() - 1usize];
    ["Offset of field: acpi_fpdt_header::Type"]
        [::core::mem::offset_of!(acpi_fpdt_header, Type) - 0usize];
    ["Offset of field: acpi_fpdt_header::Length"]
        [::core::mem::offset_of!(acpi_fpdt_header, Length) - 2usize];
    ["Offset of field: acpi_fpdt_header::Revision"]
        [::core::mem::offset_of!(acpi_fpdt_header, Revision) - 3usize];
};
pub type ACPI_FPDT_HEADER = acpi_fpdt_header;
pub const AcpiFpdtType_ACPI_FPDT_TYPE_BOOT: AcpiFpdtType = 0;
pub const AcpiFpdtType_ACPI_FPDT_TYPE_S3PERF: AcpiFpdtType = 1;
pub type AcpiFpdtType = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_fpdt_boot_pointer {
    pub Header: ACPI_FPDT_HEADER,
    pub Reserved: [UINT8; 4usize],
    pub Address: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_fpdt_boot_pointer"][::core::mem::size_of::<acpi_fpdt_boot_pointer>() - 16usize];
    ["Alignment of acpi_fpdt_boot_pointer"]
        [::core::mem::align_of::<acpi_fpdt_boot_pointer>() - 1usize];
    ["Offset of field: acpi_fpdt_boot_pointer::Header"]
        [::core::mem::offset_of!(acpi_fpdt_boot_pointer, Header) - 0usize];
    ["Offset of field: acpi_fpdt_boot_pointer::Reserved"]
        [::core::mem::offset_of!(acpi_fpdt_boot_pointer, Reserved) - 4usize];
    ["Offset of field: acpi_fpdt_boot_pointer::Address"]
        [::core::mem::offset_of!(acpi_fpdt_boot_pointer, Address) - 8usize];
};
pub type ACPI_FPDT_BOOT_POINTER = acpi_fpdt_boot_pointer;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_fpdt_s3pt_pointer {
    pub Header: ACPI_FPDT_HEADER,
    pub Reserved: [UINT8; 4usize],
    pub Address: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_fpdt_s3pt_pointer"][::core::mem::size_of::<acpi_fpdt_s3pt_pointer>() - 16usize];
    ["Alignment of acpi_fpdt_s3pt_pointer"]
        [::core::mem::align_of::<acpi_fpdt_s3pt_pointer>() - 1usize];
    ["Offset of field: acpi_fpdt_s3pt_pointer::Header"]
        [::core::mem::offset_of!(acpi_fpdt_s3pt_pointer, Header) - 0usize];
    ["Offset of field: acpi_fpdt_s3pt_pointer::Reserved"]
        [::core::mem::offset_of!(acpi_fpdt_s3pt_pointer, Reserved) - 4usize];
    ["Offset of field: acpi_fpdt_s3pt_pointer::Address"]
        [::core::mem::offset_of!(acpi_fpdt_s3pt_pointer, Address) - 8usize];
};
pub type ACPI_FPDT_S3PT_POINTER = acpi_fpdt_s3pt_pointer;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_s3pt {
    pub Signature: [UINT8; 4usize],
    pub Length: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_s3pt"][::core::mem::size_of::<acpi_table_s3pt>() - 8usize];
    ["Alignment of acpi_table_s3pt"][::core::mem::align_of::<acpi_table_s3pt>() - 1usize];
    ["Offset of field: acpi_table_s3pt::Signature"]
        [::core::mem::offset_of!(acpi_table_s3pt, Signature) - 0usize];
    ["Offset of field: acpi_table_s3pt::Length"]
        [::core::mem::offset_of!(acpi_table_s3pt, Length) - 4usize];
};
pub type ACPI_TABLE_S3PT = acpi_table_s3pt;
pub const AcpiS3ptType_ACPI_S3PT_TYPE_RESUME: AcpiS3ptType = 0;
pub const AcpiS3ptType_ACPI_S3PT_TYPE_SUSPEND: AcpiS3ptType = 1;
pub const AcpiS3ptType_ACPI_FPDT_BOOT_PERFORMANCE: AcpiS3ptType = 2;
pub type AcpiS3ptType = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_s3pt_resume {
    pub Header: ACPI_FPDT_HEADER,
    pub ResumeCount: UINT32,
    pub FullResume: UINT64,
    pub AverageResume: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_s3pt_resume"][::core::mem::size_of::<acpi_s3pt_resume>() - 24usize];
    ["Alignment of acpi_s3pt_resume"][::core::mem::align_of::<acpi_s3pt_resume>() - 1usize];
    ["Offset of field: acpi_s3pt_resume::Header"]
        [::core::mem::offset_of!(acpi_s3pt_resume, Header) - 0usize];
    ["Offset of field: acpi_s3pt_resume::ResumeCount"]
        [::core::mem::offset_of!(acpi_s3pt_resume, ResumeCount) - 4usize];
    ["Offset of field: acpi_s3pt_resume::FullResume"]
        [::core::mem::offset_of!(acpi_s3pt_resume, FullResume) - 8usize];
    ["Offset of field: acpi_s3pt_resume::AverageResume"]
        [::core::mem::offset_of!(acpi_s3pt_resume, AverageResume) - 16usize];
};
pub type ACPI_S3PT_RESUME = acpi_s3pt_resume;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_s3pt_suspend {
    pub Header: ACPI_FPDT_HEADER,
    pub SuspendStart: UINT64,
    pub SuspendEnd: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_s3pt_suspend"][::core::mem::size_of::<acpi_s3pt_suspend>() - 20usize];
    ["Alignment of acpi_s3pt_suspend"][::core::mem::align_of::<acpi_s3pt_suspend>() - 1usize];
    ["Offset of field: acpi_s3pt_suspend::Header"]
        [::core::mem::offset_of!(acpi_s3pt_suspend, Header) - 0usize];
    ["Offset of field: acpi_s3pt_suspend::SuspendStart"]
        [::core::mem::offset_of!(acpi_s3pt_suspend, SuspendStart) - 4usize];
    ["Offset of field: acpi_s3pt_suspend::SuspendEnd"]
        [::core::mem::offset_of!(acpi_s3pt_suspend, SuspendEnd) - 12usize];
};
pub type ACPI_S3PT_SUSPEND = acpi_s3pt_suspend;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_fpdt_boot {
    pub Header: ACPI_FPDT_HEADER,
    pub Reserved: [UINT8; 4usize],
    pub ResetEnd: UINT64,
    pub LoadStart: UINT64,
    pub StartupStart: UINT64,
    pub ExitServicesEntry: UINT64,
    pub ExitServicesExit: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_fpdt_boot"][::core::mem::size_of::<acpi_fpdt_boot>() - 48usize];
    ["Alignment of acpi_fpdt_boot"][::core::mem::align_of::<acpi_fpdt_boot>() - 1usize];
    ["Offset of field: acpi_fpdt_boot::Header"]
        [::core::mem::offset_of!(acpi_fpdt_boot, Header) - 0usize];
    ["Offset of field: acpi_fpdt_boot::Reserved"]
        [::core::mem::offset_of!(acpi_fpdt_boot, Reserved) - 4usize];
    ["Offset of field: acpi_fpdt_boot::ResetEnd"]
        [::core::mem::offset_of!(acpi_fpdt_boot, ResetEnd) - 8usize];
    ["Offset of field: acpi_fpdt_boot::LoadStart"]
        [::core::mem::offset_of!(acpi_fpdt_boot, LoadStart) - 16usize];
    ["Offset of field: acpi_fpdt_boot::StartupStart"]
        [::core::mem::offset_of!(acpi_fpdt_boot, StartupStart) - 24usize];
    ["Offset of field: acpi_fpdt_boot::ExitServicesEntry"]
        [::core::mem::offset_of!(acpi_fpdt_boot, ExitServicesEntry) - 32usize];
    ["Offset of field: acpi_fpdt_boot::ExitServicesExit"]
        [::core::mem::offset_of!(acpi_fpdt_boot, ExitServicesExit) - 40usize];
};
pub type ACPI_FPDT_BOOT = acpi_fpdt_boot;
#[doc = " GTDT - Generic Timer Description Table (ACPI 5.1)\n        Version 2\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_gtdt {
    pub Header: ACPI_TABLE_HEADER,
    pub CounterBlockAddresss: UINT64,
    pub Reserved: UINT32,
    pub SecureEl1Interrupt: UINT32,
    pub SecureEl1Flags: UINT32,
    pub NonSecureEl1Interrupt: UINT32,
    pub NonSecureEl1Flags: UINT32,
    pub VirtualTimerInterrupt: UINT32,
    pub VirtualTimerFlags: UINT32,
    pub NonSecureEl2Interrupt: UINT32,
    pub NonSecureEl2Flags: UINT32,
    pub CounterReadBlockAddress: UINT64,
    pub PlatformTimerCount: UINT32,
    pub PlatformTimerOffset: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_gtdt"][::core::mem::size_of::<acpi_table_gtdt>() - 96usize];
    ["Alignment of acpi_table_gtdt"][::core::mem::align_of::<acpi_table_gtdt>() - 1usize];
    ["Offset of field: acpi_table_gtdt::Header"]
        [::core::mem::offset_of!(acpi_table_gtdt, Header) - 0usize];
    ["Offset of field: acpi_table_gtdt::CounterBlockAddresss"]
        [::core::mem::offset_of!(acpi_table_gtdt, CounterBlockAddresss) - 36usize];
    ["Offset of field: acpi_table_gtdt::Reserved"]
        [::core::mem::offset_of!(acpi_table_gtdt, Reserved) - 44usize];
    ["Offset of field: acpi_table_gtdt::SecureEl1Interrupt"]
        [::core::mem::offset_of!(acpi_table_gtdt, SecureEl1Interrupt) - 48usize];
    ["Offset of field: acpi_table_gtdt::SecureEl1Flags"]
        [::core::mem::offset_of!(acpi_table_gtdt, SecureEl1Flags) - 52usize];
    ["Offset of field: acpi_table_gtdt::NonSecureEl1Interrupt"]
        [::core::mem::offset_of!(acpi_table_gtdt, NonSecureEl1Interrupt) - 56usize];
    ["Offset of field: acpi_table_gtdt::NonSecureEl1Flags"]
        [::core::mem::offset_of!(acpi_table_gtdt, NonSecureEl1Flags) - 60usize];
    ["Offset of field: acpi_table_gtdt::VirtualTimerInterrupt"]
        [::core::mem::offset_of!(acpi_table_gtdt, VirtualTimerInterrupt) - 64usize];
    ["Offset of field: acpi_table_gtdt::VirtualTimerFlags"]
        [::core::mem::offset_of!(acpi_table_gtdt, VirtualTimerFlags) - 68usize];
    ["Offset of field: acpi_table_gtdt::NonSecureEl2Interrupt"]
        [::core::mem::offset_of!(acpi_table_gtdt, NonSecureEl2Interrupt) - 72usize];
    ["Offset of field: acpi_table_gtdt::NonSecureEl2Flags"]
        [::core::mem::offset_of!(acpi_table_gtdt, NonSecureEl2Flags) - 76usize];
    ["Offset of field: acpi_table_gtdt::CounterReadBlockAddress"]
        [::core::mem::offset_of!(acpi_table_gtdt, CounterReadBlockAddress) - 80usize];
    ["Offset of field: acpi_table_gtdt::PlatformTimerCount"]
        [::core::mem::offset_of!(acpi_table_gtdt, PlatformTimerCount) - 88usize];
    ["Offset of field: acpi_table_gtdt::PlatformTimerOffset"]
        [::core::mem::offset_of!(acpi_table_gtdt, PlatformTimerOffset) - 92usize];
};
#[doc = " GTDT - Generic Timer Description Table (ACPI 5.1)\n        Version 2\n"]
pub type ACPI_TABLE_GTDT = acpi_table_gtdt;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_gtdt_el2 {
    pub VirtualEL2TimerGsiv: UINT32,
    pub VirtualEL2TimerFlags: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_gtdt_el2"][::core::mem::size_of::<acpi_gtdt_el2>() - 8usize];
    ["Alignment of acpi_gtdt_el2"][::core::mem::align_of::<acpi_gtdt_el2>() - 1usize];
    ["Offset of field: acpi_gtdt_el2::VirtualEL2TimerGsiv"]
        [::core::mem::offset_of!(acpi_gtdt_el2, VirtualEL2TimerGsiv) - 0usize];
    ["Offset of field: acpi_gtdt_el2::VirtualEL2TimerFlags"]
        [::core::mem::offset_of!(acpi_gtdt_el2, VirtualEL2TimerFlags) - 4usize];
};
pub type ACPI_GTDT_EL2 = acpi_gtdt_el2;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_gtdt_header {
    pub Type: UINT8,
    pub Length: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_gtdt_header"][::core::mem::size_of::<acpi_gtdt_header>() - 3usize];
    ["Alignment of acpi_gtdt_header"][::core::mem::align_of::<acpi_gtdt_header>() - 1usize];
    ["Offset of field: acpi_gtdt_header::Type"]
        [::core::mem::offset_of!(acpi_gtdt_header, Type) - 0usize];
    ["Offset of field: acpi_gtdt_header::Length"]
        [::core::mem::offset_of!(acpi_gtdt_header, Length) - 1usize];
};
pub type ACPI_GTDT_HEADER = acpi_gtdt_header;
pub const AcpiGtdtType_ACPI_GTDT_TYPE_TIMER_BLOCK: AcpiGtdtType = 0;
pub const AcpiGtdtType_ACPI_GTDT_TYPE_WATCHDOG: AcpiGtdtType = 1;
pub const AcpiGtdtType_ACPI_GTDT_TYPE_RESERVED: AcpiGtdtType = 2;
pub type AcpiGtdtType = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_gtdt_timer_block {
    pub Header: ACPI_GTDT_HEADER,
    pub Reserved: UINT8,
    pub BlockAddress: UINT64,
    pub TimerCount: UINT32,
    pub TimerOffset: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_gtdt_timer_block"][::core::mem::size_of::<acpi_gtdt_timer_block>() - 20usize];
    ["Alignment of acpi_gtdt_timer_block"]
        [::core::mem::align_of::<acpi_gtdt_timer_block>() - 1usize];
    ["Offset of field: acpi_gtdt_timer_block::Header"]
        [::core::mem::offset_of!(acpi_gtdt_timer_block, Header) - 0usize];
    ["Offset of field: acpi_gtdt_timer_block::Reserved"]
        [::core::mem::offset_of!(acpi_gtdt_timer_block, Reserved) - 3usize];
    ["Offset of field: acpi_gtdt_timer_block::BlockAddress"]
        [::core::mem::offset_of!(acpi_gtdt_timer_block, BlockAddress) - 4usize];
    ["Offset of field: acpi_gtdt_timer_block::TimerCount"]
        [::core::mem::offset_of!(acpi_gtdt_timer_block, TimerCount) - 12usize];
    ["Offset of field: acpi_gtdt_timer_block::TimerOffset"]
        [::core::mem::offset_of!(acpi_gtdt_timer_block, TimerOffset) - 16usize];
};
pub type ACPI_GTDT_TIMER_BLOCK = acpi_gtdt_timer_block;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_gtdt_timer_entry {
    pub FrameNumber: UINT8,
    pub Reserved: [UINT8; 3usize],
    pub BaseAddress: UINT64,
    pub El0BaseAddress: UINT64,
    pub TimerInterrupt: UINT32,
    pub TimerFlags: UINT32,
    pub VirtualTimerInterrupt: UINT32,
    pub VirtualTimerFlags: UINT32,
    pub CommonFlags: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_gtdt_timer_entry"][::core::mem::size_of::<acpi_gtdt_timer_entry>() - 40usize];
    ["Alignment of acpi_gtdt_timer_entry"]
        [::core::mem::align_of::<acpi_gtdt_timer_entry>() - 1usize];
    ["Offset of field: acpi_gtdt_timer_entry::FrameNumber"]
        [::core::mem::offset_of!(acpi_gtdt_timer_entry, FrameNumber) - 0usize];
    ["Offset of field: acpi_gtdt_timer_entry::Reserved"]
        [::core::mem::offset_of!(acpi_gtdt_timer_entry, Reserved) - 1usize];
    ["Offset of field: acpi_gtdt_timer_entry::BaseAddress"]
        [::core::mem::offset_of!(acpi_gtdt_timer_entry, BaseAddress) - 4usize];
    ["Offset of field: acpi_gtdt_timer_entry::El0BaseAddress"]
        [::core::mem::offset_of!(acpi_gtdt_timer_entry, El0BaseAddress) - 12usize];
    ["Offset of field: acpi_gtdt_timer_entry::TimerInterrupt"]
        [::core::mem::offset_of!(acpi_gtdt_timer_entry, TimerInterrupt) - 20usize];
    ["Offset of field: acpi_gtdt_timer_entry::TimerFlags"]
        [::core::mem::offset_of!(acpi_gtdt_timer_entry, TimerFlags) - 24usize];
    ["Offset of field: acpi_gtdt_timer_entry::VirtualTimerInterrupt"]
        [::core::mem::offset_of!(acpi_gtdt_timer_entry, VirtualTimerInterrupt) - 28usize];
    ["Offset of field: acpi_gtdt_timer_entry::VirtualTimerFlags"]
        [::core::mem::offset_of!(acpi_gtdt_timer_entry, VirtualTimerFlags) - 32usize];
    ["Offset of field: acpi_gtdt_timer_entry::CommonFlags"]
        [::core::mem::offset_of!(acpi_gtdt_timer_entry, CommonFlags) - 36usize];
};
pub type ACPI_GTDT_TIMER_ENTRY = acpi_gtdt_timer_entry;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_gtdt_watchdog {
    pub Header: ACPI_GTDT_HEADER,
    pub Reserved: UINT8,
    pub RefreshFrameAddress: UINT64,
    pub ControlFrameAddress: UINT64,
    pub TimerInterrupt: UINT32,
    pub TimerFlags: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_gtdt_watchdog"][::core::mem::size_of::<acpi_gtdt_watchdog>() - 28usize];
    ["Alignment of acpi_gtdt_watchdog"][::core::mem::align_of::<acpi_gtdt_watchdog>() - 1usize];
    ["Offset of field: acpi_gtdt_watchdog::Header"]
        [::core::mem::offset_of!(acpi_gtdt_watchdog, Header) - 0usize];
    ["Offset of field: acpi_gtdt_watchdog::Reserved"]
        [::core::mem::offset_of!(acpi_gtdt_watchdog, Reserved) - 3usize];
    ["Offset of field: acpi_gtdt_watchdog::RefreshFrameAddress"]
        [::core::mem::offset_of!(acpi_gtdt_watchdog, RefreshFrameAddress) - 4usize];
    ["Offset of field: acpi_gtdt_watchdog::ControlFrameAddress"]
        [::core::mem::offset_of!(acpi_gtdt_watchdog, ControlFrameAddress) - 12usize];
    ["Offset of field: acpi_gtdt_watchdog::TimerInterrupt"]
        [::core::mem::offset_of!(acpi_gtdt_watchdog, TimerInterrupt) - 20usize];
    ["Offset of field: acpi_gtdt_watchdog::TimerFlags"]
        [::core::mem::offset_of!(acpi_gtdt_watchdog, TimerFlags) - 24usize];
};
pub type ACPI_GTDT_WATCHDOG = acpi_gtdt_watchdog;
#[doc = " HEST - Hardware Error Source Table (ACPI 4.0)\n        Version 1\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_hest {
    pub Header: ACPI_TABLE_HEADER,
    pub ErrorSourceCount: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_hest"][::core::mem::size_of::<acpi_table_hest>() - 40usize];
    ["Alignment of acpi_table_hest"][::core::mem::align_of::<acpi_table_hest>() - 1usize];
    ["Offset of field: acpi_table_hest::Header"]
        [::core::mem::offset_of!(acpi_table_hest, Header) - 0usize];
    ["Offset of field: acpi_table_hest::ErrorSourceCount"]
        [::core::mem::offset_of!(acpi_table_hest, ErrorSourceCount) - 36usize];
};
#[doc = " HEST - Hardware Error Source Table (ACPI 4.0)\n        Version 1\n"]
pub type ACPI_TABLE_HEST = acpi_table_hest;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_header {
    pub Type: UINT16,
    pub SourceId: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_header"][::core::mem::size_of::<acpi_hest_header>() - 4usize];
    ["Alignment of acpi_hest_header"][::core::mem::align_of::<acpi_hest_header>() - 1usize];
    ["Offset of field: acpi_hest_header::Type"]
        [::core::mem::offset_of!(acpi_hest_header, Type) - 0usize];
    ["Offset of field: acpi_hest_header::SourceId"]
        [::core::mem::offset_of!(acpi_hest_header, SourceId) - 2usize];
};
pub type ACPI_HEST_HEADER = acpi_hest_header;
pub const AcpiHestTypes_ACPI_HEST_TYPE_IA32_CHECK: AcpiHestTypes = 0;
pub const AcpiHestTypes_ACPI_HEST_TYPE_IA32_CORRECTED_CHECK: AcpiHestTypes = 1;
pub const AcpiHestTypes_ACPI_HEST_TYPE_IA32_NMI: AcpiHestTypes = 2;
pub const AcpiHestTypes_ACPI_HEST_TYPE_NOT_USED3: AcpiHestTypes = 3;
pub const AcpiHestTypes_ACPI_HEST_TYPE_NOT_USED4: AcpiHestTypes = 4;
pub const AcpiHestTypes_ACPI_HEST_TYPE_NOT_USED5: AcpiHestTypes = 5;
pub const AcpiHestTypes_ACPI_HEST_TYPE_AER_ROOT_PORT: AcpiHestTypes = 6;
pub const AcpiHestTypes_ACPI_HEST_TYPE_AER_ENDPOINT: AcpiHestTypes = 7;
pub const AcpiHestTypes_ACPI_HEST_TYPE_AER_BRIDGE: AcpiHestTypes = 8;
pub const AcpiHestTypes_ACPI_HEST_TYPE_GENERIC_ERROR: AcpiHestTypes = 9;
pub const AcpiHestTypes_ACPI_HEST_TYPE_GENERIC_ERROR_V2: AcpiHestTypes = 10;
pub const AcpiHestTypes_ACPI_HEST_TYPE_IA32_DEFERRED_CHECK: AcpiHestTypes = 11;
pub const AcpiHestTypes_ACPI_HEST_TYPE_RESERVED: AcpiHestTypes = 12;
pub type AcpiHestTypes = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_ia_error_bank {
    pub BankNumber: UINT8,
    pub ClearStatusOnInit: UINT8,
    pub StatusFormat: UINT8,
    pub Reserved: UINT8,
    pub ControlRegister: UINT32,
    pub ControlData: UINT64,
    pub StatusRegister: UINT32,
    pub AddressRegister: UINT32,
    pub MiscRegister: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_ia_error_bank"]
        [::core::mem::size_of::<acpi_hest_ia_error_bank>() - 28usize];
    ["Alignment of acpi_hest_ia_error_bank"]
        [::core::mem::align_of::<acpi_hest_ia_error_bank>() - 1usize];
    ["Offset of field: acpi_hest_ia_error_bank::BankNumber"]
        [::core::mem::offset_of!(acpi_hest_ia_error_bank, BankNumber) - 0usize];
    ["Offset of field: acpi_hest_ia_error_bank::ClearStatusOnInit"]
        [::core::mem::offset_of!(acpi_hest_ia_error_bank, ClearStatusOnInit) - 1usize];
    ["Offset of field: acpi_hest_ia_error_bank::StatusFormat"]
        [::core::mem::offset_of!(acpi_hest_ia_error_bank, StatusFormat) - 2usize];
    ["Offset of field: acpi_hest_ia_error_bank::Reserved"]
        [::core::mem::offset_of!(acpi_hest_ia_error_bank, Reserved) - 3usize];
    ["Offset of field: acpi_hest_ia_error_bank::ControlRegister"]
        [::core::mem::offset_of!(acpi_hest_ia_error_bank, ControlRegister) - 4usize];
    ["Offset of field: acpi_hest_ia_error_bank::ControlData"]
        [::core::mem::offset_of!(acpi_hest_ia_error_bank, ControlData) - 8usize];
    ["Offset of field: acpi_hest_ia_error_bank::StatusRegister"]
        [::core::mem::offset_of!(acpi_hest_ia_error_bank, StatusRegister) - 16usize];
    ["Offset of field: acpi_hest_ia_error_bank::AddressRegister"]
        [::core::mem::offset_of!(acpi_hest_ia_error_bank, AddressRegister) - 20usize];
    ["Offset of field: acpi_hest_ia_error_bank::MiscRegister"]
        [::core::mem::offset_of!(acpi_hest_ia_error_bank, MiscRegister) - 24usize];
};
pub type ACPI_HEST_IA_ERROR_BANK = acpi_hest_ia_error_bank;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_aer_common {
    pub Reserved1: UINT16,
    pub Flags: UINT8,
    pub Enabled: UINT8,
    pub RecordsToPreallocate: UINT32,
    pub MaxSectionsPerRecord: UINT32,
    pub Bus: UINT32,
    pub Device: UINT16,
    pub Function: UINT16,
    pub DeviceControl: UINT16,
    pub Reserved2: UINT16,
    pub UncorrectableMask: UINT32,
    pub UncorrectableSeverity: UINT32,
    pub CorrectableMask: UINT32,
    pub AdvancedCapabilities: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_aer_common"][::core::mem::size_of::<acpi_hest_aer_common>() - 40usize];
    ["Alignment of acpi_hest_aer_common"][::core::mem::align_of::<acpi_hest_aer_common>() - 1usize];
    ["Offset of field: acpi_hest_aer_common::Reserved1"]
        [::core::mem::offset_of!(acpi_hest_aer_common, Reserved1) - 0usize];
    ["Offset of field: acpi_hest_aer_common::Flags"]
        [::core::mem::offset_of!(acpi_hest_aer_common, Flags) - 2usize];
    ["Offset of field: acpi_hest_aer_common::Enabled"]
        [::core::mem::offset_of!(acpi_hest_aer_common, Enabled) - 3usize];
    ["Offset of field: acpi_hest_aer_common::RecordsToPreallocate"]
        [::core::mem::offset_of!(acpi_hest_aer_common, RecordsToPreallocate) - 4usize];
    ["Offset of field: acpi_hest_aer_common::MaxSectionsPerRecord"]
        [::core::mem::offset_of!(acpi_hest_aer_common, MaxSectionsPerRecord) - 8usize];
    ["Offset of field: acpi_hest_aer_common::Bus"]
        [::core::mem::offset_of!(acpi_hest_aer_common, Bus) - 12usize];
    ["Offset of field: acpi_hest_aer_common::Device"]
        [::core::mem::offset_of!(acpi_hest_aer_common, Device) - 16usize];
    ["Offset of field: acpi_hest_aer_common::Function"]
        [::core::mem::offset_of!(acpi_hest_aer_common, Function) - 18usize];
    ["Offset of field: acpi_hest_aer_common::DeviceControl"]
        [::core::mem::offset_of!(acpi_hest_aer_common, DeviceControl) - 20usize];
    ["Offset of field: acpi_hest_aer_common::Reserved2"]
        [::core::mem::offset_of!(acpi_hest_aer_common, Reserved2) - 22usize];
    ["Offset of field: acpi_hest_aer_common::UncorrectableMask"]
        [::core::mem::offset_of!(acpi_hest_aer_common, UncorrectableMask) - 24usize];
    ["Offset of field: acpi_hest_aer_common::UncorrectableSeverity"]
        [::core::mem::offset_of!(acpi_hest_aer_common, UncorrectableSeverity) - 28usize];
    ["Offset of field: acpi_hest_aer_common::CorrectableMask"]
        [::core::mem::offset_of!(acpi_hest_aer_common, CorrectableMask) - 32usize];
    ["Offset of field: acpi_hest_aer_common::AdvancedCapabilities"]
        [::core::mem::offset_of!(acpi_hest_aer_common, AdvancedCapabilities) - 36usize];
};
pub type ACPI_HEST_AER_COMMON = acpi_hest_aer_common;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_notify {
    pub Type: UINT8,
    pub Length: UINT8,
    pub ConfigWriteEnable: UINT16,
    pub PollInterval: UINT32,
    pub Vector: UINT32,
    pub PollingThresholdValue: UINT32,
    pub PollingThresholdWindow: UINT32,
    pub ErrorThresholdValue: UINT32,
    pub ErrorThresholdWindow: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_notify"][::core::mem::size_of::<acpi_hest_notify>() - 28usize];
    ["Alignment of acpi_hest_notify"][::core::mem::align_of::<acpi_hest_notify>() - 1usize];
    ["Offset of field: acpi_hest_notify::Type"]
        [::core::mem::offset_of!(acpi_hest_notify, Type) - 0usize];
    ["Offset of field: acpi_hest_notify::Length"]
        [::core::mem::offset_of!(acpi_hest_notify, Length) - 1usize];
    ["Offset of field: acpi_hest_notify::ConfigWriteEnable"]
        [::core::mem::offset_of!(acpi_hest_notify, ConfigWriteEnable) - 2usize];
    ["Offset of field: acpi_hest_notify::PollInterval"]
        [::core::mem::offset_of!(acpi_hest_notify, PollInterval) - 4usize];
    ["Offset of field: acpi_hest_notify::Vector"]
        [::core::mem::offset_of!(acpi_hest_notify, Vector) - 8usize];
    ["Offset of field: acpi_hest_notify::PollingThresholdValue"]
        [::core::mem::offset_of!(acpi_hest_notify, PollingThresholdValue) - 12usize];
    ["Offset of field: acpi_hest_notify::PollingThresholdWindow"]
        [::core::mem::offset_of!(acpi_hest_notify, PollingThresholdWindow) - 16usize];
    ["Offset of field: acpi_hest_notify::ErrorThresholdValue"]
        [::core::mem::offset_of!(acpi_hest_notify, ErrorThresholdValue) - 20usize];
    ["Offset of field: acpi_hest_notify::ErrorThresholdWindow"]
        [::core::mem::offset_of!(acpi_hest_notify, ErrorThresholdWindow) - 24usize];
};
pub type ACPI_HEST_NOTIFY = acpi_hest_notify;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_POLLED: AcpiHestNotifyTypes = 0;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_EXTERNAL: AcpiHestNotifyTypes = 1;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_LOCAL: AcpiHestNotifyTypes = 2;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_SCI: AcpiHestNotifyTypes = 3;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_NMI: AcpiHestNotifyTypes = 4;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_CMCI: AcpiHestNotifyTypes = 5;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_MCE: AcpiHestNotifyTypes = 6;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_GPIO: AcpiHestNotifyTypes = 7;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_SEA: AcpiHestNotifyTypes = 8;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_SEI: AcpiHestNotifyTypes = 9;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_GSIV: AcpiHestNotifyTypes = 10;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_SOFTWARE_DELEGATED: AcpiHestNotifyTypes = 11;
pub const AcpiHestNotifyTypes_ACPI_HEST_NOTIFY_RESERVED: AcpiHestNotifyTypes = 12;
pub type AcpiHestNotifyTypes = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_ia_machine_check {
    pub Header: ACPI_HEST_HEADER,
    pub Reserved1: UINT16,
    pub Flags: UINT8,
    pub Enabled: UINT8,
    pub RecordsToPreallocate: UINT32,
    pub MaxSectionsPerRecord: UINT32,
    pub GlobalCapabilityData: UINT64,
    pub GlobalControlData: UINT64,
    pub NumHardwareBanks: UINT8,
    pub Reserved3: [UINT8; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_ia_machine_check"]
        [::core::mem::size_of::<acpi_hest_ia_machine_check>() - 40usize];
    ["Alignment of acpi_hest_ia_machine_check"]
        [::core::mem::align_of::<acpi_hest_ia_machine_check>() - 1usize];
    ["Offset of field: acpi_hest_ia_machine_check::Header"]
        [::core::mem::offset_of!(acpi_hest_ia_machine_check, Header) - 0usize];
    ["Offset of field: acpi_hest_ia_machine_check::Reserved1"]
        [::core::mem::offset_of!(acpi_hest_ia_machine_check, Reserved1) - 4usize];
    ["Offset of field: acpi_hest_ia_machine_check::Flags"]
        [::core::mem::offset_of!(acpi_hest_ia_machine_check, Flags) - 6usize];
    ["Offset of field: acpi_hest_ia_machine_check::Enabled"]
        [::core::mem::offset_of!(acpi_hest_ia_machine_check, Enabled) - 7usize];
    ["Offset of field: acpi_hest_ia_machine_check::RecordsToPreallocate"]
        [::core::mem::offset_of!(acpi_hest_ia_machine_check, RecordsToPreallocate) - 8usize];
    ["Offset of field: acpi_hest_ia_machine_check::MaxSectionsPerRecord"]
        [::core::mem::offset_of!(acpi_hest_ia_machine_check, MaxSectionsPerRecord) - 12usize];
    ["Offset of field: acpi_hest_ia_machine_check::GlobalCapabilityData"]
        [::core::mem::offset_of!(acpi_hest_ia_machine_check, GlobalCapabilityData) - 16usize];
    ["Offset of field: acpi_hest_ia_machine_check::GlobalControlData"]
        [::core::mem::offset_of!(acpi_hest_ia_machine_check, GlobalControlData) - 24usize];
    ["Offset of field: acpi_hest_ia_machine_check::NumHardwareBanks"]
        [::core::mem::offset_of!(acpi_hest_ia_machine_check, NumHardwareBanks) - 32usize];
    ["Offset of field: acpi_hest_ia_machine_check::Reserved3"]
        [::core::mem::offset_of!(acpi_hest_ia_machine_check, Reserved3) - 33usize];
};
pub type ACPI_HEST_IA_MACHINE_CHECK = acpi_hest_ia_machine_check;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_ia_corrected {
    pub Header: ACPI_HEST_HEADER,
    pub Reserved1: UINT16,
    pub Flags: UINT8,
    pub Enabled: UINT8,
    pub RecordsToPreallocate: UINT32,
    pub MaxSectionsPerRecord: UINT32,
    pub Notify: ACPI_HEST_NOTIFY,
    pub NumHardwareBanks: UINT8,
    pub Reserved2: [UINT8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_ia_corrected"][::core::mem::size_of::<acpi_hest_ia_corrected>() - 48usize];
    ["Alignment of acpi_hest_ia_corrected"]
        [::core::mem::align_of::<acpi_hest_ia_corrected>() - 1usize];
    ["Offset of field: acpi_hest_ia_corrected::Header"]
        [::core::mem::offset_of!(acpi_hest_ia_corrected, Header) - 0usize];
    ["Offset of field: acpi_hest_ia_corrected::Reserved1"]
        [::core::mem::offset_of!(acpi_hest_ia_corrected, Reserved1) - 4usize];
    ["Offset of field: acpi_hest_ia_corrected::Flags"]
        [::core::mem::offset_of!(acpi_hest_ia_corrected, Flags) - 6usize];
    ["Offset of field: acpi_hest_ia_corrected::Enabled"]
        [::core::mem::offset_of!(acpi_hest_ia_corrected, Enabled) - 7usize];
    ["Offset of field: acpi_hest_ia_corrected::RecordsToPreallocate"]
        [::core::mem::offset_of!(acpi_hest_ia_corrected, RecordsToPreallocate) - 8usize];
    ["Offset of field: acpi_hest_ia_corrected::MaxSectionsPerRecord"]
        [::core::mem::offset_of!(acpi_hest_ia_corrected, MaxSectionsPerRecord) - 12usize];
    ["Offset of field: acpi_hest_ia_corrected::Notify"]
        [::core::mem::offset_of!(acpi_hest_ia_corrected, Notify) - 16usize];
    ["Offset of field: acpi_hest_ia_corrected::NumHardwareBanks"]
        [::core::mem::offset_of!(acpi_hest_ia_corrected, NumHardwareBanks) - 44usize];
    ["Offset of field: acpi_hest_ia_corrected::Reserved2"]
        [::core::mem::offset_of!(acpi_hest_ia_corrected, Reserved2) - 45usize];
};
pub type ACPI_HEST_IA_CORRECTED = acpi_hest_ia_corrected;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_ia_nmi {
    pub Header: ACPI_HEST_HEADER,
    pub Reserved: UINT32,
    pub RecordsToPreallocate: UINT32,
    pub MaxSectionsPerRecord: UINT32,
    pub MaxRawDataLength: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_ia_nmi"][::core::mem::size_of::<acpi_hest_ia_nmi>() - 20usize];
    ["Alignment of acpi_hest_ia_nmi"][::core::mem::align_of::<acpi_hest_ia_nmi>() - 1usize];
    ["Offset of field: acpi_hest_ia_nmi::Header"]
        [::core::mem::offset_of!(acpi_hest_ia_nmi, Header) - 0usize];
    ["Offset of field: acpi_hest_ia_nmi::Reserved"]
        [::core::mem::offset_of!(acpi_hest_ia_nmi, Reserved) - 4usize];
    ["Offset of field: acpi_hest_ia_nmi::RecordsToPreallocate"]
        [::core::mem::offset_of!(acpi_hest_ia_nmi, RecordsToPreallocate) - 8usize];
    ["Offset of field: acpi_hest_ia_nmi::MaxSectionsPerRecord"]
        [::core::mem::offset_of!(acpi_hest_ia_nmi, MaxSectionsPerRecord) - 12usize];
    ["Offset of field: acpi_hest_ia_nmi::MaxRawDataLength"]
        [::core::mem::offset_of!(acpi_hest_ia_nmi, MaxRawDataLength) - 16usize];
};
pub type ACPI_HEST_IA_NMI = acpi_hest_ia_nmi;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_aer_root {
    pub Header: ACPI_HEST_HEADER,
    pub Aer: ACPI_HEST_AER_COMMON,
    pub RootErrorCommand: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_aer_root"][::core::mem::size_of::<acpi_hest_aer_root>() - 48usize];
    ["Alignment of acpi_hest_aer_root"][::core::mem::align_of::<acpi_hest_aer_root>() - 1usize];
    ["Offset of field: acpi_hest_aer_root::Header"]
        [::core::mem::offset_of!(acpi_hest_aer_root, Header) - 0usize];
    ["Offset of field: acpi_hest_aer_root::Aer"]
        [::core::mem::offset_of!(acpi_hest_aer_root, Aer) - 4usize];
    ["Offset of field: acpi_hest_aer_root::RootErrorCommand"]
        [::core::mem::offset_of!(acpi_hest_aer_root, RootErrorCommand) - 44usize];
};
pub type ACPI_HEST_AER_ROOT = acpi_hest_aer_root;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_aer {
    pub Header: ACPI_HEST_HEADER,
    pub Aer: ACPI_HEST_AER_COMMON,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_aer"][::core::mem::size_of::<acpi_hest_aer>() - 44usize];
    ["Alignment of acpi_hest_aer"][::core::mem::align_of::<acpi_hest_aer>() - 1usize];
    ["Offset of field: acpi_hest_aer::Header"]
        [::core::mem::offset_of!(acpi_hest_aer, Header) - 0usize];
    ["Offset of field: acpi_hest_aer::Aer"][::core::mem::offset_of!(acpi_hest_aer, Aer) - 4usize];
};
pub type ACPI_HEST_AER = acpi_hest_aer;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_aer_bridge {
    pub Header: ACPI_HEST_HEADER,
    pub Aer: ACPI_HEST_AER_COMMON,
    pub UncorrectableMask2: UINT32,
    pub UncorrectableSeverity2: UINT32,
    pub AdvancedCapabilities2: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_aer_bridge"][::core::mem::size_of::<acpi_hest_aer_bridge>() - 56usize];
    ["Alignment of acpi_hest_aer_bridge"][::core::mem::align_of::<acpi_hest_aer_bridge>() - 1usize];
    ["Offset of field: acpi_hest_aer_bridge::Header"]
        [::core::mem::offset_of!(acpi_hest_aer_bridge, Header) - 0usize];
    ["Offset of field: acpi_hest_aer_bridge::Aer"]
        [::core::mem::offset_of!(acpi_hest_aer_bridge, Aer) - 4usize];
    ["Offset of field: acpi_hest_aer_bridge::UncorrectableMask2"]
        [::core::mem::offset_of!(acpi_hest_aer_bridge, UncorrectableMask2) - 44usize];
    ["Offset of field: acpi_hest_aer_bridge::UncorrectableSeverity2"]
        [::core::mem::offset_of!(acpi_hest_aer_bridge, UncorrectableSeverity2) - 48usize];
    ["Offset of field: acpi_hest_aer_bridge::AdvancedCapabilities2"]
        [::core::mem::offset_of!(acpi_hest_aer_bridge, AdvancedCapabilities2) - 52usize];
};
pub type ACPI_HEST_AER_BRIDGE = acpi_hest_aer_bridge;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_generic {
    pub Header: ACPI_HEST_HEADER,
    pub RelatedSourceId: UINT16,
    pub Reserved: UINT8,
    pub Enabled: UINT8,
    pub RecordsToPreallocate: UINT32,
    pub MaxSectionsPerRecord: UINT32,
    pub MaxRawDataLength: UINT32,
    pub ErrorStatusAddress: ACPI_GENERIC_ADDRESS,
    pub Notify: ACPI_HEST_NOTIFY,
    pub ErrorBlockLength: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_generic"][::core::mem::size_of::<acpi_hest_generic>() - 64usize];
    ["Alignment of acpi_hest_generic"][::core::mem::align_of::<acpi_hest_generic>() - 1usize];
    ["Offset of field: acpi_hest_generic::Header"]
        [::core::mem::offset_of!(acpi_hest_generic, Header) - 0usize];
    ["Offset of field: acpi_hest_generic::RelatedSourceId"]
        [::core::mem::offset_of!(acpi_hest_generic, RelatedSourceId) - 4usize];
    ["Offset of field: acpi_hest_generic::Reserved"]
        [::core::mem::offset_of!(acpi_hest_generic, Reserved) - 6usize];
    ["Offset of field: acpi_hest_generic::Enabled"]
        [::core::mem::offset_of!(acpi_hest_generic, Enabled) - 7usize];
    ["Offset of field: acpi_hest_generic::RecordsToPreallocate"]
        [::core::mem::offset_of!(acpi_hest_generic, RecordsToPreallocate) - 8usize];
    ["Offset of field: acpi_hest_generic::MaxSectionsPerRecord"]
        [::core::mem::offset_of!(acpi_hest_generic, MaxSectionsPerRecord) - 12usize];
    ["Offset of field: acpi_hest_generic::MaxRawDataLength"]
        [::core::mem::offset_of!(acpi_hest_generic, MaxRawDataLength) - 16usize];
    ["Offset of field: acpi_hest_generic::ErrorStatusAddress"]
        [::core::mem::offset_of!(acpi_hest_generic, ErrorStatusAddress) - 20usize];
    ["Offset of field: acpi_hest_generic::Notify"]
        [::core::mem::offset_of!(acpi_hest_generic, Notify) - 32usize];
    ["Offset of field: acpi_hest_generic::ErrorBlockLength"]
        [::core::mem::offset_of!(acpi_hest_generic, ErrorBlockLength) - 60usize];
};
pub type ACPI_HEST_GENERIC = acpi_hest_generic;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_generic_v2 {
    pub Header: ACPI_HEST_HEADER,
    pub RelatedSourceId: UINT16,
    pub Reserved: UINT8,
    pub Enabled: UINT8,
    pub RecordsToPreallocate: UINT32,
    pub MaxSectionsPerRecord: UINT32,
    pub MaxRawDataLength: UINT32,
    pub ErrorStatusAddress: ACPI_GENERIC_ADDRESS,
    pub Notify: ACPI_HEST_NOTIFY,
    pub ErrorBlockLength: UINT32,
    pub ReadAckRegister: ACPI_GENERIC_ADDRESS,
    pub ReadAckPreserve: UINT64,
    pub ReadAckWrite: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_generic_v2"][::core::mem::size_of::<acpi_hest_generic_v2>() - 92usize];
    ["Alignment of acpi_hest_generic_v2"][::core::mem::align_of::<acpi_hest_generic_v2>() - 1usize];
    ["Offset of field: acpi_hest_generic_v2::Header"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, Header) - 0usize];
    ["Offset of field: acpi_hest_generic_v2::RelatedSourceId"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, RelatedSourceId) - 4usize];
    ["Offset of field: acpi_hest_generic_v2::Reserved"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, Reserved) - 6usize];
    ["Offset of field: acpi_hest_generic_v2::Enabled"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, Enabled) - 7usize];
    ["Offset of field: acpi_hest_generic_v2::RecordsToPreallocate"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, RecordsToPreallocate) - 8usize];
    ["Offset of field: acpi_hest_generic_v2::MaxSectionsPerRecord"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, MaxSectionsPerRecord) - 12usize];
    ["Offset of field: acpi_hest_generic_v2::MaxRawDataLength"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, MaxRawDataLength) - 16usize];
    ["Offset of field: acpi_hest_generic_v2::ErrorStatusAddress"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, ErrorStatusAddress) - 20usize];
    ["Offset of field: acpi_hest_generic_v2::Notify"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, Notify) - 32usize];
    ["Offset of field: acpi_hest_generic_v2::ErrorBlockLength"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, ErrorBlockLength) - 60usize];
    ["Offset of field: acpi_hest_generic_v2::ReadAckRegister"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, ReadAckRegister) - 64usize];
    ["Offset of field: acpi_hest_generic_v2::ReadAckPreserve"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, ReadAckPreserve) - 76usize];
    ["Offset of field: acpi_hest_generic_v2::ReadAckWrite"]
        [::core::mem::offset_of!(acpi_hest_generic_v2, ReadAckWrite) - 84usize];
};
pub type ACPI_HEST_GENERIC_V2 = acpi_hest_generic_v2;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_generic_status {
    pub BlockStatus: UINT32,
    pub RawDataOffset: UINT32,
    pub RawDataLength: UINT32,
    pub DataLength: UINT32,
    pub ErrorSeverity: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_generic_status"]
        [::core::mem::size_of::<acpi_hest_generic_status>() - 20usize];
    ["Alignment of acpi_hest_generic_status"]
        [::core::mem::align_of::<acpi_hest_generic_status>() - 1usize];
    ["Offset of field: acpi_hest_generic_status::BlockStatus"]
        [::core::mem::offset_of!(acpi_hest_generic_status, BlockStatus) - 0usize];
    ["Offset of field: acpi_hest_generic_status::RawDataOffset"]
        [::core::mem::offset_of!(acpi_hest_generic_status, RawDataOffset) - 4usize];
    ["Offset of field: acpi_hest_generic_status::RawDataLength"]
        [::core::mem::offset_of!(acpi_hest_generic_status, RawDataLength) - 8usize];
    ["Offset of field: acpi_hest_generic_status::DataLength"]
        [::core::mem::offset_of!(acpi_hest_generic_status, DataLength) - 12usize];
    ["Offset of field: acpi_hest_generic_status::ErrorSeverity"]
        [::core::mem::offset_of!(acpi_hest_generic_status, ErrorSeverity) - 16usize];
};
pub type ACPI_HEST_GENERIC_STATUS = acpi_hest_generic_status;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_generic_data {
    pub SectionType: [UINT8; 16usize],
    pub ErrorSeverity: UINT32,
    pub Revision: UINT16,
    pub ValidationBits: UINT8,
    pub Flags: UINT8,
    pub ErrorDataLength: UINT32,
    pub FruId: [UINT8; 16usize],
    pub FruText: [UINT8; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_generic_data"][::core::mem::size_of::<acpi_hest_generic_data>() - 64usize];
    ["Alignment of acpi_hest_generic_data"]
        [::core::mem::align_of::<acpi_hest_generic_data>() - 1usize];
    ["Offset of field: acpi_hest_generic_data::SectionType"]
        [::core::mem::offset_of!(acpi_hest_generic_data, SectionType) - 0usize];
    ["Offset of field: acpi_hest_generic_data::ErrorSeverity"]
        [::core::mem::offset_of!(acpi_hest_generic_data, ErrorSeverity) - 16usize];
    ["Offset of field: acpi_hest_generic_data::Revision"]
        [::core::mem::offset_of!(acpi_hest_generic_data, Revision) - 20usize];
    ["Offset of field: acpi_hest_generic_data::ValidationBits"]
        [::core::mem::offset_of!(acpi_hest_generic_data, ValidationBits) - 22usize];
    ["Offset of field: acpi_hest_generic_data::Flags"]
        [::core::mem::offset_of!(acpi_hest_generic_data, Flags) - 23usize];
    ["Offset of field: acpi_hest_generic_data::ErrorDataLength"]
        [::core::mem::offset_of!(acpi_hest_generic_data, ErrorDataLength) - 24usize];
    ["Offset of field: acpi_hest_generic_data::FruId"]
        [::core::mem::offset_of!(acpi_hest_generic_data, FruId) - 28usize];
    ["Offset of field: acpi_hest_generic_data::FruText"]
        [::core::mem::offset_of!(acpi_hest_generic_data, FruText) - 44usize];
};
pub type ACPI_HEST_GENERIC_DATA = acpi_hest_generic_data;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_generic_data_v300 {
    pub SectionType: [UINT8; 16usize],
    pub ErrorSeverity: UINT32,
    pub Revision: UINT16,
    pub ValidationBits: UINT8,
    pub Flags: UINT8,
    pub ErrorDataLength: UINT32,
    pub FruId: [UINT8; 16usize],
    pub FruText: [UINT8; 20usize],
    pub TimeStamp: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_generic_data_v300"]
        [::core::mem::size_of::<acpi_hest_generic_data_v300>() - 72usize];
    ["Alignment of acpi_hest_generic_data_v300"]
        [::core::mem::align_of::<acpi_hest_generic_data_v300>() - 1usize];
    ["Offset of field: acpi_hest_generic_data_v300::SectionType"]
        [::core::mem::offset_of!(acpi_hest_generic_data_v300, SectionType) - 0usize];
    ["Offset of field: acpi_hest_generic_data_v300::ErrorSeverity"]
        [::core::mem::offset_of!(acpi_hest_generic_data_v300, ErrorSeverity) - 16usize];
    ["Offset of field: acpi_hest_generic_data_v300::Revision"]
        [::core::mem::offset_of!(acpi_hest_generic_data_v300, Revision) - 20usize];
    ["Offset of field: acpi_hest_generic_data_v300::ValidationBits"]
        [::core::mem::offset_of!(acpi_hest_generic_data_v300, ValidationBits) - 22usize];
    ["Offset of field: acpi_hest_generic_data_v300::Flags"]
        [::core::mem::offset_of!(acpi_hest_generic_data_v300, Flags) - 23usize];
    ["Offset of field: acpi_hest_generic_data_v300::ErrorDataLength"]
        [::core::mem::offset_of!(acpi_hest_generic_data_v300, ErrorDataLength) - 24usize];
    ["Offset of field: acpi_hest_generic_data_v300::FruId"]
        [::core::mem::offset_of!(acpi_hest_generic_data_v300, FruId) - 28usize];
    ["Offset of field: acpi_hest_generic_data_v300::FruText"]
        [::core::mem::offset_of!(acpi_hest_generic_data_v300, FruText) - 44usize];
    ["Offset of field: acpi_hest_generic_data_v300::TimeStamp"]
        [::core::mem::offset_of!(acpi_hest_generic_data_v300, TimeStamp) - 64usize];
};
pub type ACPI_HEST_GENERIC_DATA_V300 = acpi_hest_generic_data_v300;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hest_ia_deferred_check {
    pub Header: ACPI_HEST_HEADER,
    pub Reserved1: UINT16,
    pub Flags: UINT8,
    pub Enabled: UINT8,
    pub RecordsToPreallocate: UINT32,
    pub MaxSectionsPerRecord: UINT32,
    pub Notify: ACPI_HEST_NOTIFY,
    pub NumHardwareBanks: UINT8,
    pub Reserved2: [UINT8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hest_ia_deferred_check"]
        [::core::mem::size_of::<acpi_hest_ia_deferred_check>() - 48usize];
    ["Alignment of acpi_hest_ia_deferred_check"]
        [::core::mem::align_of::<acpi_hest_ia_deferred_check>() - 1usize];
    ["Offset of field: acpi_hest_ia_deferred_check::Header"]
        [::core::mem::offset_of!(acpi_hest_ia_deferred_check, Header) - 0usize];
    ["Offset of field: acpi_hest_ia_deferred_check::Reserved1"]
        [::core::mem::offset_of!(acpi_hest_ia_deferred_check, Reserved1) - 4usize];
    ["Offset of field: acpi_hest_ia_deferred_check::Flags"]
        [::core::mem::offset_of!(acpi_hest_ia_deferred_check, Flags) - 6usize];
    ["Offset of field: acpi_hest_ia_deferred_check::Enabled"]
        [::core::mem::offset_of!(acpi_hest_ia_deferred_check, Enabled) - 7usize];
    ["Offset of field: acpi_hest_ia_deferred_check::RecordsToPreallocate"]
        [::core::mem::offset_of!(acpi_hest_ia_deferred_check, RecordsToPreallocate) - 8usize];
    ["Offset of field: acpi_hest_ia_deferred_check::MaxSectionsPerRecord"]
        [::core::mem::offset_of!(acpi_hest_ia_deferred_check, MaxSectionsPerRecord) - 12usize];
    ["Offset of field: acpi_hest_ia_deferred_check::Notify"]
        [::core::mem::offset_of!(acpi_hest_ia_deferred_check, Notify) - 16usize];
    ["Offset of field: acpi_hest_ia_deferred_check::NumHardwareBanks"]
        [::core::mem::offset_of!(acpi_hest_ia_deferred_check, NumHardwareBanks) - 44usize];
    ["Offset of field: acpi_hest_ia_deferred_check::Reserved2"]
        [::core::mem::offset_of!(acpi_hest_ia_deferred_check, Reserved2) - 45usize];
};
pub type ACPI_HEST_IA_DEFERRED_CHECK = acpi_hest_ia_deferred_check;
#[doc = " HMAT - Heterogeneous Memory Attributes Table (ACPI 6.3)\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_hmat {
    pub Header: ACPI_TABLE_HEADER,
    pub Reserved: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_hmat"][::core::mem::size_of::<acpi_table_hmat>() - 40usize];
    ["Alignment of acpi_table_hmat"][::core::mem::align_of::<acpi_table_hmat>() - 1usize];
    ["Offset of field: acpi_table_hmat::Header"]
        [::core::mem::offset_of!(acpi_table_hmat, Header) - 0usize];
    ["Offset of field: acpi_table_hmat::Reserved"]
        [::core::mem::offset_of!(acpi_table_hmat, Reserved) - 36usize];
};
#[doc = " HMAT - Heterogeneous Memory Attributes Table (ACPI 6.3)\n"]
pub type ACPI_TABLE_HMAT = acpi_table_hmat;
pub const AcpiHmatType_ACPI_HMAT_TYPE_ADDRESS_RANGE: AcpiHmatType = 0;
pub const AcpiHmatType_ACPI_HMAT_TYPE_LOCALITY: AcpiHmatType = 1;
pub const AcpiHmatType_ACPI_HMAT_TYPE_CACHE: AcpiHmatType = 2;
pub const AcpiHmatType_ACPI_HMAT_TYPE_RESERVED: AcpiHmatType = 3;
pub type AcpiHmatType = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hmat_structure {
    pub Type: UINT16,
    pub Reserved: UINT16,
    pub Length: UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hmat_structure"][::core::mem::size_of::<acpi_hmat_structure>() - 8usize];
    ["Alignment of acpi_hmat_structure"][::core::mem::align_of::<acpi_hmat_structure>() - 1usize];
    ["Offset of field: acpi_hmat_structure::Type"]
        [::core::mem::offset_of!(acpi_hmat_structure, Type) - 0usize];
    ["Offset of field: acpi_hmat_structure::Reserved"]
        [::core::mem::offset_of!(acpi_hmat_structure, Reserved) - 2usize];
    ["Offset of field: acpi_hmat_structure::Length"]
        [::core::mem::offset_of!(acpi_hmat_structure, Length) - 4usize];
};
pub type ACPI_HMAT_STRUCTURE = acpi_hmat_structure;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hmat_proximity_domain {
    pub Header: ACPI_HMAT_STRUCTURE,
    pub Flags: UINT16,
    pub Reserved1: UINT16,
    pub InitiatorPD: UINT32,
    pub MemoryPD: UINT32,
    pub Reserved2: UINT32,
    pub Reserved3: UINT64,
    pub Reserved4: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hmat_proximity_domain"]
        [::core::mem::size_of::<acpi_hmat_proximity_domain>() - 40usize];
    ["Alignment of acpi_hmat_proximity_domain"]
        [::core::mem::align_of::<acpi_hmat_proximity_domain>() - 1usize];
    ["Offset of field: acpi_hmat_proximity_domain::Header"]
        [::core::mem::offset_of!(acpi_hmat_proximity_domain, Header) - 0usize];
    ["Offset of field: acpi_hmat_proximity_domain::Flags"]
        [::core::mem::offset_of!(acpi_hmat_proximity_domain, Flags) - 8usize];
    ["Offset of field: acpi_hmat_proximity_domain::Reserved1"]
        [::core::mem::offset_of!(acpi_hmat_proximity_domain, Reserved1) - 10usize];
    ["Offset of field: acpi_hmat_proximity_domain::InitiatorPD"]
        [::core::mem::offset_of!(acpi_hmat_proximity_domain, InitiatorPD) - 12usize];
    ["Offset of field: acpi_hmat_proximity_domain::MemoryPD"]
        [::core::mem::offset_of!(acpi_hmat_proximity_domain, MemoryPD) - 16usize];
    ["Offset of field: acpi_hmat_proximity_domain::Reserved2"]
        [::core::mem::offset_of!(acpi_hmat_proximity_domain, Reserved2) - 20usize];
    ["Offset of field: acpi_hmat_proximity_domain::Reserved3"]
        [::core::mem::offset_of!(acpi_hmat_proximity_domain, Reserved3) - 24usize];
    ["Offset of field: acpi_hmat_proximity_domain::Reserved4"]
        [::core::mem::offset_of!(acpi_hmat_proximity_domain, Reserved4) - 32usize];
};
pub type ACPI_HMAT_PROXIMITY_DOMAIN = acpi_hmat_proximity_domain;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hmat_locality {
    pub Header: ACPI_HMAT_STRUCTURE,
    pub Flags: UINT8,
    pub DataType: UINT8,
    pub MinTransferSize: UINT8,
    pub Reserved1: UINT8,
    pub NumberOfInitiatorPDs: UINT32,
    pub NumberOfTargetPDs: UINT32,
    pub Reserved2: UINT32,
    pub EntryBaseUnit: UINT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hmat_locality"][::core::mem::size_of::<acpi_hmat_locality>() - 32usize];
    ["Alignment of acpi_hmat_locality"][::core::mem::align_of::<acpi_hmat_locality>() - 1usize];
    ["Offset of field: acpi_hmat_locality::Header"]
        [::core::mem::offset_of!(acpi_hmat_locality, Header) - 0usize];
    ["Offset of field: acpi_hmat_locality::Flags"]
        [::core::mem::offset_of!(acpi_hmat_locality, Flags) - 8usize];
    ["Offset of field: acpi_hmat_locality::DataType"]
        [::core::mem::offset_of!(acpi_hmat_locality, DataType) - 9usize];
    ["Offset of field: acpi_hmat_locality::MinTransferSize"]
        [::core::mem::offset_of!(acpi_hmat_locality, MinTransferSize) - 10usize];
    ["Offset of field: acpi_hmat_locality::Reserved1"]
        [::core::mem::offset_of!(acpi_hmat_locality, Reserved1) - 11usize];
    ["Offset of field: acpi_hmat_locality::NumberOfInitiatorPDs"]
        [::core::mem::offset_of!(acpi_hmat_locality, NumberOfInitiatorPDs) - 12usize];
    ["Offset of field: acpi_hmat_locality::NumberOfTargetPDs"]
        [::core::mem::offset_of!(acpi_hmat_locality, NumberOfTargetPDs) - 16usize];
    ["Offset of field: acpi_hmat_locality::Reserved2"]
        [::core::mem::offset_of!(acpi_hmat_locality, Reserved2) - 20usize];
    ["Offset of field: acpi_hmat_locality::EntryBaseUnit"]
        [::core::mem::offset_of!(acpi_hmat_locality, EntryBaseUnit) - 24usize];
};
pub type ACPI_HMAT_LOCALITY = acpi_hmat_locality;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_hmat_cache {
    pub Header: ACPI_HMAT_STRUCTURE,
    pub MemoryPD: UINT32,
    pub Reserved1: UINT32,
    pub CacheSize: UINT64,
    pub CacheAttributes: UINT32,
    pub AddressMode: UINT16,
    pub NumberOfSMBIOSHandles: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_hmat_cache"][::core::mem::size_of::<acpi_hmat_cache>() - 32usize];
    ["Alignment of acpi_hmat_cache"][::core::mem::align_of::<acpi_hmat_cache>() - 1usize];
    ["Offset of field: acpi_hmat_cache::Header"]
        [::core::mem::offset_of!(acpi_hmat_cache, Header) - 0usize];
    ["Offset of field: acpi_hmat_cache::MemoryPD"]
        [::core::mem::offset_of!(acpi_hmat_cache, MemoryPD) - 8usize];
    ["Offset of field: acpi_hmat_cache::Reserved1"]
        [::core::mem::offset_of!(acpi_hmat_cache, Reserved1) - 12usize];
    ["Offset of field: acpi_hmat_cache::CacheSize"]
        [::core::mem::offset_of!(acpi_hmat_cache, CacheSize) - 16usize];
    ["Offset of field: acpi_hmat_cache::CacheAttributes"]
        [::core::mem::offset_of!(acpi_hmat_cache, CacheAttributes) - 24usize];
    ["Offset of field: acpi_hmat_cache::AddressMode"]
        [::core::mem::offset_of!(acpi_hmat_cache, AddressMode) - 28usize];
    ["Offset of field: acpi_hmat_cache::NumberOfSMBIOSHandles"]
        [::core::mem::offset_of!(acpi_hmat_cache, NumberOfSMBIOSHandles) - 30usize];
};
pub type ACPI_HMAT_CACHE = acpi_hmat_cache;
#[doc = " HPET - High Precision Event Timer table\n        Version 1\n\n Conforms to \"IA-PC HPET (High Precision Event Timers) Specification\",\n Version 1.0a, October 2004\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_hpet {
    pub Header: ACPI_TABLE_HEADER,
    pub Id: UINT32,
    pub Address: ACPI_GENERIC_ADDRESS,
    pub Sequence: UINT8,
    pub MinimumTick: UINT16,
    pub Flags: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_hpet"][::core::mem::size_of::<acpi_table_hpet>() - 56usize];
    ["Alignment of acpi_table_hpet"][::core::mem::align_of::<acpi_table_hpet>() - 1usize];
    ["Offset of field: acpi_table_hpet::Header"]
        [::core::mem::offset_of!(acpi_table_hpet, Header) - 0usize];
    ["Offset of field: acpi_table_hpet::Id"]
        [::core::mem::offset_of!(acpi_table_hpet, Id) - 36usize];
    ["Offset of field: acpi_table_hpet::Address"]
        [::core::mem::offset_of!(acpi_table_hpet, Address) - 40usize];
    ["Offset of field: acpi_table_hpet::Sequence"]
        [::core::mem::offset_of!(acpi_table_hpet, Sequence) - 52usize];
    ["Offset of field: acpi_table_hpet::MinimumTick"]
        [::core::mem::offset_of!(acpi_table_hpet, MinimumTick) - 53usize];
    ["Offset of field: acpi_table_hpet::Flags"]
        [::core::mem::offset_of!(acpi_table_hpet, Flags) - 55usize];
};
#[doc = " HPET - High Precision Event Timer table\n        Version 1\n\n Conforms to \"IA-PC HPET (High Precision Event Timers) Specification\",\n Version 1.0a, October 2004\n"]
pub type ACPI_TABLE_HPET = acpi_table_hpet;
pub const AcpiHpetPageProtect_ACPI_HPET_NO_PAGE_PROTECT: AcpiHpetPageProtect = 0;
pub const AcpiHpetPageProtect_ACPI_HPET_PAGE_PROTECT4: AcpiHpetPageProtect = 1;
pub const AcpiHpetPageProtect_ACPI_HPET_PAGE_PROTECT64: AcpiHpetPageProtect = 2;
pub type AcpiHpetPageProtect = ::core::ffi::c_uint;
#[doc = " IBFT - Boot Firmware Table\n        Version 1\n\n Conforms to \"iSCSI Boot Firmware Table (iBFT) as Defined in ACPI 3.0b\n Specification\", Version 1.01, March 1, 2007\n\n Note: It appears that this table is not intended to appear in the RSDT/XSDT.\n Therefore, it is not currently supported by the disassembler.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_table_ibft {
    pub Header: ACPI_TABLE_HEADER,
    pub Reserved: [UINT8; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_table_ibft"][::core::mem::size_of::<acpi_table_ibft>() - 48usize];
    ["Alignment of acpi_table_ibft"][::core::mem::align_of::<acpi_table_ibft>() - 1usize];
    ["Offset of field: acpi_table_ibft::Header"]
        [::core::mem::offset_of!(acpi_table_ibft, Header) - 0usize];
    ["Offset of field: acpi_table_ibft::Reserved"]
        [::core::mem::offset_of!(acpi_table_ibft, Reserved) - 36usize];
};
#[doc = " IBFT - Boot Firmware Table\n        Version 1\n\n Conforms to \"iSCSI Boot Firmware Table (iBFT) as Defined in ACPI 3.0b\n Specification\", Version 1.01, March 1, 2007\n\n Note: It appears that this table is not intended to appear in the RSDT/XSDT.\n Therefore, it is not currently supported by the disassembler.\n"]
pub type ACPI_TABLE_IBFT = acpi_table_ibft;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_ibft_header {
    pub Type: UINT8,
    pub Version: UINT8,
    pub Length: UINT16,
    pub Index: UINT8,
    pub Flags: UINT8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_ibft_header"][::core::mem::size_of::<acpi_ibft_header>() - 6usize];
    ["Alignment of acpi_ibft_header"][::core::mem::align_of::<acpi_ibft_header>() - 1usize];
    ["Offset of field: acpi_ibft_header::Type"]
        [::core::mem::offset_of!(acpi_ibft_header, Type) - 0usize];
    ["Offset of field: acpi_ibft_header::Version"]
        [::core::mem::offset_of!(acpi_ibft_header, Version) - 1usize];
    ["Offset of field: acpi_ibft_header::Length"]
        [::core::mem::offset_of!(acpi_ibft_header, Length) - 2usize];
    ["Offset of field: acpi_ibft_header::Index"]
        [::core::mem::offset_of!(acpi_ibft_header, Index) - 4usize];
    ["Offset of field: acpi_ibft_header::Flags"]
        [::core::mem::offset_of!(acpi_ibft_header, Flags) - 5usize];
};
pub type ACPI_IBFT_HEADER = acpi_ibft_header;
pub const AcpiIbftType_ACPI_IBFT_TYPE_NOT_USED: AcpiIbftType = 0;
pub const AcpiIbftType_ACPI_IBFT_TYPE_CONTROL: AcpiIbftType = 1;
pub const AcpiIbftType_ACPI_IBFT_TYPE_INITIATOR: AcpiIbftType = 2;
pub const AcpiIbftType_ACPI_IBFT_TYPE_NIC: AcpiIbftType = 3;
pub const AcpiIbftType_ACPI_IBFT_TYPE_TARGET: AcpiIbftType = 4;
pub const AcpiIbftType_ACPI_IBFT_TYPE_EXTENSIONS: AcpiIbftType = 5;
pub const AcpiIbftType_ACPI_IBFT_TYPE_RESERVED: AcpiIbftType = 6;
pub type AcpiIbftType = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_ibft_control {
    pub Header: ACPI_IBFT_HEADER,
    pub Extensions: UINT16,
    pub InitiatorOffset: UINT16,
    pub Nic0Offset: UINT16,
    pub Target0Offset: UINT16,
    pub Nic1Offset: UINT16,
    pub Target1Offset: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_ibft_control"][::core::mem::size_of::<acpi_ibft_control>() - 18usize];
    ["Alignment of acpi_ibft_control"][::core::mem::align_of::<acpi_ibft_control>() - 1usize];
    ["Offset of field: acpi_ibft_control::Header"]
        [::core::mem::offset_of!(acpi_ibft_control, Header) - 0usize];
    ["Offset of field: acpi_ibft_control::Extensions"]
        [::core::mem::offset_of!(acpi_ibft_control, Extensions) - 6usize];
    ["Offset of field: acpi_ibft_control::InitiatorOffset"]
        [::core::mem::offset_of!(acpi_ibft_control, InitiatorOffset) - 8usize];
    ["Offset of field: acpi_ibft_control::Nic0Offset"]
        [::core::mem::offset_of!(acpi_ibft_control, Nic0Offset) - 10usize];
    ["Offset of field: acpi_ibft_control::Target0Offset"]
        [::core::mem::offset_of!(acpi_ibft_control, Target0Offset) - 12usize];
    ["Offset of field: acpi_ibft_control::Nic1Offset"]
        [::core::mem::offset_of!(acpi_ibft_control, Nic1Offset) - 14usize];
    ["Offset of field: acpi_ibft_control::Target1Offset"]
        [::core::mem::offset_of!(acpi_ibft_control, Target1Offset) - 16usize];
};
pub type ACPI_IBFT_CONTROL = acpi_ibft_control;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct acpi_ibft_initiator {
    pub Header: ACPI_IBFT_HEADER,
    pub SnsServer: [UINT8; 16usize],
    pub SlpServer: [UINT8; 16usize],
    pub PrimaryServer: [UINT8; 16usize],
    pub SecondaryServer: [UINT8; 16usize],
    pub NameLength: UINT16,
    pub NameOffset: UINT16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acpi_ibft_initiator"][::core::mem::size_of::<acpi_ibft_initiator>() - 74usize];
    ["Alignment of acpi_ibft_initiator"][::core::mem::align_of::<acpi_ibft_initiator>() - 1usize];
    ["Offset of field: acpi_ibft_initiator::Header"]
        [::core::mem::offset_of!(acpi_ibft_initiator, Header) - 0usize];
    ["Offset of field: acpi_ibft_initiator::SnsServer"]
        [::core::mem::offset_of!(acpi_ibft_initiator, SnsServer) - 6usize];
    ["Offset of field: acpi_ibft_initiator::SlpServer"]
        [::core::mem::offset_of!(acpi_ibft_initiator, SlpServer) - 22usize];
    ["Offset of field: acpi_ibft_initiator::PrimaryServer"]
